{
    "vfp_id": "vfp_00068",
    "project_name": "cantina_kpk_oct2025.pdf",
    "findings": [
        {
            "id": 30,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Suggestion for calculatePerformanceFee()",
            "description": "The calculatePerformanceFee() function receives limited information, making it difficult to implement complex fee calculations. It could benefit from additional context such as totalSupply.\n\nThe root cause is a narrow interface that doesn't provide sufficient data for flexible fee logic, unlike _chargeManagementFee() which has more context.\n\nAn attacker could exploit the limited data by designing a fee module that behaves incorrectly under certain conditions due to lack of visibility into total supply.\n\nThe impact is reduced flexibility and potential for incorrect fee calculations in performance fee modules.\n",
            "severity": "Informational",
            "location": [
                "IPerfFeeModule.sol::calculatePerformanceFee#14",
                "kpkShares.sol::_chargePerformanceFee#823"
            ],
            "files": [
                "3e4e054b/onchain-investment-vehicles/src/FeeModules/IPerfFeeModule.sol"
            ]
        }
    ],
    "affected_files": {
        "IPerfFeeModule.sol": "// SPDX-License-Identifier: MIT\npragma solidity ^0.8;\n\n/// @title IPerfFeeModule\n/// @notice Interface for the performance fee module\n/// @dev This interface is used to calculate the performance fee for a request\n/// @dev The performance fee is calculated based on the shares price and the time elapsed\ninterface IPerfFeeModule {\n    /// @notice Calculates the performance fee based on the provided parameters\n    /// @param sharesPrice The current price per share in normalized USD units (8 decimals, i.e., _NORMALIZED_PRECISION_USD)\n    /// @param timeElapsed The time elapsed since last calculation\n    /// @param feePct The performance fee percentage in basis points\n    /// @param netSupply The net supply of shares (totalSupply - feeReceiverBalance), used as the base for fee calculations\n    /// @return The calculated performance fee amount\n    function calculatePerformanceFee(uint256 sharesPrice, uint256 timeElapsed, uint256 feePct, uint256 netSupply)\n        external\n        returns (uint256);\n}\n"
    }
}