{
    "vfp_id": "vfp_00070",
    "project_name": "cantina_kpk_oct2025.pdf",
    "findings": [
        {
            "id": 33,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ],
                "3": [
                    "CWE-1110"
                ]
            },
            "title": "Formula and sharesPrice decimals not clear",
            "description": "The formula for price calculations involving sharesPrice is unclear due to inconsistent documentation and implementation. Different parts of the code show different formulas, and the decimal precision of sharesPrice is not explicitly defined.\n\nThe root cause is lack of clear specification and documentation of the numerical model, leading to potential calculation errors.\n\nAn attacker could exploit this ambiguity to manipulate price calculations if the implementation diverges from expectations.\n\nThe impact is potential for incorrect asset and share conversions, leading to financial loss due to miscalculations.\n",
            "severity": "Informational",
            "location": [
                "IkpkShares.sol::sharesToAssets#287",
                "kpkShares.sol::sharesToAssets#493",
                "kpkShares.sol#40"
            ],
            "files": [
                "3e4e054b/onchain-investment-vehicles/src/IkpkShares.sol"
            ]
        },
        {
            "id": 34,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Comment of event RedemptionRequest not accurate",
            "description": "The comments for the RedemptionRequest event incorrectly describe the parameters: assetsAmount is documented as \"number of shares being redeemed\" and sharesAmount as \"number of assets being used\".\n\nThe root cause is swapped parameter descriptions in the NatSpec comments.\n\nAn attacker could exploit this by misleading developers integrating with the contract, causing them to misinterpret event data.\n\nThe impact is developer confusion and potential for incorrect event parsing in frontends and monitoring tools.\n",
            "severity": "Informational",
            "location": [
                "IkpkShares.sol::RedemptionRequest#185"
            ],
            "files": [
                "3e4e054b/onchain-investment-vehicles/src/IkpkShares.sol"
            ]
        },
        {
            "id": 36,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1357"
                ]
            },
            "title": "OpenZeppelin EnumerableMap / EnumerableSet could be used",
            "description": "The contract uses a custom combination of _approvedAssets and _approvedAssetsMap to track assets, which could be simplified using OpenZeppelin's EnumerableMap or EnumerableSet.\n\nThe root cause is reinventing functionality that is already securely implemented in well-audited libraries.\n\nAn attacker could exploit the custom implementation if it contains undiscovered bugs, though none are present currently.\n\nThe impact is increased code complexity and maintenance burden without security benefit.\n",
            "severity": "Informational",
            "location": [
                "IkpkShares.sol#79",
                "kpkShares.sol#64",
                "kpkShares.sol#893"
            ],
            "files": [
                "3e4e054b/onchain-investment-vehicles/src/IkpkShares.sol"
            ]
        },
        {
            "id": 51,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-684"
                ],
                "3": [
                    "CWE-440"
                ]
            },
            "title": "Parameter semantic mismatch between interface/docs and implementation (price vs minSharesOut)",
            "description": "1. **Description:** The requestSubscription function in IkpkShares documents its second parameter as sharesPrice, but the implementation treats it as minSharesOut.\n2. **Cause:** Mismatch in naming and semantics between the interface, implementation, and documentation.\n3. **Exploitation:** Integrators may pass a price value where a minimum output is expected, leading to incorrect slippage checks or unintended behavior.\n4. **Impact:** Could result in unexpected reverts, incorrect trade execution, or user funds being exposed to slippage beyond intended limits.\n",
            "severity": "Informational",
            "location": [
                "IkpkShares.sol#L334"
            ],
            "files": [
                "3e4e054b/onchain-investment-vehicles/src/IkpkShares.sol"
            ]
        },
        {
            "id": 53,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "redemptionFee documented in assets but emitted in shares",
            "description": "1. **Description:** The interface documentation states that redemptionFee is in assets, but the implementation emits it in shares.\n2. **Cause:** Documentation and implementation are inconsistent in units used for the redemption fee.\n3. **Exploitation:** Integrators or analytics tools relying on the event data may misinterpret the fee amount.\n4. **Impact:** Incorrect UI displays, flawed accounting systems, or misinformed user decisions due to unit confusion.\n",
            "severity": "Informational",
            "location": [
                "IkpkShares.sol#L202"
            ],
            "files": [
                "3e4e054b/onchain-investment-vehicles/src/IkpkShares.sol"
            ]
        }
    ],
    "affected_files": {
        "IkpkShares.sol": "// SPDX-License-Identifier: MIT\npragma solidity ^0.8;\n\nimport {IERC165} from \"@openzeppelin/contracts/utils/introspection/IERC165.sol\";\n\ninterface IkpkShares is IERC165 {\n    //\n    // Errors\n    //\n\n    /// @notice Error when attempting to cancel a request that hasn't passed his TTL yet\n    error RequestNotPastTtl();\n\n    /// @notice Error when attempting to cancel a request that is not pending\n    error RequestNotPending();\n\n    /// @notice Error when the asset is not approved for redemptions\n    error UnredeemableAsset();\n\n    /// @notice Error when invalid arguments are provided\n    error InvalidArguments();\n\n    /// @notice Error when the caller is not authorized to perform the action\n    error NotAuthorized();\n\n    /// @notice Error when the asset is not approved for deposits\n    error NotAnApprovedAsset();\n\n    /// @notice Error when the fee rate is too high\n    error FeeRateLimitExceeded();\n\n    /// @notice Error when the request type does not match the expected type\n    error RequestTypeMismatch();\n\n    /// @notice Error when the request price is lower than the operator price\n    error RequestPriceLowerThanOperatorPrice();\n\n    /// @notice Error when the price deviation from the last settled price is too large\n    error PriceDeviationTooLarge();\n\n    /// @notice Error when no stored price is available for the asset\n    error NoStoredPrice();\n\n    //\n    // Structs\n    //\n\n    /// @notice Struct representing an approved asset for deposits and redemptions\n    /// @param asset The address of the asset\n    /// @param symbol The asset's symbol (e.g., \"USDC\", \"ETH\")\n    /// @param decimals The number of decimal places for the asset\n    /// @param isFeeModuleAsset Whether the asset can be used for performance fee module calculations\n    /// @param canDeposit Whether the asset is approved for deposits\n    /// @param canRedeem Whether the asset is approved for redemptions\n    struct ApprovedAsset {\n        address asset;\n        string symbol;\n        uint8 decimals;\n        bool isFeeModuleAsset;\n        bool canDeposit;\n        bool canRedeem;\n    }\n\n    /// @notice Struct representing a request for subscription or redemption.\n    /// @param requestId The unique identifier for the request\n    /// @param requestType The type of request (SUBSCRIPTION or REDEMPTION)\n    /// @param requestStatus The current status of the request\n    /// @param asset The address of the asset involved in the request\n    /// @param assetAmount The amount of assets involved in the request\n    /// @param sharesAmount The number of shares involved in the request\n    /// @param investor The submitter of the request\n    /// @param receiver The receiver of the assets or shares in a successful request\n    /// @param timestamp The timestamp when the request was created\n    /// @param expiryAt The timestamp when the request expires (cannot be approved after this time)\n    struct UserRequest {\n        // Request metadata\n        RequestType requestType;\n        RequestStatus requestStatus;\n        // Financial details\n        address asset;\n        uint256 assetAmount;\n        uint256 sharesAmount;\n        // User details\n        address investor;\n        address receiver;\n        // Timestamps\n        uint64 timestamp;\n        uint64 expiryAt;\n    }\n\n    //\n    // Enums\n    //\n    /// @notice Enum representing the type of request\n    enum RequestType {\n        SUBSCRIPTION,\n        REDEMPTION\n    }\n\n    /// @notice Enum representing the status of a request\n    enum RequestStatus {\n        PENDING,\n        PROCESSED,\n        REJECTED,\n        CANCELLED\n    }\n\n    //\n    // Events\n    //\n\n    /// @notice Event emitted when a subscription request is made.\n    /// @param investor The investor of the shares being subscribed.\n    /// @param requestId The unique identifier for the request.\n    /// @param receiver The receiver of the shares in a successful request.\n    /// @param subscriptionAsset The address of the asset being subscribed.\n    /// @param assetsAmount The number of assets being subscribed.\n    /// @param sharesAmount The number of shares being issued.\n    /// @param timestamp The timestamp when the request was created\n    /// @param cancelableFrom The timestamp from which the request can be cancelled (timestamp + subscriptionRequestTtl)\n    /// @param expiryAt The timestamp when the request expires (timestamp + maxLifetime)\n    event SubscriptionRequest(\n        address indexed investor,\n        uint256 requestId,\n        address indexed receiver,\n        address indexed subscriptionAsset,\n        uint256 assetsAmount,\n        uint256 sharesAmount,\n        uint64 timestamp,\n        uint64 cancelableFrom,\n        uint64 expiryAt\n    );\n\n    /// @notice Event emitted when a subscription request is fulfilled.\n    /// @param requestId The unique identifier for the request.\n    /// @param assets The number of assets subscribed.\n    /// @param shares The number of shares issued.\n    event SubscriptionApproval(uint256 requestId, uint256 assets, uint256 shares);\n\n    /// @notice Event emitted when a subscription is cancelled\n    /// @param requestId The unique identifier for the request.\n    /// @param canceller account who cancelled the subscription\n    event SubscriptionCancellation(uint256 requestId, address canceller);\n\n    /// @notice Event emitted when a subscription request is denied.\n    /// @param requestId The unique identifier for the request.\n    /// @param assets The number of assets involved in the request.\n    /// @param shares The number of shares requested.\n    event SubscriptionDenial(uint256 requestId, uint256 assets, uint256 shares);\n\n    /// @notice Event emitted when a redemption request is made.\n    /// @param investor The investor of the shares being redeemed.\n    /// @param requestId The unique identifier for the request.\n    /// @param receiver The receiver of the assets in a successful request.\n    /// @param redemptionAsset The address of the asset being redeemed.\n    /// @param assetsAmount The number of assets being redeemed.\n    /// @param sharesAmount The number of shares being used.\n    /// @param timestamp The timestamp when the request was created\n    /// @param cancelableFrom The timestamp from which the request can be cancelled (timestamp + redemptionRequestTtl)\n    /// @param expiryAt The timestamp when the request expires (timestamp + maxLifetime)\n    event RedemptionRequest(\n        address indexed investor,\n        uint256 requestId,\n        address indexed receiver,\n        address indexed redemptionAsset,\n        uint256 assetsAmount,\n        uint256 sharesAmount,\n        uint64 timestamp,\n        uint64 cancelableFrom,\n        uint64 expiryAt\n    );\n\n    /// @notice Event emitted when a redemption request is fulfilled.\n    /// @param requestId The unique identifier for the request.\n    /// @param assets The number of assets redeemed.\n    /// @param shares The number of shares returned.\n    /// @param redemptionFee The amount of shares charged as redemption fee\n    event RedemptionApproval(uint256 requestId, uint256 assets, uint256 shares, uint256 redemptionFee);\n\n    /// @notice Event emitted when a redemption request is denied.\n    /// @param requestId The unique identifier for the request.\n    /// @param assets The number of assets involved in the request.\n    /// @param shares The number of shares requested.\n    event RedemptionDenial(uint256 requestId, uint256 assets, uint256 shares);\n\n    /// @notice Event emitted when a redemption is cancelled\n    /// @param requestId The unique identifier for the request.\n    /// @param canceller account who cancelled the request\n    event RedemptionCancellation(uint256 requestId, address canceller);\n\n    /// @notice Event emitted when subscriptionRequestTtl is updated (only when value changes)\n    /// @param ttl The new ttl\n    event SubscriptionRequestTtlUpdate(uint64 ttl);\n\n    /// @notice Event emitted when redemptionRequestTtl is updated (only when value changes)\n    /// @param ttl The new ttl\n    event RedemptionRequestTtlUpdate(uint64 ttl);\n\n    /// @notice Event emitted when a subscription request is skipped due to expiry\n    /// @param requestId The unique identifier for the expired request\n    /// @param expiryAt The timestamp when the request expired\n    event SubscriptionRequestExpired(uint256 requestId, uint64 expiryAt);\n\n    /// @notice Event emitted when a redemption request is skipped due to expiry\n    /// @param requestId The unique identifier for the expired request\n    /// @param expiryAt The timestamp when the request expired\n    event RedemptionRequestExpired(uint256 requestId, uint64 expiryAt);\n\n    /// @notice Event emitted when fees are collected (only when at least one fee > 0)\n    /// @param managementFee The amount of assets charged as management fee\n    /// @param performanceFee The amount of assets charged as performance fee\n    event FeeCollection(uint256 managementFee, uint256 performanceFee);\n\n    /// @notice Event emitted when fee receiver is updated\n    /// @param newFeeReceiver The new fee receiver address\n    event FeeReceiverUpdate(address indexed newFeeReceiver);\n\n    /// @notice Event emitted when management fee rate is updated (only when value changes)\n    /// @param newRate The new management fee rate (in basis points, 2000 = 20%)\n    event ManagementFeeRateUpdate(uint256 newRate);\n\n    /// @notice Event emitted when redemption fee is updated (only when value changes)\n    /// @param newRate The new redemption fee (in basis points, 2000 = 20%)\n    event RedemptionFeeRateUpdate(uint256 newRate);\n\n    /// @notice Event emitted when performance fee is updated (only when value changes)\n    /// @param newRate The new performance fee (in basis points, 2000 = 20%)\n    event PerformanceFeeRateUpdate(uint256 newRate);\n\n    /// @notice Event emitted when performance fee module is updated\n    /// @param newPerformanceFeeModule The new performance fee module address\n    event PerformanceFeeModuleUpdate(address indexed newPerformanceFeeModule);\n\n    /// @notice Event emitted when an asset is updated\n    /// @param asset The address of the asset\n    /// @param isFeeModuleAsset Whether the asset can be used for performance fee module calculations\n    /// @param canDeposit Whether the asset is approved for deposits\n    /// @param canRedeem Whether the asset is approved for redemptions\n    event AssetUpdate(address indexed asset, bool isFeeModuleAsset, bool canDeposit, bool canRedeem);\n\n    /// @notice Event emitted when an asset is added\n    /// @param asset The address of the asset\n    event AssetAdd(address indexed asset);\n\n    /// @notice Event emitted when an asset is removed\n    /// @param asset The address of the asset\n    event AssetRemove(address indexed asset);\n\n    //\n    // View Functions\n    //\n\n    /// @notice Returns the asset configuration for a specific asset\n    /// @param asset The address of the asset\n    /// @return The asset configuration including symbol, decimals, and oracle\n    function getApprovedAsset(address asset) external view returns (ApprovedAsset memory);\n\n    /// @notice Returns the list of approved assets\n    /// @return An array of approved asset addresses\n    function getApprovedAssets() external view returns (address[] memory);\n\n    /// @notice Checks if an asset is approved for deposits or redemptions\n    /// @param asset The address of the asset to check\n    /// @return True if the asset is approved for deposits or redemptions\n    function isApprovedAsset(address asset) external view returns (bool);\n\n    /// @notice Returns the number of decimals for an asset\n    /// @param asset The address of the asset\n    /// @return The number of decimals for the asset\n    function assetDecimals(address asset) external view returns (uint8);\n\n    /// @notice Returns the amount of shares that the Vault would exchange for the amount of assets provided, in an\n    /// ideal scenario.\n    ///\n    /// The conversion is based on the current price per share. The formula is:\n    ///     shares = (assetAmount * 10^shareDecimals * 1e8) / (sharesPrice * 10^assetDecimals)\n    ///\n    /// @param assetAmount The amount of assets (in asset's native decimals).\n    /// @param sharesPrice The current price per share in normalized USD units (8 decimals, i.e., _NORMALIZED_PRECISION_USD).\n    /// @param subscriptionAsset The address of the asset being subscribed.\n    /// @return The equivalent amount of shares (in share token's native decimals, typically 18).\n    function assetsToShares(uint256 assetAmount, uint256 sharesPrice, address subscriptionAsset)\n        external\n        view\n        returns (uint256);\n\n    /// @notice Returns the amount of assets that the Vault would exchange for the amount of shares provided, in an\n    /// ideal scenario.\n    ///\n    /// The conversion is based on the current price per share. The formula is:\n    ///     assets = (shares * sharesPrice * 10^assetDecimals) / (1e8 * 10^shareDecimals)\n    ///\n    /// @param shares The amount of shares (in share token's native decimals, typically 18).\n    /// @param sharesPrice The current price per share in normalized USD units (8 decimals, i.e., _NORMALIZED_PRECISION_USD).\n    /// @param redemptionAsset The address of the asset to redeem for.\n    /// @return The equivalent amount of assets (in asset's native decimals).\n    function sharesToAssets(uint256 shares, uint256 sharesPrice, address redemptionAsset)\n        external\n        view\n        returns (uint256);\n\n    //\n    // Subscription Functions\n    //\n\n    /// @notice Preview a subscription request\n    /// @param assets The amount of assets to subscribe (in asset's native decimals)\n    /// @param sharesPrice The current price per share in normalized USD units (8 decimals, i.e., _NORMALIZED_PRECISION_USD). Use 0 to use the last settled price.\n    /// @param subscriptionAsset The address of the asset being subscribed\n    /// @return shares The amount of shares that would be received (in share token's native decimals, typically 18)\n    function previewSubscription(uint256 assets, uint256 sharesPrice, address subscriptionAsset)\n        external\n        view\n        returns (uint256 shares);\n\n    /// @notice Request a subscription of assets\n    /// @param assetsIn The amount of assets to subscribe\n    /// @param minSharesOut The minimum amount of shares to receive (slippage protection)\n    /// @param subscriptionAsset The address of the asset being subscribed\n    /// @param receiver The address that will receive the shares\n    /// @return requestId The ID of the created subscription request\n    /// @dev Gas cost: ~278,000 gas\n    /// @dev The minimum shares output is used for slippage protection. The actual shares minted will be computed from the current price at approval time.\n    function requestSubscription(uint256 assetsIn, uint256 minSharesOut, address subscriptionAsset, address receiver)\n        external\n        returns (uint256 requestId);\n\n    /// @notice Cancel a subscription request\n    /// @param id The ID of the subscription request to cancel\n    function cancelSubscription(uint256 id) external;\n\n    /// @notice Process requests (approve/reject)\n    /// @param approveRequests Array of request IDs to approve\n    /// @param rejectRequests Array of request IDs to reject\n    /// @param asset The asset to process requests for\n    /// @param sharesPrice The current price per share in normalized USD units (8 decimals, i.e., _NORMALIZED_PRECISION_USD)\n    /// @dev Gas cost: ~71,000 gas per approval, ~15,000 gas per rejection\n    function processRequests(\n        uint256[] calldata approveRequests,\n        uint256[] calldata rejectRequests,\n        address asset,\n        uint256 sharesPrice\n    ) external;\n\n    //\n    // Redemption Functions\n    //\n\n    /// @notice Preview a redemption request\n    /// @param shares The amount of shares to redeem (in share token's native decimals, typically 18)\n    /// @param sharesPrice The current price per share in normalized USD units (8 decimals, i.e., _NORMALIZED_PRECISION_USD). Use 0 to use the last settled price.\n    /// @param redemptionAsset The address of the asset to redeem for\n    /// @return assets The amount of assets that would be received (after fees, in asset's native decimals)\n    function previewRedemption(uint256 shares, uint256 sharesPrice, address redemptionAsset)\n        external\n        view\n        returns (uint256 assets);\n\n    /// @notice Request to redeem shares for assets\n    /// @param sharesIn The amount of shares to redeem\n    /// @param minAssetsOut The minimum amount of assets to receive (slippage protection)\n    /// @param redemptionAsset The address of the asset to redeem for\n    /// @param receiver The address that will receive the assets\n    /// @return requestId The ID of the redemption request\n    /// @dev Gas cost: ~192,000 gas\n    /// @dev The minimum assets output is used for slippage protection. The actual assets received will be computed from the current price at approval time.\n    function requestRedemption(uint256 sharesIn, uint256 minAssetsOut, address redemptionAsset, address receiver)\n        external\n        returns (uint256 requestId);\n\n    /// @notice Cancel a redemption request\n    /// @param id The ID of the redemption request to cancel\n    function cancelRedemption(uint256 id) external;\n\n    //\n    // Admin Functions\n    //\n\n    /// @notice Sets the subscription request TTL for all pending subscription requests (only emits event when value changes)\n    /// @param ttl The new TTL to apply (max 7 days)\n    /// @dev Changing this value affects all pending requests, not just new ones. The TTL is used during validation\n    ///      when canceling requests, so updating it changes the cancellation behavior for existing pending requests.\n    function setSubscriptionRequestTtl(uint64 ttl) external;\n\n    /// @notice Sets the redemption request TTL for all pending redemption requests (only emits event when value changes)\n    /// @param ttl The new TTL to apply (max 7 days)\n    /// @dev Changing this value affects all pending requests, not just new ones. The TTL is used during validation\n    ///      when canceling requests, so updating it changes the cancellation behavior for existing pending requests.\n    function setRedemptionRequestTtl(uint64 ttl) external;\n\n    /// @notice Sets the fee receiver address\n    /// @param newFeeReceiver The new fee receiver address\n    function setFeeReceiver(address newFeeReceiver) external;\n\n    /// @notice Sets the management fee rate (only emits event when value changes)\n    /// @param newRate The new management rate (in basis points, max 2000 = 20%)\n    function setManagementFeeRate(uint256 newRate) external;\n\n    /// @notice Sets the redemption fee rate (only emits event when value changes)\n    /// @param newRate The new redemption fee (in basis points, max 2000 = 20%)\n    function setRedemptionFeeRate(uint256 newRate) external;\n\n    /// @notice Sets the performance fee rate (only emits event when value changes)\n    /// @param newRate The new performance fee (in basis points, max 2000 = 20%)\n    /// @param usdAsset The USD asset to use for performance fee calculations\n    function setPerformanceFeeRate(uint256 newRate, address usdAsset) external;\n\n    /// @notice Sets the performance fee module\n    /// @param newPerformanceFeeModule The new performance fee module address\n    function setPerformanceFeeModule(address newPerformanceFeeModule) external;\n\n    /// @notice Updates an asset configuration for deposits and redemption\n    /// @param asset The asset address to configure\n    /// @param isFeeModuleAsset Whether the asset can be used for performance fee module calculations\n    /// @param canDeposit Whether the asset is approved for deposits\n    /// @param canRedeem Whether the asset is approved for redemptions\n    function updateAsset(address asset, bool isFeeModuleAsset, bool canDeposit, bool canRedeem) external;\n\n    /// @notice Returns a request (deposit or redeem) by ID\n    /// @param id The request IDs\n    /// @return The request details\n    function getRequest(uint256 id) external view returns (UserRequest memory);\n\n    /// @notice Returns the current redemption fee rate\n    /// @return The redemption fee rate in basis points (1000 = 10%)\n    function redemptionFeeRate() external view returns (uint256);\n\n    /// @notice Returns the current management fee rate\n    /// @return The management fee rate in basis points (1000 = 10%)\n    function managementFeeRate() external view returns (uint256);\n\n    /// @notice Returns the portfolio safe address where assets are transferred\n    /// @return The portfolio safe address\n    function portfolioSafe() external view returns (address);\n\n    /// @notice Returns the performance fee module address\n    /// @return The performance fee module address\n    function performanceFeeModule() external view returns (address);\n\n    /// @notice Returns the fee receiver address\n    /// @return The fee receiver address\n    function feeReceiver() external view returns (address);\n\n    /// @notice Returns the performance fee rate\n    /// @return The performance fee rate in basis points (1000 = 10%)\n    function performanceFeeRate() external view returns (uint256);\n\n    /// @notice Returns the current request ID counter\n    /// @return The current request ID\n    function requestId() external view returns (uint256);\n\n    /// @notice Returns the subscription request TTL\n    /// @return The subscription request TTL in seconds\n    function subscriptionRequestTtl() external view returns (uint64);\n\n    /// @notice Returns the redemption request TTL\n    /// @return The redemption request TTL in seconds\n    function redemptionRequestTtl() external view returns (uint64);\n\n    /// @notice Returns the subscription assets mapping for a specific asset\n    /// @param asset The address of the asset\n    /// @return The amount of assets pending in subscription requests for this asset\n    function subscriptionAssets(address asset) external view returns (uint256);\n\n    /// @notice Returns the last settled price for a specific asset\n    /// @param asset The address of the asset\n    /// @return The last settled price per share in normalized USD units (8 decimals), or 0 if no price has been settled yet\n    function getLastSettledPrice(address asset) external view returns (uint256);\n}\n"
    }
}