{
    "vfp_id": "vfp_00117",
    "project_name": "Uniswap Labs UNIfication Fees Audit.md",
    "findings": [
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Unused Custom Error",
            "description": "The IV3FeeController interface defines a custom error named AmountCollectedTooLow, suggesting an intent to validate minimum fee collection amounts during the collect operation. However, the implementing contract V3FeeController does not use this error anywhere, and no such validation is performed in the collect function. The root cause is a discrepancy between interface design and implementation logic. This could mislead external developers or integrators into assuming a validation exists when it does not. The impact is limited to potential confusion and incorrect assumptions about the contract's behavior, with no direct exploit risk.\n",
            "severity": null,
            "location": [
                "IV3FeeController.sol#8",
                "V3FeeController.sol#52"
            ],
            "files": [
                "phoenix-fees/src/interfaces/IV3FeeController.sol"
            ]
        }
    ],
    "affected_files": {
        "IV3FeeController.sol": "// SPDX-License-Identifier: AGPL-3.0-only\npragma solidity ^0.8.29;\n\nimport {IUniswapV3Factory} from \"v3-core/contracts/interfaces/IUniswapV3Factory.sol\";\n\ninterface IV3FeeController {\n  /// @notice Thrown when the amount collected is less than the amount expected.\n  error AmountCollectedTooLow(uint256 amountCollected, uint256 amountExpected);\n\n  /// @notice Thrown when the merkle proof is invalid.\n  error InvalidProof();\n\n  /// @notice Thrown when trying to set a default fee for a non-enabled fee tier.\n  error InvalidFeeTier();\n\n  /// @notice Thrown when an unauthorized address attempts to call a restricted function\n  error Unauthorized();\n\n  /// @notice The input parameters for the collection.\n  struct CollectParams {\n    /// @param pool The pool to collect fees from.\n    address pool;\n    /// @param amount0Requested The amount of token0 to collect. If this is higher than the total\n    /// collectable amount, it will collect all but 1 wei of the total token0 allotment.\n    uint128 amount0Requested;\n    /// @param amount1Requested The amount of token1 to collect. If this is higher than the total\n    /// collectable amount, it will collect all but 1 wei of the total token1 allotment.\n    uint128 amount1Requested;\n  }\n\n  /// @notice The returned amounts of token0 and token1 that are collected.\n  struct Collected {\n    /// @param amount0Collected The amount of token0 that is collected.\n    uint128 amount0Collected;\n    /// @param amount1Collected The amount of token1 that is collected.\n    uint128 amount1Collected;\n  }\n\n  /// @return The address where collected fees are sent.\n  function ASSET_SINK() external view returns (address);\n\n  /// @return The Uniswap V3 Factory contract.\n  function FACTORY() external view returns (IUniswapV3Factory);\n\n  /// @return The current merkle root used to designate which pools have a fee enabled\n  function merkleRoot() external view returns (bytes32);\n\n  /// @return The authorized address to set fees-by-fee-tier AND the merkle root\n  function feeSetter() external view returns (address);\n\n  /// @notice Returns the default fee value for a given fee tier.\n  /// @param feeTier The fee tier to query.\n  /// @return defaultFeeValue The default fee value expressed as the denominator on the inclusive\n  /// interval [4, 10]. The fee value is packed (token1Fee << 4 | token0Fee)\n  function defaultFees(uint24 feeTier) external view returns (uint8 defaultFeeValue);\n\n  /// @notice Enables a new fee tier on the Uniswap V3 Factory.\n  /// @dev Only callable by `owner`\n  /// @param newFeeTier The fee tier to enable.\n  /// @param tickSpacing The corresponding tick spacing for the new fee tier.\n  function enableFeeAmount(uint24 newFeeTier, int24 tickSpacing) external;\n\n  /// @notice Collects protocol fees from the specified pools to the designated `ASSET_SINK`\n  /// @param collectParams Array of collection parameters for each pool.\n  /// @return amountsCollected Array of collected amounts for each pool.\n  function collect(CollectParams[] calldata collectParams)\n    external\n    returns (Collected[] memory amountsCollected);\n\n  /// @notice Sets the merkle root used for designating which pools have the fee enabled.\n  /// @dev Only callable by `feeSetter`\n  /// @param _merkleRoot The new merkle root to set.\n  function setMerkleRoot(bytes32 _merkleRoot) external;\n\n  /// @notice Sets the default fee value for a specific fee tier.\n  /// @param feeTier The fee tier, expressed in pips, to set the default fee for.\n  /// @param defaultFeeValue The default fee value to set, expressed as the denominator on the\n  /// inclusive interval [4, 10]. The fee value is packed (token1Fee << 4 | token0Fee)\n  function setDefaultFeeByFeeTier(uint24 feeTier, uint8 defaultFeeValue) external;\n\n  /// @notice Triggers a fee update for a single pool with merkle proof verification.\n  /// @param pool The pool address to update the fee for.\n  /// @param merkleProof The merkle proof corresponding to the set merkle root.\n  function triggerFeeUpdate(address pool, bytes32[] calldata merkleProof) external;\n\n  /// @notice Triggers fee updates for multiple pools with batch merkle proof verification.\n  /// @param pools The pool addresses to update fees for.\n  /// @param proof The merkle proof corresponding to the set merkle root.\n  /// @param proofFlags The flags for the merkle proof verification.\n  function batchTriggerFeeUpdate(\n    address[] calldata pools,\n    bytes32[] calldata proof,\n    bool[] calldata proofFlags\n  ) external;\n\n  /// @notice Sets a new fee setter address.\n  /// @param newFeeSetter The new address authorized to set fees and merkle roots.\n  function setFeeSetter(address newFeeSetter) external;\n}\n"
    }
}