{
    "vfp_id": "vfp_00304",
    "project_name": "Across Protocol OFT Integration Differential Audit.md",
    "findings": [
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Misleading Documentation",
            "description": "Several parts of the codebase contain outdated or incorrect documentation. For example, the `Universal_Adapter` contract claims to only use `CircleCCTPAdapter` for USDC, but it also supports OFT. Similarly, a comment in `AlephZero_SpokePool` claims Arbitrum only supports Solidity 0.8.19, which is false. The root cause is failure to update comments after implementation changes. This can mislead developers and auditors, leading to incorrect assumptions about functionality and potentially introducing bugs during maintenance or integration. While not directly exploitable, it increases operational risk.\n",
            "severity": "Low",
            "location": [
                "Universal_Adapter.sol#74",
                "AlephZero_SpokePool.sol#3"
            ],
            "files": [
                "contracts/contracts/chain-adapters/Universal_Adapter.sol"
            ]
        }
    ],
    "affected_files": {
        "Universal_Adapter.sol": "// SPDX-License-Identifier: BUSL-1.1\npragma solidity ^0.8.0;\n\nimport \"./interfaces/AdapterInterface.sol\";\n\nimport \"../libraries/CircleCCTPAdapter.sol\";\nimport { SpokePoolInterface } from \"../interfaces/SpokePoolInterface.sol\";\nimport { HubPoolStore } from \"./utilities/HubPoolStore.sol\";\nimport { IOFT } from \"../interfaces/IOFT.sol\";\n\nimport \"../libraries/OFTTransportAdapterWithStore.sol\";\n\ninterface IOwnable {\n    function owner() external view returns (address);\n}\n\n/**\n * @notice Stores data that can be relayed to L2 SpokePool using storage proof verification and light client contracts\n * on the L2 where the SpokePool is deployed. Designed to be used as a singleton contract that can be used to relay\n * messages to multiple SpokePools on different chains.\n * @dev This contract should NOT be reused to send messages to SpokePools that have the same address on different L2s.\n * @dev This contract can be redeployed to point to a new HubPoolStore if the data store gets corrupted and new data\n * can't get written to the store for some reason. The corresponding Universal_SpokePool contract will\n * also need to be redeployed to point to the new HubPoolStore.\n * @custom:security-contact bugs@across.to\n */\ncontract Universal_Adapter is AdapterInterface, CircleCCTPAdapter, OFTTransportAdapterWithStore {\n    /// @notice Contract that stores calldata to be relayed to L2 via storage proofs.\n    HubPoolStore public immutable DATA_STORE;\n\n    error NotImplemented();\n\n    constructor(\n        HubPoolStore _store,\n        IERC20 _l1Usdc,\n        ITokenMessenger _cctpTokenMessenger,\n        uint32 _cctpDestinationDomainId,\n        address _adapterStore,\n        uint32 _oftDstEid,\n        uint256 _oftFeeCap\n    )\n        CircleCCTPAdapter(_l1Usdc, _cctpTokenMessenger, _cctpDestinationDomainId)\n        OFTTransportAdapterWithStore(_oftDstEid, _oftFeeCap, _adapterStore)\n    {\n        DATA_STORE = _store;\n    }\n\n    /**\n     * @notice Saves calldata in a simple storage contract whose state can be proven and relayed to L2.\n     * @param target Contract on the destination that will receive the message. Unused if the message is created\n     * by the HubPool admin.\n     * @param message Data to send to target.\n     */\n    function relayMessage(address target, bytes calldata message) external payable override {\n        // Admin messages are stored differently in the data store than non-admin messages, because admin\n        // messages must only be sent to a single target on a specific L2 chain. Non-admin messages are sent\n        // to any target on any L2 chain because the only type of an non-admin message is the result of a\n        // HubPool.executeRootBundle() call which attempts to relay a relayRootBundle() call to all SpokePools using\n        // this adapter. Therefore, non-admin messages are stored optimally in the data store\n        // by only storing the message once and allowing any SpokePool target to read it via storage proofs.\n\n        // We assume that the HubPool is delegatecall-ing into this function, therefore address(this) is the HubPool's\n        // address. As a result, we can determine whether this message is an admin function based on the msg.sender.\n        // If an admin sends a message that could have been relayed as a non-admin message (e.g. the admin\n        // calls executeRootBundle()), then the message won't be stored optimally in the data store, but the\n        // message can still be delivered to the target.\n        bool isAdminSender = msg.sender == IOwnable(address(this)).owner();\n        DATA_STORE.storeRelayMessageCalldata(target, message, isAdminSender);\n        emit MessageRelayed(target, message);\n    }\n\n    /**\n     * @notice Relays tokens from L1 to L2.\n     * @dev This function only uses the CircleCCTPAdapter to relay USDC tokens to CCTP enabled L2 chains.\n     * Relaying other tokens will cause this function to revert.\n     * @param l1Token Address of the token on L1.\n     * @param l2Token Address of the token on L2. Unused\n     * @param amount Amount of tokens to relay.\n     * @param to Address to receive the tokens on L2. Should be SpokePool address.\n     */\n    function relayTokens(\n        address l1Token,\n        address l2Token,\n        uint256 amount,\n        address to\n    ) external payable override {\n        address oftMessenger = _getOftMessenger(l1Token);\n        if (_isCCTPEnabled() && l1Token == address(usdcToken)) {\n            _transferUsdc(to, amount);\n        } else if (oftMessenger != address(0)) {\n            _transferViaOFT(IERC20(l1Token), IOFT(oftMessenger), to, amount);\n        } else {\n            revert NotImplemented();\n        }\n    }\n}\n"
    }
}