{
    "vfp_id": "vfp_00283",
    "project_name": "UMA Oracle Bridging Contracts Upgrade Audit.md",
    "findings": [
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Misleading or Incorrect Docstrings",
            "description": "Several docstrings and comments in the codebase are inaccurate or unclear, potentially leading to misunderstandings during maintenance or integration. Specifically, the use of \"its\" instead of \"it is\", references to \"ancillary data\" instead of \"compressed ancillary data\", and incorrect statements about conditional compression when in fact compression is always applied, all contribute to misleading documentation. The cause is outdated or imprecise commenting that does not reflect the current implementation. While this does not introduce direct security risks, it can lead to incorrect assumptions by developers or off-chain systems interacting with the contracts. The impact is reduced code clarity and potential integration errors. These issues were resolved by updating the relevant comments in the codebase.\n",
            "severity": "Informational",
            "location": [
                "AncillaryDataCompression.sol#L17",
                "AncillaryDataCompression.sol#L19",
                "OracleSpoke.sol#L107-L108",
                "OracleSpoke.sol#L252",
                "OracleChildTunnel.sol#L196"
            ],
            "files": [
                "protocol/packages/core/contracts/cross-chain-oracle/AncillaryDataCompression.sol"
            ]
        }
    ],
    "affected_files": {
        "AncillaryDataCompression.sol": "// SPDX-License-Identifier: AGPL-3.0-only\npragma solidity ^0.8.0;\n\nimport { AncillaryData } from \"../common/implementation/AncillaryData.sol\";\n\n/**\n * @title Library for compressing ancillary data when bridging DVM price requests to mainnet.\n * @notice This provides internal method for origin chain oracles to compress ancillary data by replacing it with the\n * hash of the original ancillary data and adding additional information to track back the original ancillary data on\n * mainnet.\n */\nlibrary AncillaryDataCompression {\n    /**\n     * @notice Compresses ancillary data by providing sufficient information to track back the original ancillary data\n     * on mainnet.\n     * @dev The compression replaces original ancillary data with its hash and adds address of origin chain oracle and\n     * block number so that its more efficient to fetch original ancillary data from PriceRequestBridged event on origin\n     * chain indexed by parentRequestId. This parentRequestId can be reconstructed by taking keccak256 hash of ABI\n     * encoded price identifier, time and ancillary data.\n     * @param ancillaryData original ancillary data to be processed.\n     * @param requester address of the requester who initiated the price request.\n     * @param requestBlockNumber block number when the price request was initiated.\n     * @return compressed ancillary data.\n     */\n    function compress(\n        bytes memory ancillaryData,\n        address requester,\n        uint256 requestBlockNumber\n    ) internal view returns (bytes memory) {\n        return\n            AncillaryData.appendKeyValueUint(\n                AncillaryData.appendKeyValueAddress(\n                    AncillaryData.appendKeyValueAddress(\n                        AncillaryData.appendKeyValueUint(\n                            AncillaryData.appendKeyValueBytes32(\"\", \"ancillaryDataHash\", keccak256(ancillaryData)),\n                            \"childBlockNumber\",\n                            requestBlockNumber\n                        ),\n                        \"childOracle\",\n                        address(this)\n                    ),\n                    \"childRequester\",\n                    requester\n                ),\n                \"childChainId\",\n                block.chainid\n            );\n    }\n}\n"
    }
}