{
    "path": "dataset-curated/reports/Sherlock/2024.07.11 - Final - Deepr Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/sherlock-audit/2024-06-deepr-finance"
        ],
        "commit_id": [
            null
        ],
        "address": [
            null
        ],
        "chain": "iotaevm",
        "compiler_version": "n/a",
        "audit_date": "2024-07-01",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Issue H-1: Compound v2 Empty Markets Exploit",
            "description": "1. **Description:** This vulnerability allows an attacker to exploit empty markets in a Compound v2-like system by manipulating the exchange rate through a series of flash loan and donation steps.\n2. **Cause:** The root cause is the lack of safeguards when a new market is added before proper collateral factors are set, enabling manipulation of the exchange rate via precise token donations and redemptions.\n3. **Exploitation:** An attacker can take a flash loan, mint cTokens, redeem a minimal amount to retain balance, donate a large amount of tokens to inflate the cash balance, and then borrow assets from other markets at an inflated rate due to the manipulated exchange rate.\n4. **Impact:** The attacker can drain liquidity from other markets, leading to significant loss of funds for the protocol and its users.\n",
            "severity": "High",
            "location": [
                "Comptroller::_supportMarket",
                "Comptroller::_setCollateralFactor",
                "CToken::exchangeRateStoredInternal"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Issue M-1: Malicious Inflation of CToken Exchange Rate via Balance Pollution",
            "description": "1. **Description:** The attacker can manipulate the return value of CToken::exchangeRateStoredInternal() by artificially inflating the contract's cash balance, thereby exaggerating the exchange rate.\n2. **Cause:** The function relies on getCashPrior(), which does not validate or sanitize external token transfers that can pollute the contract balance, especially in CEther and CErc20 implementations.\n3. **Exploitation:** An attacker can transfer tokens directly to the contract before a redemption or minting operation, causing the exchange rate to be miscalculated in their favor, allowing them to gain more tokens than they are entitled to.\n4. **Impact:** This leads to unfair distribution of tokens, potential loss of user funds, and distortion of the protocol's economic model.\n",
            "severity": "Medium",
            "location": [
                "CToken::exchangeRateStoredInternal",
                "CEther::getCashPrior",
                "CErc20::getCashPrior"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Issue M-2: TwapOracle Uses Incorrect SMR_BASE_UNIT on IotaEVM Chain",
            "description": "1. **Description:** The TwapOracle contract uses SMR_BASE_UNIT = 1e6, which is incorrect for the SMR token on IotaEVM, where SMR is a 1e18-decimal token.\n2. **Cause:** The constant SMR_BASE_UNIT is hardcoded to 1e6 instead of 1e18, mismatching the actual token precision of SMR on ShimmerEVM.\n3. **Exploitation:** This misconfiguration causes incorrect price calculations in the oracle, potentially leading to incorrect valuation of assets and incorrect liquidation or borrowing decisions.\n4. **Impact:** Users may face incorrect borrowing power, unfair liquidations, or incorrect reward distributions due to faulty price feeds.\n",
            "severity": "Medium",
            "location": [
                "TwapOracle"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Issue M-3: Staking Deepr Tokens Does Not Retain Governance Votes",
            "description": "1. **Description:** When users stake their Deepr tokens in the RewardPool, their voting power in the Governance protocol is lost because the RewardPool contract does not delegate votes.\n2. **Cause:** The RewardPool contract does not set a delegate for the staked tokens, leaving the delegate mapping empty and thus forfeiting voting rights.\n3. **Exploitation:** While not directly exploitable by an attacker, this design flaw discourages participation in governance and centralizes voting power among unstaked holders.\n4. **Impact:** Reduced decentralization and governance participation, weakening the protocol's governance model.\n",
            "severity": "Medium",
            "location": [
                "RewardPool.sol",
                "Governance/Comp.sol#L267"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Issue M-4: _setLinearRateModelAddress Fails to Distribute Tokens Before Update",
            "description": "1. **Description:** The _setLinearRateModelAddress function in Comptroller does not properly distribute pending COMP tokens before updating the rate model.\n2. **Cause:** The function skips calling refreshCompSpeeds and related index updates before changing the rate model, leading to lost or miscalculated token emissions.\n3. **Exploitation:** An admin could inadvertently or maliciously skip reward distribution by updating the rate model without prior synchronization, harming stakers.\n4. **Impact:** Users may lose out on accrued rewards, leading to economic loss and reduced trust in the protocol.\n",
            "severity": "Medium",
            "location": [
                "Comptroller.sol#L1277-L1299"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "Issue M-5: Team Address Update Fails to Transfer Accrued Tokens to New Address",
            "description": "1. **Description:** When the team address is updated via _setTeamAddress, the accrued tokens associated with the old address are not transferred to the new one.\n2. **Cause:** The function only updates the address mapping but does not migrate or transfer any previously accrued tokens.\n3. **Exploitation:** This could lead to permanent loss of team rewards if not manually corrected, especially in automated systems relying on correct accrual tracking.\n4. **Impact:** Financial loss for the team and potential misalignment of incentives if rewards are not properly accounted for.\n",
            "severity": "Medium",
            "location": [
                "Comptroller::_setTeamAddress"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {},
            "title": "Issue M-6: SMR Price Used Beyond maxStalePeriod",
            "description": "1. **Description:** The SMR price feed can be used beyond its maxStalePeriod due to misconfiguration in the update mechanism.\n2. **Cause:** The tokenConfigs[WSMR].periodSize can be set to zero, disabling regular updates, and the system does not enforce freshness checks beyond the intended stale period.\n3. **Exploitation:** An attacker could manipulate market conditions relying on outdated prices, leading to incorrect valuations.\n4. **Impact:** Risk of incorrect borrowing, liquidation, or pricing decisions based on stale data, potentially leading to financial loss.\n",
            "severity": "Medium",
            "location": [
                "TwapOracle",
                "tokenConfigs[WSMR].periodSize"
            ],
            "files": []
        }
    ]
}