{
    "path": "dataset-curated/reports/TrailofBits/2025-05-fabriclabs-zipperprotocol-securityreview.pdf",
    "project_info": {
        "url": [
            "https://gitlab.com/fabric-dapps/zipper.contracts"
        ],
        "commit_id": [
            "8498a6f38c04bff8a581425f4492f123ec092310"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-21",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Missing recovery mechanism for failed external chain transfers",
            "description": "The protocol lacks a recovery path for withdrawal requests when transfers fail on external chains after entering EXECUTION_PROCESSING status. This creates a potential fund-locking scenario that requires manual intervention.\nThe root cause is the absence of a mechanism to detect failed external chain transfers and transition the request to a failed state with automated refund or retry options. The refundWithdrawRequest function only works for requests rejected during validation, not after execution has started.\nAn attacker or malicious recipient could exploit this by converting an EOA into a contract without a receive function (e.g., via EIP7702) after a withdrawal is approved, causing the transfer to fail and the request to remain stuck in EXECUTION_PROCESSING.\nThe impact is that users' funds become temporarily inaccessible, leading to a degraded user experience and reliance on manual intervention by the team, though not resulting in irreversible loss.\n",
            "severity": "Informational",
            "location": [
                "ZipperEndpoint.sol"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Misleading role name for validator management",
            "description": "The VALIDATOR_ROLE is misleading because it is used by addresses that manage validators (e.g., adding or removing them), not by the validators themselves. This creates confusion about the role's actual purpose and could lead to incorrect assumptions during audits or system maintenance.\nThe cause is poor naming convention, where the role name suggests it is assigned to validators, but in reality, it controls who can modify the validator list via functions like addValidator.\nWhile not directly exploitable, this could lead to operational errors or misconfigurations if administrators misunderstand the role's function, especially in complex permission setups.\nThe impact is undefined behavior due to role confusion, potentially leading to incorrect access control decisions or security reviews based on flawed assumptions about the permission model.\n",
            "severity": "Informational",
            "location": [
                "ZipperEndpoint.sol"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Missing validation for feeTo parameter in setupFee function",
            "description": "The setupFee function in ZipperFactoryFee.sol lacks validation for the feeTo parameter, allowing it to be set to the zero address during initial configuration. This inconsistency is especially concerning because the updateFeeTo function includes this validation, indicating an oversight.\nThe root cause is the absence of a require(feeTo != address(0)) check in setupFee, unlike in updateFeeTo, which has the same safeguard. This creates a security gap during contract initialization.\nAn administrator could accidentally or maliciously set the fee recipient to the zero address during setup, causing all collected fees to be sent to an unrecoverable address.\nThe impact is permanent loss of protocol fees, reducing revenue and potentially affecting the sustainability of the system's operational costs, especially for gas funding on external chains.\n",
            "severity": "Informational",
            "location": [
                "ZipperFactoryFee.sol"
            ],
            "files": []
        }
    ]
}