{
    "path": "dataset-curated/reports/TrailofBits/2025-05-shapenetwork-token-securityreview.pdf",
    "project_info": {
        "url": [
            "https://github.com/shape-network/shape-token"
        ],
        "commit_id": [
            "0fb5da0c3d98fc831487a7ca20a5999f988665e0"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-14",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Fragmented voting power across chains",
            "description": "The governance mechanism of the $SHAPE token only accounts for token balances on the leader chain when calculating voting power, ignoring tokens that have been bridged to follower chains. This design flaw creates a disconnect between the total token supply and governance representation, as tokens on non-leader chains retain financial value but lose voting rights.\n\nThe root cause is the lack of a cross-chain voting power aggregation mechanism. The system assumes that governance participation is centralized on the leader chain, which contradicts the multi-chain nature of the token.\n\nAn attacker could exploit this by monitoring token distribution and initiating a governance proposal when a significant portion of tokens are on follower chains. By controlling a majority of the tokens remaining on the leader chain (which may be a minority of the total supply), the attacker could pass malicious proposals.\n\nThe impact is a potential erosion of democratic governance, enabling governance capture with less than a majority of the total token supply. This undermines trust in the governance system and could lead to decisions that harm token holders on follower chains.\n",
            "severity": "Medium",
            "location": [
                "InteroperableGovernanceToken.sol"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Missing chain ID verification in L2 leader chain to L1 message flow",
            "description": "The _checkOwner function in the ImmutableCrossChainOwnable contract processes L2-to-L1 cross-chain messages without verifying that the current chain ID matches the expected L1 chain ID. While the sender is validated against a trusted messenger address, the function assumes execution is on the L1 chain without explicit verification.\n\nThe root cause is the omission of a chain ID check in the validation logic for cross-chain messages. The implementation trusts that the messenger address behaves correctly but does not ensure the current context is the intended L1 chain.\n\nAn attacker could deploy malicious code at the same address as the L1CrossChainMessengerForLeaderChain on a different L2 chain. By sending a cross-chain message from that chain, the attacker could trick the contract into treating the message as if it originated from the legitimate L2-to-L1 path, potentially bypassing ownership controls.\n\nThe impact is a compromise of the immutable ownership model’s integrity, allowing unauthorized execution of ownership-level functions on the L1 chain. While the difficulty is high, successful exploitation could undermine the cross-chain administrative security model.\n",
            "severity": "Informational",
            "location": [
                "ImmutableCrossChainOwnable.sol::_checkOwner"
            ],
            "files": []
        }
    ]
}