{
    "path": "dataset-curated/reports/TrailofBits/2025-1-everstake-ethereum-staking-protocol-securityreview.pdf",
    "project_info": {
        "url": [
            "https://github.com/everstake/ETH-Staking-B2C-SC"
        ],
        "commit_id": [
            "3a3fee5d8b284dd60cf156264cdfb1182716cfd1"
        ],
        "address": [
            null
        ],
        "chain": "ethereum",
        "compiler_version": "n/a",
        "audit_date": "2024-11-25",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Project uses archived and outdated tools",
            "description": "The project relies on Truffle, a tool that has been archived and is no longer actively maintained. The specific version used (5.7.5) is outdated compared to the latest available version (5.11.5). This introduces risks such as potential flaws in compiled code that may never be patched, incorrect test execution due to bugs in the testing framework, and lack of access to modern development features like test coverage and console logging from contracts. The root cause is the use of deprecated and unmaintained tooling. An attacker could exploit undetected bugs in the outdated toolchain, leading to untested or incorrectly compiled code being deployed. The impact includes potential financial loss due to undetected vulnerabilities in the smart contracts.\n",
            "severity": "Informational",
            "location": [
                "package.json",
                "ETH-Staking-B2C-SC/package-lock.json#L22013-L22026"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Project uses outdated dependencies",
            "description": "The project uses version 4.8.1 of OpenZeppelin Contracts, which is outdated compared to newer available versions (including 4.8.3, 4.9.3, and 5.1.0). These newer versions may include silent bug fixes and security patches. The root cause is failure to keep third-party dependencies up to date. An attacker could exploit known vulnerabilities in the older version of OpenZeppelin Contracts that have since been patched. The impact could be severe, including loss of funds if a vulnerability in the outdated dependency is exploited.\n",
            "severity": "Informational",
            "location": [
                "package-lock.json",
                "ETH-Staking-B2C-SC/package-lock.json#L13618-L13627"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Documentation is out of sync with the code",
            "description": "The project's documentation in the docs directory is outdated and does not reflect the current state of the codebase. For example, the Pool and Accounting contracts have functions that are missing from or incorrectly documented in the markdown files. The root cause is lack of synchronization between code changes and documentation updates. A developer relying on outdated documentation may misunderstand the code and introduce bugs during modifications. The impact includes increased risk of introducing vulnerabilities due to incorrect assumptions about contract behavior.\n",
            "severity": "Informational",
            "location": [
                "docs directory",
                "various source files"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Documentation lacks a glossary",
            "description": "The codebase contains comments that use nonstandard or ambiguous terms (e.g., \"autocompound\", \"pending balance\", \"interchange\") without defining them. The root cause is insufficient documentation clarity, assuming reader familiarity with internal terminology. This can lead to confusion for auditors, developers, or users trying to understand the code. The impact is potential misinterpretation of critical functionality, which could result in incorrect usage or flawed modifications that introduce vulnerabilities.\n",
            "severity": "Informational",
            "location": [
                "Accounting.sol#L272-L273",
                "AutocompoundAccounting.sol#L256-L257",
                "Withdrawer.sol#L78-L79"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Duplicated code",
            "description": "The OwnableWithSuperAdmin.sol and TreasuryBase.sol contracts both contain nearly identical ownership management code, including functions like renounceOwnership, transferOwnership, and acceptOwnership. The root cause is code duplication instead of reuse through inheritance or libraries. This increases the risk that a bug fix in one contract is not applied to the other, leading to inconsistent behavior. The impact is potential security vulnerabilities persisting in one contract while being fixed in another, undermining the integrity of access controls.\n",
            "severity": "Informational",
            "location": [
                "contracts/utils/OwnableWithSuperAdmin.sol",
                "contracts/TreasuryBase.sol"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "Storage variables updated by multiple contracts in the inheritance tree",
            "description": "Storage variables such as PENDING_RESTAKED_VALUE_POSITION, POOL_PENDING_BALANCE_POSITION, and TOTAL_BALANCE_POSITION are modified by both a derived contract (Accounting) and its parent (AutocompoundAccounting). The root cause is poor separation of concerns in the inheritance hierarchy, where storage management responsibilities are not clearly isolated. This creates a risk that one contract overwrites a value set by another, especially if future changes alter execution flow. The impact includes potential state corruption and inconsistent accounting, which could lead to financial discrepancies or loss of funds.\n",
            "severity": "Informational",
            "location": [
                "Accounting.sol#L234",
                "Accounting.sol#L494",
                "Accounting.sol#L177",
                "Accounting.sol#L224",
                "Accounting.sol#L557",
                "Accounting.sol#L238",
                "AutocompoundAccounting.sol#L143",
                "AutocompoundAccounting.sol#L142",
                "AutocompoundAccounting.sol#L258",
                "AutocompoundAccounting.sol#L340",
                "AutocompoundAccounting.sol#L359"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {},
            "title": "_update may fail to update REWARDER_BALANCE_POSITION",
            "description": "The _update function reads REWARDER_BALANCE_POSITION from storage, performs several operations (including a transfer and early returns), and only later writes the updated value back. The root cause is improper ordering of storage updates relative to external calls and control flow exits. If an attacker can re-enter or repeatedly trigger this function before the write occurs, they might exploit the delay to drain funds. Although the audit mentions a potential mitigation via _closedValidatorStop modifying another storage variable, the certainty of this protection is unclear. The impact could be loss of funds from the rewards treasury if the vulnerability is exploitable.\n",
            "severity": "Informational",
            "location": [
                "Accounting.sol#L609-L634",
                "Withdrawer.sol#L92-L106"
            ],
            "files": []
        }
    ]
}