{
    "path": "dataset-curated/reports/Ackee-Blockchain/ackee-blockchain-greenhood-contracts-report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Ackee-Blockchain/audit-greenhood-contracts-272"
        ],
        "commit_id": [
            "b12392f36442ea5e558ef8d671c8380aca9f5e54"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-04",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Missing whenNotPaused Modifiers in Subscription Functions",
            "description": "The GreenhoodMembership contract inherits from OpenZeppelin’s Pausable but fails to apply the whenNotPaused modifier to critical functions subscribe and subscribeWithPermit. This omission renders the emergency pause mechanism ineffective, as these functions remain callable even when the contract is paused. The root cause is the lack of proper access control integration with the inherited pausable functionality. An attacker can exploit this by calling subscription functions during a pause period, bypassing the intended emergency stop. This undermines the protocol's ability to halt operations during security incidents, allowing continued interaction and potential exploitation during vulnerable states.\n",
            "severity": "High",
            "location": [
                "GreenhoodMembership.sol::subscribe",
                "GreenhoodMembership.sol::subscribeWithPermit"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Parameter Front-running Possible Due to Instant Changes of Rates, Fees and Rewards",
            "description": "The protocol allows the owner to instantly change critical parameters such as exchange rates, subscription fees, and reward amounts without timelocks or user-side slippage protection. The root cause is the lack of safeguards against parameter manipulation between transaction submission and execution. An attacker (e.g., a malicious owner) can front-run user transactions by adjusting these parameters—such as increasing the exchange rate or decreasing rewards—immediately before execution. This results in users receiving fewer security tokens than expected, leading to financial loss. The impact is significant for user trust and fairness, especially in a regulated investment environment.\n",
            "severity": "Medium",
            "location": [
                "GreenhoodInvestor.sol::purchaseTokens",
                "GreenhoodInvestor.sol::purchaseTokensWithPermit",
                "GreenhoodMembership.sol::subscribe",
                "GreenhoodMembership.sol::subscribeWithPermit"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Unlimited subscriptionFee",
            "description": "The subscriptionFee parameter in GreenhoodMembership.sol can be set to any value by the owner without an upper limit. The root cause is the absence of a validation mechanism or cap on this critical parameter. An attacker (the owner) could set the fee to an extremely high value, such as a user's entire token balance, especially if the user has approved unlimited token spending. When the user calls the subscribe function, they risk having their entire balance drained. This could lead to significant financial loss for users, particularly in cases of malicious or compromised ownership.\n",
            "severity": "Medium",
            "location": [
                "GreenhoodMembership.sol::setSubscriptionFee"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Missing Zero Address and Zero Amount Validation Checks",
            "description": "Several functions in both GreenhoodInvestor.sol and GreenhoodMembership.sol lack validation for zero addresses and zero amounts. The root cause is insufficient input validation in critical functions such as constructors, setters, and fund withdrawal functions. An attacker could exploit this by passing a zero address to withdrawFunds, causing funds to be sent to the null address and permanently lost. Similarly, setting zero values for parameters like exchangeRate or rewardAmount could disrupt protocol functionality. While the direct financial impact may be limited, it introduces operational risks and potential loss of funds due to accidental or malicious misuse.\n",
            "severity": "Informational",
            "location": [
                "GreenhoodMembership.sol::constructor",
                "GreenhoodMembership.sol::setRewardAmount",
                "GreenhoodMembership.sol::setSubscriptionFee",
                "GreenhoodMembership.sol::withdrawFunds",
                "GreenhoodInvestor.sol::constructor",
                "GreenhoodInvestor.sol::setExchangeRate",
                "GreenhoodInvestor.sol::withdrawFunds"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "One-step ownership transfer",
            "description": "The contracts use OpenZeppelin’s Ownable, which allows a single-step ownership transfer. The root cause is the use of a basic ownership model that does not require confirmation by the new owner. This creates a risk of accidental or irreversible loss of ownership if the new owner address is mistyped or invalid. An attacker could exploit human error by tricking the current owner into transferring ownership to a wrong or malicious address, resulting in permanent loss of control over critical protocol functions. This weakens the access control model and increases operational risk.\n",
            "severity": "Informational",
            "location": [
                "GreenhoodInvestor.sol",
                "GreenhoodMembership.sol"
            ],
            "files": []
        }
    ]
}