{
    "path": "dataset-curated/reports/Zellic/Benqi Oracle - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/clmikestone/Benqi-DualOracle"
        ],
        "commit_id": [
            "78f10c0816a80c6d7cc1d299c31eba3185c04c00"
        ],
        "address": [],
        "chain": "EVM",
        "compiler_version": "n/a",
        "audit_date": "2025-05-08",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Missing staleness check in BenqiDualOracle::getUnderlyingPrice when oracleMode is EDGE_ONLY or CL_ONLY",
            "description": "The BenqiDualOracle contract implements a dual oracle system using Edge as the primary and Chainlink as the backup oracle, with three operational modes: EDGE_ONLY, CL_ONLY, and DUAL. Despite the contract's stated responsibility to perform staleness detection, this check is omitted when the oracleMode is set to either EDGE_ONLY or CL_ONLY. In these modes, the contract directly returns prices from the respective oracle without validating the timestamp, relying solely on non-zero price checks. This omission occurs because the getPriceAndTimestamp function in BenqiPriceOracle retrieves the updatedAt timestamp from Chainlink's latestRoundData but does not compare it against a staleness threshold. The root cause is the absence of a freshness validation step in the control flow for single-oracle modes. An attacker could exploit this by manipulating or freezing the oracle feed (e.g., via a compromised oracle node or network disruption), causing the system to use outdated prices. This could lead to incorrect valuation of collateral and borrow limits in the BENQI protocol, potentially resulting in undercollateralized loans and loss of funds for users and the protocol.\n",
            "severity": "Medium",
            "location": [
                "BenqiDualOracle.sol::getUnderlyingPrice",
                "BenqiPriceOracle.sol::getPriceAndTimestamp"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Feed price validation can be bypassed",
            "description": "The validateFeedPriceDeviation function in the BenqiDualOracle contract is designed to ensure that manually set prices do not deviate significantly (more than 10x or less than 0.1x) from the prices provided by the Edge and Chainlink oracles. However, the validation logic is only executed if the corresponding oracle feed addresses (edgeFeed and chainlinkFeed) are non-zero. If both feeds are set to the zero address, the function performs no checks, allowing a manual price to be set without any validation against oracle data. The root cause is the lack of a requirement that at least one oracle feed must be active before allowing manual price overrides. While the likelihood of both feeds being zero is low, this scenario could occur during configuration errors or in specific deployment contexts (e.g., for stablecoins like BUSD where manual pricing is intended). An attacker with owner privileges could exploit this to set arbitrary prices if both feeds are disabled, potentially leading to incorrect asset valuations, unfair liquidations, or manipulation of lending positions. The impact is considered low because the condition requires both feeds to be unset, which is not the normal operational state, and because owner-controlled functions are typically trusted.\n",
            "severity": "Low",
            "location": [
                "BenqiDualOracle.sol::validateFeedPriceDeviation"
            ],
            "files": []
        }
    ]
}