{
    "path": "dataset-curated/reports/Zellic/Berachain Airdrop - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/CliqueOfficial/bera-contracts"
        ],
        "commit_id": [
            "4ee236909df1fa7dfda25986d17750159dfded01"
        ],
        "address": [],
        "chain": "evm/berachain",
        "compiler_version": "n/a",
        "audit_date": "2024-12-16",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Missing validation check on ERC-20 transfer",
            "description": "The Transferable contract handles both native and ERC-20 token transfers using a common interface. When transferring ERC-20 tokens, it directly calls the transfer function without checking the return value. This is a known issue in older ERC-20 implementations that do not consistently return boolean values, which can lead to silent failures.\nThe root cause is the lack of proper validation of the ERC-20 transfer return value, combined with the use of low-level calls without success checks. An attacker or malfunctioning token contract could return false or revert inconsistently, leading to incorrect state updates.\nAn attacker could exploit this by interacting with tokens that do not properly return true on success, or by using tokens that revert under certain conditions (e.g., blacklisted addresses), causing transfers to fail silently.\nThe impact includes loss of funds during airdrop claims, stream creation, or reward claiming, where the system marks the action as completed even though the actual token transfer failed.\n",
            "severity": "Medium",
            "location": [
                "Transferable::transfer"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Lack of comprehensive test suite",
            "description": "The project lacks a comprehensive test suite across all scoped contracts, with only minimal testing present for the StreamingNFTPool contract. The existing tests do not cover complex scenarios such as batch operations with multiple tokens or edge cases like failed transfers.\nThe root cause is insufficient test coverage and absence of negative testing (e.g., testing reverts in all logical branches), which is critical for ensuring contract reliability and security.\nThis deficiency increases the risk that untested code paths contain bugs or vulnerabilities that could be exploited in production, especially under unexpected conditions.\nThe impact is an increased likelihood of undiscovered bugs, reduced code maturity, and lower confidence in the system's correctness and security, potentially leading to financial loss or system failure.\n",
            "severity": "Medium",
            "location": [
                "ClaimBatchProcessor",
                "Distributor1",
                "StreamingNFT",
                "Transferable",
                "WrappedNFT"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Centralization risk",
            "description": "The Distributor1 and StreamingNFT contracts grant excessive privileges to a single owner address. In Distributor1, the owner can change the claimRoot, invalidating existing airdrop proofs, and can withdraw all funds. In StreamingNFT, the owner can arbitrarily change fees and withdraw all funds.\nThe root cause is the design decision to centralize critical functions (e.g., fund withdrawal, fee setting, root updates) under a single privileged account without safeguards like multi-signature or timelocks.\nA malicious actor who gains access to the owner's private key could withdraw all funds or disrupt the system by changing critical parameters.\nThe impact is a high-severity centralization risk, where users are exposed to potential theft or manipulation by a single entity, undermining trust in the protocol's decentralization and security.\n",
            "severity": "Critical",
            "location": [
                "Distributor1::setClaimRoot",
                "Distributor1::withdraw",
                "StreamingNFT::setFee",
                "StreamingNFT::withdraw"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Fee transfers occur without owner consent and can be front-run",
            "description": "The createStream and createBatchStream functions in StreamingNFT transfer a fee to the caller when creating a stream on behalf of an NFT owner. This allows any user to claim the fee by calling the function before the actual owner does, reducing the owner's allocation without consent.\nThe root cause is the lack of a permissioning mechanism or time window that reserves the right to initiate stream creation for the NFT owner during an initial period.\nAn attacker can monitor the mempool and front-run legitimate transactions by submitting a higher gas bid, capturing the fee. This is a form of MEV (Miner Extractable Value) exploitation.\nThe impact includes reduced user allocation without consent and potential loss of fees to MEV bots, degrading user experience and fairness in the system.\n",
            "severity": "Low",
            "location": [
                "StreamingNFT::createStream",
                "StreamingNFT::createBatchStream"
            ],
            "files": []
        }
    ]
}