{
    "path": "dataset-curated/reports/BlockSec/blocksec_upheaval_v1.0-signed.pdf",
    "project_info": {
        "url": [
            "https://github.com/Upheaval/Upheaval-Contracts"
        ],
        "commit_id": [
            "Version 1"
        ],
        "address": [
            "0xC8352A2EbA29F4d9BD4221c07D3461BaCc779088",
            "0xf49A33dF1Bb5DA03B85396a768666523c1b7Eb9e",
            "0x2566163ea012C9E67c1C7080e0a073f20B548030",
            "0xDcF0ba9A0AE5B7574849152546f961f5ef0EEeD6"
        ],
        "chain": "hyperevm",
        "compiler_version": "n/a",
        "audit_date": "2025-09-17",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Missing Non-Zero Address and Duplicate Checks",
            "description": "The contracts UpheavalV3Factory and NonfungiblePositionManager lack proper input validation for critical address parameters. Specifically, the constructor of UpheavalV3Factory does not validate that the _poolDeployer address is non-zero, and the setOwner function does not check that the new _owner is a non-zero address or different from the current owner. Similarly, the constructor of NonfungiblePositionManager fails to validate that _deployer, _factory, _WETH9, and _tokenDescriptor_ are non-zero addresses. This omission stems from incomplete input validation during initialization and ownership changes. An attacker could exploit this by setting critical addresses to zero, potentially rendering the contract inoperable or redirecting funds. The impact includes loss of functionality, potential fund lockup, and reduced trust in the protocol due to preventable bugs.\n",
            "severity": null,
            "location": [
                "UpheavalV3Factory.sol::constructor#36-38",
                "UpheavalV3Factory.sol::setOwner#83-85",
                "NonfungiblePositionManager.sol::constructor#71-78"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Outdated or Incorrect Project Dependencies",
            "description": "The NonfungiblePositionManager contract imports and references PancakeSwap-specific dependencies and identifiers, such as '@pancakeswap/v3-core', 'Pancake V3 Positions NFT-V1', and 'PCS-V3-POS'. Since Upheaval is a fork, retaining these references may lead to confusion, incorrect assumptions about functionality, or integration issues with tooling and frontends. The root cause is the failure to rebrand and decouple from the original PancakeSwap codebase during forking. While not directly exploitable for financial gain, an attacker could leverage the misleading naming to conduct phishing attacks or trick integrators into assuming compatibility that does not exist. The impact includes reputational damage, integration errors, and potential user deception.\n",
            "severity": null,
            "location": [
                "NonfungiblePositionManager.sol::constructor#71-78",
                "NonfungiblePositionManager.sol#import#5-7"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Potential Centralization Risks",
            "description": "The UpheavalV3Factory contract grants privileged roles, such as the owner, the ability to perform sensitive operations. The document notes that if the private key of such an account is compromised or lost, it could pose a significant risk to the protocol. This stems from a reliance on centralized control for critical functions, which contradicts the principles of decentralization. An attacker who gains access to the owner's private key could potentially alter critical parameters, drain funds, or disable functionality. The impact includes full protocol compromise, loss of user funds, and erosion of trust, especially if the owner role lacks a timelock or multi-signature safeguard.\n",
            "severity": null,
            "location": [
                "UpheavalV3Factory.sol"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Token Integration Issues",
            "description": "The protocol does not fully support certain token types, such as fee-on-transfer, rebasing, and reflection tokens. These tokens modify the standard ERC-20 behavior by automatically charging fees or adjusting balances, which can break assumptions made by the DEX logic, especially in liquidity calculations and swaps. The root cause is the lack of handling for non-standard token behaviors in the core contracts. An attacker could exploit this by creating a pool with a malicious or incompatible token, leading to incorrect pricing, loss of liquidity, or DoS for users interacting with that pool. The impact includes financial losses for liquidity providers and users, as well as degraded protocol reliability.\n",
            "severity": null,
            "location": [
                "UpheavalV3PoolDeployer.sol",
                "UpheavalV3Factory.sol"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Hardcoded Values and Deployment Chain Risks",
            "description": "The project uses hardcoded values in contracts such as SwapRouter, which may not be valid across different deployment environments or chains. If these values are incorrect or not updated for the target chain (HyperEVM), it could lead to failed transactions or incorrect behavior. The root cause is the use of static, unverified constants instead of configurable or chain-agnostic parameters. An attacker could exploit this by frontrunning or manipulating transactions in scenarios where hardcoded values lead to miscalculations. The impact includes failed swaps, loss of user funds, and operational failures, especially if contracts are accidentally deployed on an incorrect chain or with outdated parameters.\n",
            "severity": null,
            "location": [
                "SwapRouter.sol"
            ],
            "files": []
        }
    ]
}