{
    "path": "dataset-curated/reports/BlockSec/blocksec_CoboTokenization_v1.0-signed.pdf",
    "project_info": {
        "url": [],
        "commit_id": [],
        "address": [],
        "chain": null,
        "compiler_version": "n/a",
        "audit_date": "2025-08-01",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Potential front-run attack in the function deployAndInit()",
            "description": "The function deployAndInit() in ProxyFactory.sol uses deployCreate3 to deploy a CoboERC20Proxy contract, where the deployed address is determined by msg.sender (the ProxyFactory contract) and a user-provided salt. Because the address derivation is predictable, an attacker can observe a victim's pending deployAndInit() transaction and submit their own identical transaction with the same salt, front-running the victim. Since the ProxyFactory is the msg.sender in both cases, the resulting proxy address will be identical, allowing the attacker to hijack the deployment by setting critical parameters such as admin and manager roles to their own addresses before the victim’s transaction executes.\n\nThe root cause is the combination of predictable address generation via create3 and the lack of access control or commitment mechanism to ensure only the intended caller can initialize the proxy with specific parameters. Furthermore, the function allows arbitrary callers to specify role addresses (admins, managers, etc.) without validation, increasing the risk of unauthorized privilege assignment.\n\nAn attacker could exploit this by monitoring the mempool for deployAndInit() calls, then racing to deploy the same salted contract with malicious parameters. This race can be won through higher gas fees or other transaction manipulation techniques.\n\nThe impact includes the potential for unauthorized deployment of token proxies with attacker-controlled roles, leading to loss of control over the token contract, unauthorized minting or burning, and potential financial loss for users relying on the expected role configuration.\n",
            "severity": "Medium",
            "location": [
                "ProxyFactory.sol::deployAndInit"
            ],
            "files": []
        }
    ]
}