{
    "path": "dataset-curated/reports/BlockSec/blocksec_rhea_token_v1.0-signed.pdf",
    "project_info": {
        "url": [
            "https://github.com/ref-finance/rhea-token",
            "https://github.com/ref-finance/xrhea-token",
            "https://github.com/ref-finance/orhea-token",
            "https://github.com/ref-finance/orhea-vault"
        ],
        "commit_id": [
            "ad90818d7a34f7d5b50442a9ac0f9d2a865513d8",
            "2ac8cbf7b05fd6d638955bf449b20b5dcd20c298",
            "804c3b37cf36c6994e42271c49e6a277016afd6a",
            "570618f91a27cd291f1dd6336ea9ac1c3a79131c"
        ],
        "address": null,
        "chain": "near",
        "compiler_version": "n/a",
        "audit_date": "2025-04-21",
        "project_path": {
            "rhea-token": "dataset-curated/contracts/blocksec_rhea_token_v1.0-signed.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1173"
                ]
            },
            "title": "Lack of metadata validation in function update_metadata()",
            "description": "The vulnerability exists in both the rhea-token and orhea-token contracts, where the update_metadata() function allows the contract owner to modify token metadata after deployment without validating it against the NEP-141 standard. While the new() function properly calls metadata.assert_valid() to ensure compliance, this validation is missing in update_metadata(). The root cause is the omission of the assert_valid() check during metadata updates. An attacker with ownership privileges could set invalid or non-compliant metadata (e.g., incorrect decimals or symbol), which could confuse wallets, exchanges, or other integrations expecting standard-compliant tokens. This could lead to incorrect token display, failed transactions, or misinterpretation of token value, though the core functionality remains intact. The impact is limited to interoperability and user experience rather than fund loss.\n",
            "severity": "Low",
            "location": [
                "rhea/src/lib.rs::update_metadata#84-93",
                "orhea/src/lib.rs::update_metadata#84-93"
            ],
            "files": [
                "ad90818d7a34f7d5b50442a9ac0f9d2a865513d8/rhea-token/contracts/rhea/src/lib.rs"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Manipulable share price via account unregistration",
            "description": "The xRHEA token contract allows users to forcibly unregister their accounts via storage_unregister(), which burns their xRHEA balance and reduces the total supply. Since the share price is calculated as total staked RHEA divided by total xRHEA supply, this artificial reduction in supply causes a spike in the share price. The root cause is the direct burning of shares without adjusting the underlying asset pool or accounting for price impact. A malicious user could exploit this by staking, allowing rewards to accumulate, then forcibly unregistering to burn their shares and inflate the price. This manipulation could affect external systems (e.g., oracles, lending platforms) that rely on xRHEA's price for valuation, potentially enabling price-based attacks. The impact is low as it does not directly result in fund loss from the contract but may distort economic incentives.\n",
            "severity": "Low",
            "location": [
                "xrhea/src/api/storage.rs::storage_unregister#36-49"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Unfair advantage for the first staker",
            "description": "In the xrhea-token contract, rewards can be distributed before any user has staked, increasing the locked_token_amount without issuing corresponding xRHEA shares. The distribute_reward() function updates the underlying asset pool even when the total supply of xRHEA is zero. The root cause is the lack of a check to ensure that shares exist before adding rewards. As a result, the first staker receives xRHEA tokens at a 1:1 ratio with their stake but inherits all previously accumulated rewards. They can immediately unstake to capture these rewards, gaining a disproportionate return. This creates an unfair economic advantage for the first staker, undermining fairness and potentially discouraging later participation. The impact is low as it does not break the system but introduces inequity in reward distribution.\n",
            "severity": "Low",
            "location": [
                "xrhea/src/xrhea.rs::distribute_reward#78-87"
            ],
            "files": []
        }
    ]
}