{
    "path": "dataset-curated/reports/BlockSec/blocksec_radiant_glp_v1.0-signed.pdf",
    "project_info": {
        "url": [
            "https://github.com/radiant-capital/glp-main"
        ],
        "commit_id": [
            "addfbad2b8f00f4dd8efe2e0152a6341259b2866"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-15",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Potential sandwich attacks to the function burnDaoShares()",
            "description": "The function burnDaoShares() in the GLPVault contract allows the owner to burn shares from the DAO_TREASURY, reducing the total supply of shares without affecting the total assets. This causes a sudden increase in the share price, as the same asset pool is now divided among fewer shares. The root cause is the lack of mitigation for price manipulation during share burning. An attacker can exploit this by executing a sandwich attack—front-running the burn transaction to buy shares cheaply and back-running it to sell at a higher price after the burn. This leads to unfair profit at the expense of other users, undermining economic fairness and potentially draining value from honest participants.\n",
            "severity": "Medium",
            "location": [
                "GLPVault.sol::burnDaoShares#167-172"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Potential DoS via donating to the GUARDIAN_MULTISIG",
            "description": "The functions addBasketToken() and removeBasketToken() in GLPStrategy revert if the GUARDIAN_MULTISIG holds a balance of the token being added or removed. The root cause is the presence of a balance check that does not distinguish between legitimate holdings and malicious donations. An attacker can exploit this by sending a minimal amount of any token to the GUARDIAN_MULTISIG address, thereby permanently blocking the owner from adding or removing that token from the basket. This results in a denial-of-service condition where critical protocol operations are halted, reducing the system's flexibility and responsiveness to market changes.\n",
            "severity": "Low",
            "location": [
                "GLPStrategy.sol::addBasketToken#70-87",
                "GLPStrategy.sol::removeBasketToken"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Incorrect asset comparison in the function setStrategy()",
            "description": "The function setStrategy() compares the new strategy’s total assets against the vault’s total assets, which already includes the old strategy’s assets. The root cause is flawed logic in asset comparison during strategy switching. This can lead to transaction failures or create arbitrage opportunities when the vault holds a non-zero balance. An attacker could exploit timing differences around strategy updates to manipulate asset valuations, deposit or withdraw at incorrect rates, and profit from mispricing. The impact includes potential loss of funds for the vault and unfair gains for malicious actors during strategy transitions.\n",
            "severity": "Low",
            "location": [
                "GLPVault.sol::totalAssets#113-115",
                "GLPVault.sol::setStrategy"
            ],
            "files": []
        }
    ]
}