{
    "path": "dataset-curated/reports/Zenith/Breath of Estova - Zenith Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Breath-Of-Estova/FundTransferContract.git"
        ],
        "commit_id": [
            "0ee29f172f5b86d9f34fd2159cbac29d8330fe4b"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-12-30",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Forced native transfers are not forwarded",
            "description": "The FundTransferVault contract forwards received funds only through its deposit() or receive() functions. However, native Ether can be forcibly sent to the contract via the selfdestruct() mechanism from another contract, which does not trigger any code execution in the recipient. As a result, such forced Ether transfers will remain trapped in the contract's balance and will not be forwarded to the designated admin address. \nThe root cause is the absence of a mechanism to detect or react to forced Ether deposits that bypass the contract’s logic. \nAn attacker or third party could potentially send Ether via selfdestruct, breaking the expected invariant that the vault should not hold funds. \nWhile the impact is limited since funds are not lost but merely stuck, this could lead to confusion in accounting, monitoring, and operational assumptions about the contract's state.\n",
            "severity": "Informational",
            "location": [
                "FundTransferVault.sol"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Inconsistent handling of 0-value transfers",
            "description": "The deposit() function reverts when msg.value is zero, enforcing a requirement for a positive value transfer. In contrast, the receive() function allows zero-value Ether transfers to proceed, triggering the forwarding logic even when no Ether is sent. \nThis inconsistency arises from differing validation logic between the two entry points. \nA user or contract could exploit this by sending a zero-value transaction directly (e.g., via call or transfer), which would trigger the forwarding mechanism without depositing any funds. \nWhile this does not lead to loss of funds, it introduces unpredictable behavior and could interfere with systems relying on consistent transaction semantics, leading to potential confusion or integration issues.\n",
            "severity": "Informational",
            "location": [
                "FundTransferVault.sol::deposit",
                "FundTransferVault.sol::receive"
            ],
            "files": []
        }
    ]
}