{
    "path": "dataset-curated/reports/Cantina/cantina_puffer_april2025.pdf",
    "project_info": {
        "url": null,
        "commit_id": null,
        "address": [],
        "chain": null,
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Incorrect fee calculation in maxWithdraw function",
            "description": "1. **Description:** The maxWithdraw() function in PufferVaultV5.sol incorrectly applies exit fees to the vault's available liquidity by subtracting the fee from the total vault liquidity, thereby reducing the maximum withdrawable amount for users.\n2. **Cause:** The vulnerability arises because the function uses `_feeOnRaw(vaultLiquidity, getExitFeeBasisPoints())` to reduce the total vault liquidity, which artificially constrains the maximum assets a user can withdraw.\n3. **Exploitation:** An attacker or regular user could observe discrepancies between maxWithdraw and maxRedeem, leading to suboptimal withdrawal behavior. While not directly exploitable for theft, it misrepresents available liquidity.\n4. **Impact:** Users may be unable to withdraw the full amount of assets they expect, reducing usability and potentially causing confusion or loss of trust. The issue creates inconsistency between withdrawal methods (e.g., maxRedeem allows full access).\n",
            "severity": "Low",
            "location": [
                "PufferVaultV5.sol#L461"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "PufferModuleManager#customExternalCall does not check if calldata is validated in avsRegistryCoordinator",
            "description": "1. **Description:** The customExternalCall function in PufferModuleManager.sol does not perform the same calldata validation as RestakingOperatorController.sol, allowing execution of external calls that would otherwise be restricted.\n2. **Cause:** While RestakingOperatorController validates custom call data via checkCustomCallData, PufferModuleManager lacks this check, creating an inconsistent security posture for external call execution.\n3. **Exploitation:** A privileged caller (e.g., multisig) could use PufferModuleManager#customExternalCall to execute arbitrary or disallowed calldata targets that are blocked in avsRegistryCoordinator, potentially bypassing intended restrictions.\n4. **Impact:** Although access is limited to the multisig, this weakens the overall security model by creating a privileged bypass vector. It increases risk surface if multisig keys are compromised or misused.\n",
            "severity": "Informational",
            "location": [
                "PufferModuleManager.sol#L268-L277"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Incorrect function signature in CUSTOM_CALL_SELECTOR comment",
            "description": "1. **Description:** The comment for the CUSTOM_CALL_SELECTOR constant in RestakingOperatorController.sol incorrectly documents the function signature associated with the selector value 0x58fa420c.\n2. **Cause:** The comment does not reflect the actual function signature derived from the keccak256 hash of \"customCalldataCall(address,bytes)\", leading to inaccurate documentation.\n3. **Exploitation:** This cannot be exploited maliciously but may mislead developers or auditors reviewing the code, potentially causing integration errors or confusion during maintenance.\n4. **Impact:** Reduced code clarity and maintainability. Incorrect comments can lead to misunderstandings about expected behavior, especially for external contributors or future audits.\n",
            "severity": "Informational",
            "location": [
                "RestakingOperatorController.sol#L20"
            ],
            "files": []
        }
    ]
}