{
    "path": "dataset-curated/reports/Zellic/Carina Smart Contracts - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/carina-finance/carina-sc"
        ],
        "commit_id": [
            "6ff2ad112b6b62acb054411b8181d9414970b08b"
        ],
        "address": [],
        "chain": "EVM",
        "compiler_version": "n/a",
        "audit_date": "2025-10-17",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Withdrawal-fee griefing",
            "description": "1. **Description:** The NativeTokenFlow contract allows any user to call wrapAllNativeToken(), which wraps the entire native token balance of the contract. Additionally, during mass order cancellations via cancelOrdersIgnoreInvalidCancellation(Orders[]), the caller pays gas for each withdrawal refund. This design enables a minor griefing vector where a user can repeatedly wrap native tokens at low cost, thereby increasing the gas cost for others performing mass cancellations.\n\n2. **Cause:** The vulnerability stems from the permissionless nature of the wrapAllNativeToken() function, which allows any user to trigger a state change that increases the contract's wrapped token balance. Since each refund during cancellation unwraps tokens, more wrapped tokens lead to higher gas costs during mass cancellations.\n\n3. **Exploitation:** A malicious actor could exploit this by creating many small orders, calling wrapAllNativeToken() to increase the wrapped balance, and then refunding their own orders. This would force other users attempting mass cancellations to pay disproportionately high gas fees, potentially causing transactions to fail due to gas limits.\n\n4. **Impact:** The primary impact is increased gas costs for users canceling multiple orders, which could lead to transaction failures for large cancellations. If a fee-charging ERC-20 token were used for wrapping in the future, the impact could escalate significantly, enabling financial loss through fee draining.\n",
            "severity": "Informational",
            "location": [
                "NativeTokenFlow.sol::wrapAllNativeToken",
                "NativeTokenFlow.sol::cancelOrdersIgnoreInvalidCancellation#"
            ],
            "files": []
        }
    ]
}