{
    "path": "dataset-curated/reports/ChainSecurity/ChainSecurity_YieldBasis_YieldBasisCore_Audit.pdf",
    "project_info": {
        "url": [
            "https://github.com/yield-basis/yb-core"
        ],
        "commit_id": [
            "de498361f7971b8b01c432093e4ba36c21a4b37d"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-30",
        "project_path": {
            "yb-core": "dataset-curated/contracts/ChainSecurity_YieldBasis_YieldBasisCore_Audit.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ]
            },
            "title": "Staker Balance Not Updated",
            "description": "This vulnerability involves a correctness issue where the staker contract's balance is not updated in the emergency_withdraw() function, despite other state changes occurring. The root cause is the omission of a call to _calculate_values(), which is responsible for updating the staker balance and total supply. An attacker could potentially exploit this by triggering emergency withdrawals in a way that manipulates accounting, although the direct financial impact is limited due to the emergency context. The impact is primarily on the accuracy of internal accounting and could lead to incorrect distribution of value among staked and unstaked tokens.\n",
            "severity": "Medium",
            "location": [
                "LT.sol::emergency_withdraw#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Asset Token Reentrancy",
            "description": "This is a reentrancy vulnerability in the LT.emergency_withdraw() function where the ASSET_TOKEN.transfer() call is made before the contract state is updated (i.e., before burning user shares and updating liquidity). The cause is a violation of the Checks-Effects-Interactions pattern. If the asset token implements transfer hooks (e.g., ERC-777), an attacker could reenter the contract and manipulate state during the transfer, potentially leading to double-withdrawal or draining of contract funds. The impact includes loss of assets from the contract due to repeated withdrawals during reentrant calls.\n",
            "severity": "Low",
            "location": [
                "LT.sol::emergency_withdraw#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "First Deposit Can Be Less Than MIN_SHARE_REMAINDER",
            "description": "This design flaw allows users to make extremely small initial deposits (e.g., 1 wei) that bypass the MIN_SHARE_REMAINDER restriction enforced during withdrawals. The cause is the absence of a minimum deposit check in the deposit() function. An attacker could exploit this by making tiny deposits that create edge cases in value accounting, especially when combined with price drops, leading to rounding errors and incorrect admin fee calculations. The impact includes potential manipulation of pool valuation and disruption of normal fee distribution logic.\n",
            "severity": "Low",
            "location": [
                "LT.sol::deposit#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Staker Should Not Be Fee_Receiver",
            "description": "This is a design issue where the staker contract could be set as the fee_receiver, leading to incorrect balance updates during admin fee withdrawals. The cause is that withdraw_admin_fees() updates the staker balance only after minting new tokens, which results in an incorrect balance being recorded. If a malicious or misconfigured staker contract is set as fee_receiver, it could lead to accounting discrepancies. The impact is incorrect token balances and potential loss of funds for the staker or admin due to miscalculations.\n",
            "severity": "Low",
            "location": [
                "LT.sol::withdraw_admin_fees#(line not specified)",
                "LT.sol::set_staker#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-439"
                ]
            },
            "title": "Twocrypto Pool Changes",
            "description": "This correctness issue arises from incompatibility with the latest version of the Twocrypto pool, which removed the donate() function and changed the interface (e.g., calc_remove_liquidity() not exposed). The cause is the reliance on outdated pool functions that no longer exist. This could prevent the system from interacting correctly with the underlying pool, leading to failed transactions. The impact is functional disruption of deposit and withdrawal mechanisms, potentially locking user funds if not corrected.\n",
            "severity": "Low",
            "location": [
                "LT.sol#(general interface compatibility)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "AMM.fee Is Not Validated During Deployment",
            "description": "This is a correctness vulnerability where the AMM contract's fee is not validated during initialization in Factory.add_market(), even though set_fee() has a MAX_FEE check. The cause is missing input validation at deployment time. An attacker with deployment privileges could set a fee greater than 100%, breaking the exchange logic and making swaps fail. The impact is denial of service for AMM functionality, rendering the market unusable.\n",
            "severity": "Low",
            "location": [
                "AMM.vy::__init__#(line not specified)",
                "Factory.vy::add_market#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/AMM.vy",
                "yb-core/contracts/Factory.vy"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-684"
                ],
                "3": [
                    "CWE-440"
                ]
            },
            "title": "LT.preview_deposit() Diverges From deposit()",
            "description": "This design issue causes preview_deposit() to diverge from the actual deposit() behavior by skipping max_debt checks and handling edge cases differently (e.g., when supply != 0 but liquidity.total == 0). The cause is inconsistent logic between preview and execution functions. Users could be misled by inaccurate previews, leading to failed transactions or unexpected outcomes. The impact is poor user experience and potential front-end errors or failed transactions due to unanticipated reverts.\n",
            "severity": "Low",
            "location": [
                "LT.sol::preview_deposit#(line not specified)",
                "AMM.sol::_deposit#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-369"
                ]
            },
            "title": "LT.pricePerShare() Reverts on an Empty Pool",
            "description": "This design flaw causes pricePerShare() to revert due to division by zero when the pool is empty. The cause is lack of a special case for zero supply. This breaks UI integrations and external systems that expect a price (e.g., 1 for initial deposit). The impact is disruption of front-end applications and potential misreporting of token value, affecting user trust and integration reliability.\n",
            "severity": "Low",
            "location": [
                "LT.sol::pricePerShare#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "LT.set_admin() Does Not Check ABI of a Contract",
            "description": "This design issue allows setting an admin contract that does not implement required methods (min_admin_fee, admin, emergency_admin, fee_receiver), potentially bricking the LT contract. The cause is missing ABI checks in set_admin(). If a non-compliant contract is set as admin, critical functions may fail when called. The impact is permanent loss of admin functionality, including fee withdrawals and emergency operations.\n",
            "severity": "Low",
            "location": [
                "LT.sol::set_admin#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "LT Negative Admin Fees Can Be Erased",
            "description": "This design flaw allows users to erase negative admin fees by depositing and withdrawing in a loop. The cause is improper handling of negative admin fees during share adjustments. When the pool is in loss, admin fees are negative, and withdrawals reduce this negative value, effectively forgiving the debt. The impact is unfair reduction of admin liabilities at the expense of other users, distorting the intended fee recovery mechanism.\n",
            "severity": "Low",
            "location": [
                "LT.sol::withdraw#(line not specified)",
                "LT.sol::deposit#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "VirtualPool Problems",
            "description": "This design issue includes multiple problems in VirtualPool: (1) onFlashLoan() does not validate msg.sender, allowing direct calls; (2) excessive array allocation in exchange(); (3) ignoring the fee parameter in onFlashLoan(), assuming zero fees. The causes are poor input validation, inefficient memory usage, and inflexible design. An attacker could bypass flash loan logic, increase gas costs, or prevent use of fee-charging flash loans. The impact includes potential misuse of flash loan functionality and lack of compatibility with non-zero fee models.\n",
            "severity": "Low",
            "location": [
                "VirtualPool.sol::onFlashLoan#(line not specified)",
                "VirtualPool.sol::exchange#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/VirtualPool.vy"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ],
                "3": [
                    "CWE-252"
                ]
            },
            "title": "Factory Stablecoin Assumptions",
            "description": "This informational finding highlights that Factory does not assert the success of STABLECOIN.transfer() or transferFrom() calls, nor does it use default_return_value=True. The cause is insufficient error handling for ERC20 operations. If a transfer fails silently (e.g., due to blacklisted address), it could lead to incorrect state updates. The impact is potential loss of funds or incorrect allocation tracking, though mitigated by later fixes.\n",
            "severity": "Informational",
            "location": [
                "Factory.vy#(all STABLECOIN calls)"
            ],
            "files": [
                "yb-core/contracts/Factory.vy"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "Full Staked Supply Prevents Recovery",
            "description": "This informational issue occurs when all LT tokens are staked, preventing recovery from losses because admin fees (100%) consume all gains before staked tokens can recover to ideal_staked. The cause is the fee distribution logic that prioritizes admin fees over loss recovery. The impact is prolonged inability for staked tokens to recover value, discouraging staking during recovery periods. This was addressed by changing the specification to suspend admin fees during loss recovery.\n",
            "severity": "Informational",
            "location": [
                "LT.sol#(admin fee logic during loss recovery)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Gas Optimizations",
            "description": "This informational finding lists several gas inefficiencies: (1) check_nonreentrant() could be @view; (2) redundant storage reads in exchange(); (3) unused value_before in _deposit(); (4) redundant max(lv.admin, 0) computations; (5) unnecessary liquidity.total updates. The causes are suboptimal code patterns. The impact is higher transaction costs, which affects user experience and economic viability, especially under high network congestion.\n",
            "severity": "Informational",
            "location": [
                "AMM.vy::check_nonreentrant#(line not specified)",
                "AMM.vy::exchange#300,312",
                "AMM.vy::_deposit#(value_before)",
                "LT.vy::preview_emergency_withdraw#(line not specified)",
                "LT.vy::emergency_withdraw#(line not specified)",
                "LT.vy::withdraw#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/AMM.vy"
            ]
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Misleading Function Name",
            "description": "The AMM.admin_fees() function is misleadingly named because it returns accumulated interest donated to the cryptopool, not fees going to the admin. The cause is poor naming that conflates two different fee concepts. This can confuse developers and auditors, leading to incorrect assumptions about fund flows. The impact is potential misinterpretation of financial flows and incorrect integration logic in external systems.\n",
            "severity": "Informational",
            "location": [
                "AMM.vy::admin_fees#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/AMM.vy"
            ]
        },
        {
            "id": 15,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ]
            },
            "title": "Missing Event on Staker Balance Update",
            "description": "This informational issue arises because staker balance updates during deposit or staking do not emit Transfer, Mint, or Burn events. The cause is incomplete event emission. This makes it impossible to track staker balance changes off-chain using events alone. The impact is degraded observability and difficulty for indexers and front-ends to accurately reflect staker holdings.\n",
            "severity": "Informational",
            "location": [
                "LT.sol#(balance update in _calculate_values)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 16,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-1265"
                ]
            },
            "title": "Missing Nonreentrant",
            "description": "The preview_emergency_withdraw() function lacks a nonreentrant modifier, allowing reentrancy. The cause is inconsistent security pattern application. Although it's a view function and only allows read-only reentrancy, it deviates from the project's general security posture. The impact is low, as no state changes occur, but it represents a deviation from best practices.\n",
            "severity": "Informational",
            "location": [
                "LT.sol::preview_emergency_withdraw#(line not specified)"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 17,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "AMM.get_x0() Comment Inaccuracy",
            "description": "The comment for get_x0() incorrectly states safe debt limits as 0 <= debt <= 9/16 coll_value, while the actual values are coll_value / 16 and 8.5 * coll_value / 16 for leverage 2. The cause is outdated or incorrect documentation. This can mislead developers and auditors about the actual safety margins. The impact is potential misunderstanding of risk parameters and incorrect assumptions during code review or integration.\n",
            "severity": "Informational",
            "location": [
                "AMM.vy::get_x0#(comment)"
            ],
            "files": [
                "yb-core/contracts/AMM.vy"
            ]
        },
        {
            "id": 18,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "v_loss Precision Can Be Improved",
            "description": "The `v_loss` variable in `LT._calculate_values()` is computed with 1e18 precision, while later used in a 1e36 context (`dv_use_36`). This results in reduced precision due to truncation during division. The cause is the computation uses lower precision (1e18) than required for subsequent high-precision calculations (1e36), leading to potential loss of accuracy. An attacker could potentially exploit the reduced precision in edge cases involving small value changes, amplifying rounding errors in critical calculations. While not directly leading to fund loss, this imprecision may affect the correctness of financial calculations over time, especially in scenarios involving small or incremental changes.\n",
            "severity": "Informational",
            "location": [
                "LT._calculate_values#"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 19,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-1265"
                ]
            },
            "title": "Read-only Reentrancy on Token Transfer",
            "description": "During the `add_liquidity` flow in `Twocrypto`, if token 1 is an ERC777 token, a reentrancy-like condition can occur during `_transfer_in()`, allowing external calls before state finalization. The cause is the lack of reentrancy guards and premature state updates enable external contract callbacks (e.g., via ERC777 hooks) to read inconsistent or invalid state, such as incorrect `CRYPTOPOOL.balances(0) / CRYPTOPOOL.totalSupply()` ratios. An attacker could craft a malicious ERC777 token that triggers a call to `LT.preview_emergency_withdraw()` during the transfer, reading an incorrect state and potentially manipulating downstream logic. This could lead to incorrect calculations in view functions or, in combination with other integrations, more severe state inconsistencies. However, since it's read-only, direct fund theft is unlikely.\n",
            "severity": "Informational",
            "location": [
                "Twocrypto.add_liquidity",
                "LT.preview_emergency_withdraw"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 20,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ]
            },
            "title": "Stray Tokens Can Get Stuck in Contracts",
            "description": "System contracts like AMM do not have mechanisms to recover tokens that are sent directly to them, leading to potential loss of stranded funds. The cause is the contract tracks balances internally (e.g., `self.collateral_amount`) without verifying or reconciling with actual ERC20 token balances, and lacks admin functions to withdraw excess tokens. Users or integrations might accidentally send tokens directly to the contract, which cannot be recovered due to missing sweep functionality. Tokens sent directly to the contract become permanently stuck, resulting in irreversible loss of assets and reduced trust in system robustness.\n",
            "severity": "Informational",
            "location": [
                "AMM.collateral_amount"
            ],
            "files": [
                "yb-core/contracts/AMM.vy"
            ]
        },
        {
            "id": 21,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Unnecessary Receiver Restriction",
            "description": "The `LT.withdraw()` and `LT.emergency_withdraw()` functions include an assertion that the `receiver` cannot be the staker contract, despite the fact that these functions only transfer asset tokens and do not mint new shares. The restriction appears to be carried over from `deposit()`, where such a check prevents minting shares to the staker itself, but it is redundant in withdrawal functions. The restriction can be easily bypassed by having the receiver call the token's own `transfer()` function after receiving funds, rendering the check ineffective. The restriction provides no security benefit and may confuse developers or users about the necessity of such checks in withdrawal flows. However, no direct harm occurs if the staker holds asset tokens.\n",
            "severity": "Informational",
            "location": [
                "LT.withdraw",
                "LT.emergency_withdraw"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        },
        {
            "id": 22,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-807"
                ]
            },
            "title": "AMM.fee Choice Considerations",
            "description": "The selection of `AMM.fee` must account for EMA oracle lag and potential price manipulation by block producers, as the fee influences the economic security of swaps. The cause is the EMA-based oracle used in `AMM.exchange()` lags behind real market prices, and can be manipulated in the short term, creating arbitrage opportunities. Attackers can exploit the lag or manipulate prices in a block to extract value from the AMM; a low fee would make such attacks more profitable. Insufficient fees may lead to repeated value extraction, reducing liquidity provider returns and destabilizing the system economically.\n",
            "severity": "Informational",
            "location": [
                "AMM.fee",
                "AMM.exchange"
            ],
            "files": [
                "yb-core/contracts/AMM.vy"
            ]
        },
        {
            "id": 23,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "max_token_reduction Computed With Admin Fees",
            "description": "The `max_token_reduction` calculation includes admin fees in the denominator, which inaccurately represents the post-change value of tokens. The cause is the formula uses `prev_value + value_change + 1`, which includes admin fee effects, rather than the true underlying value change, leading to a slight underestimation of allowable reductions. While not directly exploitable, this inaccuracy could theoretically be manipulated in edge cases involving large value changes and fee accrual. The deviation is minor and acknowledged by the team as non-critical, so the impact on system safety or user funds is negligible.\n",
            "severity": "Informational",
            "location": [
                "max_token_reduction#"
            ],
            "files": [
                "yb-core/contracts/LT.vy"
            ]
        }
    ]
}