{
    "path": "dataset-curated/reports/Zenith/Chateau - Zenith Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/chateau-capital/chateau-usd"
        ],
        "commit_id": [
            "82e830546d00fc6e7abd2a5653dae48e9de8851d"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-22",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Cross-chain minting and deployment of CHT leads to inflation beyond the maximum rate",
            "description": "The CHT token mint function allows up to a 10% annual inflation rate, but due to its omnichain deployment via LayerZero's OFT, the inflation check only considers the local chain's totalSupply(). This design flaw enables the owner to mint tokens on multiple chains independently, each allowing up to 10% inflation, thereby multiplying the effective global inflation rate by the number of deployed chains. The root cause is the lack of a centralized or coordinated supply check across chains, combined with independent state variables (totalSupply and lastMintTimestamp) per chain. An attacker (or malicious owner) could exploit this by minting the maximum allowable amount on each chain consecutively, leading to uncontrolled inflation. The impact includes dilution of token value and potential economic instability of the token ecosystem.\n",
            "severity": "Medium",
            "location": [
                "CHT.sol#L14"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Missing rate limit checkpoint during configuration update",
            "description": "The _setRateLimits function in RateLimiter.sol updates rate limit parameters (limit and window) without first checkpointing the current amountInFlight and lastUpdated values via _checkAndUpdateRateLimit. This allows new decay parameters to be applied retroactively to existing in-flight amounts. The cause is the omission of a state update before modifying configuration, which breaks the intended time-decay logic. For example, shortening the window from 1 hour to 10 minutes retroactively resets the in-flight amount to zero if more than 10 minutes have passed, even if the original transaction occurred under the old rules. This could be exploited by an owner to suddenly allow large transfers by adjusting parameters, undermining the rate limiting mechanism. The impact is potential uncontrolled token outflows across chains, increasing risk of fund drainage or abuse.\n",
            "severity": "Medium",
            "location": [
                "RateLimiter.sol#L31-L42"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Remove receive function from ChateauMinting",
            "description": "The ChateauMinting contract contains a receive() function that accepts Ether without any functional handling mechanism. Since the contract no longer includes WETH minting functionality and only operates with ERC20 tokens, the ability to receive ETH serves no purpose and introduces unnecessary risk. The root cause is outdated or redundant code that was not removed after functionality changes. An attacker could send ETH to the contract, potentially locking funds permanently since there is no withdrawal mechanism. While the impact is low—no direct loss of funds or critical function disruption—it represents a minor operational risk and poor code hygiene, which could confuse users or lead to lost funds.\n",
            "severity": "Low",
            "location": [
                "ChateauMinting.sol#L161-L163"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "chUSD token lacks flow rate limiter",
            "description": "The chUSD token inherits from LayerZero's OFT contract but does not implement the RateLimiter mixin, unlike chUSDOFT, leaving it without cross-chain transfer rate limits. This omission means there are no safeguards against rapid or excessive outflows of chUSD across chains. The cause is a missing inheritance and integration of the rate limiting logic, despite its availability and use in related contracts. An attacker could exploit this by triggering large cross-chain transfers in quick succession, potentially draining liquidity or destabilizing on-chain markets. The impact is a lack of control over token distribution dynamics, increasing systemic risk, especially during periods of high volatility or attack.\n",
            "severity": "Low",
            "location": [
                "chUSD.sol"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Zero mint delay renders CHT mint cap ineffective",
            "description": "The CHT token implements a 10% inflation cap per minting cycle, but the MINT_WAIT_PERIOD is set to zero, allowing unlimited consecutive mints within the same block or timestamp. This negates the intended economic safeguard, as the maxInflationAmount is recalculated based on the updated totalSupply() after each mint. The root cause is the absence of a mandatory cooldown period between mints, enabling the owner to bypass the cap through repeated transactions. An attacker (or malicious owner) could exploit this to inflate the supply rapidly, leading to significant token devaluation. The impact is primarily economic, undermining trust and stability, though it does not directly result in fund theft or contract failure.\n",
            "severity": "Informational",
            "location": [
                "CHT.sol#L19"
            ],
            "files": []
        }
    ]
}