{
    "path": "dataset-curated/reports/Zellic/Core and Periphery - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/capybaralabs-xyz/v3-core",
            "https://github.com/capybaralabs-xyz/v3-periphery"
        ],
        "commit_id": [
            "8064f9689124d5fafdc364b12b9b19ef12adacbf",
            "4b2709972be3f10f665e14c24781b0c20129d677"
        ],
        "address": [],
        "chain": "sei",
        "compiler_version": "n/a",
        "audit_date": "2025-01-28",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Incorrect chain-ID comparison",
            "description": "The tokenRatioPriority function in the NonfungibleTokenPositionDescriptor contract is designed to reorder tokens in the NFT URI based on priority, ensuring certain tokens appear first or last. However, the function incorrectly compares the chainId parameter against 1 (Ethereum's chain ID) instead of 329 (Sei network's chain ID). This root cause stems from a hardcoded value mismatch during adaptation to the Sei network. As a result, the conditional logic for prioritizing tokens like USDC, USDT, DAI, WBTC, and WETH will never trigger on the intended network. This leads to incorrect token ordering in the generated URIs, potentially causing confusion, incorrect frontend rendering, or duplicate URI generation due to inconsistent token positioning.\n",
            "severity": "Low",
            "location": [
                "NonfungibleTokenPositionDescriptor::tokenRatioPriority#(function)"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Fee unit type exceeds the first slot",
            "description": "The Slot0 struct in the UniswapV3Pool contract was modified to include a 32-bit feeProtocol field, increasing the total size of the struct from 241 bits to 265 bits. This exceeds the 256-bit limit for a single storage slot in the EVM, causing the struct to span two storage slots. The root cause is the expansion of the feeProtocol field from uint8 to uint32 without adjusting other fields to maintain slot packing. This results in additional SLOAD operations during reads and more expensive SSTORE operations during writes, particularly affecting functions like _modifyPosition and swap. The impact is increased gas costs for users during swaps and position modifications, leading to unnecessarily higher transaction fees over time.\n",
            "severity": "Informational",
            "location": [
                "UniswapV3Pool::Slot0#(struct)"
            ],
            "files": []
        }
    ]
}