{
    "path": "dataset-curated/reports/OpenZeppelin/Crown BRL Stablecoin Audit.md",
    "project_info": {
        "url": [
            "https://github.com/crown-xyz/crown-contracts"
        ],
        "commit_id": [
            "13631abf8ba2f2c183918ec288781c297b344d14"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-07-15",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Inconsistent Comment in BRLV.sol",
            "description": "The comment in line 123 of BRLV.sol states that a transfer will revert if either the 'from' or 'to' address is blocked, but the actual implementation only checks the 'from' address. This discrepancy could mislead developers or auditors about the access control behavior.\nThe root cause is a mismatch between the code comment and the implemented logic.\nAn attacker cannot directly exploit this, but it may lead to incorrect assumptions during integration or future development.\nThe impact is limited to potential confusion and maintenance risks, making it a low-severity issue.\n",
            "severity": "Low",
            "location": [
                "BRLV.sol#123",
                "BRLV.sol#128-130",
                "BRLV.sol#127"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Missing Docstrings",
            "description": "Multiple functions across the codebase lack NatSpec documentation, including a notable instance in YieldStripping.sol at line 107. This reduces code readability and increases the risk of incorrect usage or misinterpretation.\nThe cause is the absence of proper inline documentation for public and sensitive internal functions.\nWhile not directly exploitable, missing documentation can lead to integration errors or incorrect assumptions by developers.\nThe impact is reduced maintainability and increased risk of human error during future development or audits.\n",
            "severity": "Low",
            "location": [
                "YieldStripping.sol#106-107"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Rounding Errors in _burn May Leave Dust in Accounts",
            "description": "The _burn function in BRLY.sol uses convertToSharesRoundUp and enforces a strict check (accountShares < shares), making it nearly impossible for users to withdraw or burn their full balance due to rounding errors.\nThis is caused by the combination of rounding logic and the lack of an 'exact burn' or 'burn all' functionality.\nUsers attempting to withdraw or burn all their shares may leave small amounts ('dust') behind, which cannot be removed under current logic.\nThe impact is user inconvenience and permanent loss of small token amounts, classified as low severity due to minimal financial impact.\n",
            "severity": "Low",
            "location": [
                "BRLY.sol::convertToSharesRoundUp#298",
                "YieldStripping.sol::withdraw#99",
                "BRLY.sol::_burn#301-303"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "YieldStrippable.sol Should Be Renamed",
            "description": "The file YieldStrippable.sol contains only an interface (IYieldStrippable) but is not named according to Solidity convention (IInterfaceName.sol).\nThis violates common naming standards and may cause confusion for developers integrating with the codebase.\nThere is no direct security exploit, but it reduces code clarity and maintainability.\nThe impact is purely on code quality and developer experience, warranting an informational note.\n",
            "severity": "Informational",
            "location": [
                "YieldStrippable.sol",
                "YieldStripping.sol#11"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "IBRLY Should Be in a Separate File",
            "description": "The IBRLY interface is defined within BRLV.sol instead of its own dedicated file.\nThis reduces modularity and makes it harder to reuse the interface across different contracts.\nWhile functional, this practice complicates dependency management and code navigation.\nThe impact is reduced code organization and maintainability, qualifying it as an informational note.\n",
            "severity": "Informational",
            "location": [
                "BRLV.sol#16-29"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "_tryGetAssetDecimals Is Unused",
            "description": "The _tryGetAssetDecimals function in YieldStripping.sol is defined but never called anywhere in the codebase.\nUnused functions increase code bloat and may confuse auditors or developers about intended functionality.\nThere is no security risk, but it indicates incomplete code cleanup.\nThe impact is reduced code clarity, making it an informational finding.\n",
            "severity": "Informational",
            "location": [
                "YieldStripping.sol::_tryGetAssetDecimals"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {},
            "title": "Claiming 0 Rewards Possible",
            "description": "The claimRewards function allows claiming zero rewards, which results in a no-op transaction that only emits an unnecessary event.\nThis is caused by the absence of a validation check on the rewards amount.\nAttackers could potentially spam the network with zero-claim transactions, increasing log bloat.\nThe impact is minimal, limited to inefficient event logging, hence classified as informational.\n",
            "severity": "Informational",
            "location": [
                "YieldStripping.sol::claimRewards#107"
            ],
            "files": []
        },
        {
            "id": 7,
            "category": {},
            "title": "Unused Imports",
            "description": "Multiple files import libraries (e.g., ECDSAUpgradeable, ERC4626Upgradeable) that are not used in the code.\nThese unused imports increase compilation size and may mislead developers about dependencies.\nThere is no security impact, but it reflects poor code hygiene.\nThe impact is reduced code clarity and maintainability, qualifying it as an informational note.\n",
            "severity": "Informational",
            "location": [
                "BRLV.sol#7",
                "BRLV.sol#11",
                "BRLY.sol#7",
                "YieldStripping.sol#8",
                "wBRLY.sol#7"
            ],
            "files": []
        }
    ]
}