{
    "path": "dataset-curated/reports/Zellic/Cultured February - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/cultured-rwa/cultured-contracts"
        ],
        "commit_id": [
            "af802121...95ee340e"
        ],
        "address": [],
        "chain": "EVM-compatible",
        "compiler_version": "n/a",
        "audit_date": "2025-01-30",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Breaking validation of increasing/decreasing position process",
            "description": "The validateIncreasePosition and validateDecreasePosition functions in VaultUtils.sol lack caller validation, allowing any user to invoke them. \n1. **Description:** These functions are intended to validate position changes before execution, ensuring users do not exceed governance-defined size limits. However, they are exposed externally without access control.\n2. **Cause:** The absence of a modifier or check to restrict function calls to only the Vault contract allows arbitrary callers to manipulate the perUserSizeLimit state.\n3. **Exploitation:** An attacker could call validateDecreasePosition with another user's address and a large _sizeDelta, underflowing their perUserSizeLimit. This would prevent the victim from increasing their position in the future due to arithmetic underflow or incorrect state tracking. Similarly, an attacker could manipulate the validation process to disrupt system invariants.\n4. **Impact:** This could disrupt the intended proportionality between actual and recorded position sizes, and malicious actors could block legitimate users from increasing their positions, leading to denial of service and potential manipulation of risk exposure.\n",
            "severity": "High",
            "location": [
                "VaultUtils.sol::validateIncreasePosition",
                "VaultUtils.sol::validateDecreasePosition"
            ],
            "files": []
        }
    ]
}