{
    "path": "dataset-curated/reports/Zellic/DexFi Factory - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/dexfinance-com/DexFi-Vaults"
        ],
        "commit_id": [
            "2d0f6bd5ba35e7207b8bd98237ea8d8a795082bc"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-28",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Lack of a whitelist check",
            "description": "1. **Description:** The createVault() function in DexFiVaultFactory accepts an array of farm descriptors without verifying that each farm is present in the _farmsWhitelist. Although the validation is eventually performed in DexFiVault.initialize() via DexFiVaultHelper.processFarm, the factory does not perform this check upfront.\n2. **Cause:** The absence of an explicit whitelist validation in createVault() before deploying the BeaconProxy. This design relies solely on downstream validation within the vault, which could be removed or weakened in future upgrades.\n3. **Exploitation:** An attacker could supply a malicious farm contract during vault creation. If a future upgrade removes or bypasses the vault-side validation, the malicious farm could gain control over the vault’s funds.\n4. **Impact:** This exposes users to potential loss of funds if future implementations remove the vault-level whitelist check. It also results in wasted gas due to deploying a BeaconProxy that will later revert.\n",
            "severity": "High",
            "location": [
                "DexFiVaultFactory.sol::createVault"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Connector data is not cleared when profit tokens or farms are removed from the allowlist",
            "description": "1. **Description:** When profit tokens or farms are removed from the whitelist via removeProfitTokensWhitelist or removeFarmsWhitelist, the associated data in profitTokenConnector and farmCalculationConnector mappings are not cleared.\n2. **Cause:** The removal functions do not include logic to delete or reset the corresponding entries in the connector storage mappings.\n3. **Exploitation:** An attacker or user querying these mappings after removal may receive outdated or stale connector information, potentially leading to incorrect assumptions or integrations relying on obsolete data.\n4. **Impact:** The primary impact is data inconsistency. While not directly exploitable for fund theft, it may lead to operational errors or incorrect behavior in systems relying on up-to-date connector data.\n",
            "severity": "Informational",
            "location": [
                "DexFiVaultFactory.sol::removeProfitTokensWhitelist",
                "DexFiVaultFactory.sol::removeFarmsWhitelist"
            ],
            "files": []
        }
    ]
}