{
    "path": "dataset-curated/reports/OpenZeppelin/Fiamma Bridge Audit.md",
    "project_info": {
        "url": [
            "https://github.com/fiamma-chain/bitvm-bridge-contracts"
        ],
        "commit_id": [
            "935e2cbd1b5d1060439045b74ace6b2f506a25ad"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-05-14",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Malicious Owner Can Mint Wrapped BTC From Arbitrary Bitcoin Transactions",
            "description": "The `mint` function in the `BitVMBridge` contract allows the owner to mint wrapped BTC based on any valid Bitcoin transaction that has sufficient confirmations, without verifying that the transaction was sent to the correct multisig address. The root cause is the lack of validation that the Bitcoin transaction's destination matches the expected multisig address generated during the PEG-IN process. An attacker with ownership privileges could exploit this by calling `mint` with proof of any past Bitcoin transaction, thereby minting unbacked wrapped BTC to arbitrary addresses. This could lead to the complete devaluation of the wrapped BTC token and significant financial loss for users trusting the 1:1 backing model.\n",
            "severity": "High",
            "location": [
                "BitVMBridge.sol::mint#118"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Potential Loss of Wrapped BTC",
            "description": "The `burn` function in the `BitVMBridge` contract accepts a `_btc_addr` parameter that is not validated for correctness (e.g., proper format or checksum). The cause is the absence of input validation logic for Bitcoin address formats. A user could accidentally input an invalid Bitcoin address, leading to irreversible loss of their wrapped BTC when the relayer attempts to send BTC to an invalid destination. Since there is no mechanism to revert or recover funds after a burn, the impact is permanent loss of user assets. This could erode trust in the bridge and result in financial harm to users due to simple input errors.\n",
            "severity": "Medium",
            "location": [
                "BitVMBridge.sol::burn#138"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Malicious Owner Can Mint to a Random Recipient",
            "description": "The `mint` function does not enforce that the `to` recipient address is cryptographically tied to the original PEG-IN transaction on Bitcoin. The cause is the lack of a binding mechanism between the off-chain PEG-IN request and the on-chain minting recipient. A malicious or compromised owner could redirect the minted wrapped BTC to any address of their choice, even if the Bitcoin transaction was initiated by another user. This allows theft of funds by misappropriating the value of legitimate PEG-IN transactions, undermining the integrity of the entire bridging mechanism and enabling targeted or widespread fund diversion.\n",
            "severity": "Medium",
            "location": [
                "BitVMBridge.sol::mint#100"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Functions Updating State Without Event Emissions",
            "description": "Several critical state-modifying functions in `BitVMBridge.sol`, including `setParameters`, `setMinConfirmations`, and `setBtcTxVerifier`, do not emit events upon state changes. The cause is the omission of event emissions in these functions. Without events, off-chain systems and users cannot reliably track changes to critical parameters such as minting limits or the Bitcoin transaction verifier contract. This lack of transparency could allow malicious or accidental configuration changes to go unnoticed, leading to operational disruptions or undetected attacks. The impact includes reduced system observability and increased risk of unauthorized or erroneous parameter modifications.\n",
            "severity": "Low",
            "location": [
                "BitVMBridge.sol::setParameters#63-80",
                "BitVMBridge.sol::setMinConfirmations#149-151",
                "BitVMBridge.sol::setBtcTxVerifier#153-155"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Missing _disableInitializers",
            "description": "The `BitVMBridge` contract, being upgradeable, does not call `_disableInitializers()` in its constructor. The cause is the omission of this security-critical call, which is necessary to prevent re-initialization of the implementation contract. An attacker could directly call the `initialize` function on the logic contract after deployment, potentially reinitializing ownership or other critical state variables. This could lead to a complete takeover of the contract if the attacker gains control of the initialization logic, resulting in loss of funds or governance control. The impact is a critical upgradeability vulnerability that undermines the security of the proxy pattern.\n",
            "severity": "Low",
            "location": [
                "BitVMBridge.sol#constructor"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "Unused Error",
            "description": "The `InvalidBtcAddress` custom error is declared in the `BitVMBridge.sol` contract but is never used anywhere in the codebase. The cause is code redundancy or oversight during development. While this does not introduce a direct security vulnerability, it reduces code clarity and may mislead auditors or developers into thinking the error is used for Bitcoin address validation. The impact is limited to maintainability and code quality, as unused code increases complexity and the risk of future errors during refactoring or extension.\n",
            "severity": "Informational",
            "location": [
                "BitVMBridge.sol#41"
            ],
            "files": []
        }
    ]
}