{
    "path": "dataset-curated/reports/OpenZeppelin/Fireblocks Upgradeable Tokens Audit - ERC1155F.md",
    "project_info": {
        "url": [
            "https://github.com/fireblocks/reference-protocols"
        ],
        "commit_id": [
            "e7003dfb9d89aa4b314a7428cbc59d07f178fd76"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2023-11-13",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Retrieving the Whole Access List Might Revert",
            "description": "The `getAccessList` function in the `AccessListUpgradeable` contract retrieves all values from the access list by copying the entire storage into memory using `EnumerableSetUpgradeable.AddressSet.values`. This operation can consume a large amount of gas, especially when the access list is extensive. Since Ethereum enforces a block gas limit, this function call may revert if the gas required exceeds the block limit, making it unreliable for large datasets. The root cause is the use of an unbounded memory copy operation without pagination or slicing. An attacker or legitimate user attempting to read a large list could cause a denial of service by triggering a revert. This impacts the availability and reliability of the access list query functionality, although it does not compromise fund safety or access control directly.\n",
            "severity": "Low",
            "location": [
                "AccessListUpgradeable.sol::getAccessList#203-205"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Lack of Security Contact",
            "description": "The contract does not include a designated security contact via a NatSpec `@custom:security-contact` comment. This omission makes it difficult for external researchers or auditors to report vulnerabilities securely and efficiently. The root cause is the absence of a standardized communication channel declaration in the source code. While this does not introduce a direct technical exploit, it increases the risk of unreported vulnerabilities due to uncertainty about responsible disclosure procedures. The impact is a potential delay or failure in addressing future security issues, weakening the overall security posture of the project.\n",
            "severity": "Informational",
            "location": [],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Missing Named Parameters in Mapping",
            "description": "Several mappings in the codebase, such as `_tokenUri` in `TokenUriUpgradeable.sol`, do not use named parameters, a feature available since Solidity 0.8.18. This reduces code readability and maintainability, as the purpose of each key and value in the mapping is not explicitly documented in the syntax. The root cause is outdated coding practices. While this does not lead to exploitable vulnerabilities, it increases the likelihood of developer errors during maintenance or upgrades. The impact is a higher risk of logic mistakes due to ambiguity in mapping usage, especially in complex contracts.\n",
            "severity": "Informational",
            "location": [
                "TokenUriUpgradeable.sol::_tokenUri"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Unnecessary Variable Cast",
            "description": "In the `AccessRegistrySubscriptionUpgradeable` contract, the `_accessRegistry` variable in the `_accessRegistryUpdate` function is unnecessarily casted. This superfluous cast adds noise to the code and may mislead developers into thinking a type conversion is necessary when it is not. The root cause is poor code hygiene. While this does not affect runtime behavior or security, it harms code clarity and maintainability. The impact is reduced developer confidence and increased cognitive load when auditing or modifying the code.\n",
            "severity": "Informational",
            "location": [
                "AccessRegistrySubscriptionUpgradeable.sol::_accessRegistryUpdate#78"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Unused Imports",
            "description": "Multiple contracts, including `ContractUriUpgradeable.sol`, `MarketplaceOperatorUpgradeable.sol`, `PauseUpgradeable.sol`, and `TokenUriUpgradeable.sol`, import `LibErrors` but do not use it. These unused imports bloat the compiled bytecode and reduce code clarity. The root cause is failure to clean up imports after refactoring. While this does not introduce security risks, it increases deployment costs and complicates code review. The impact is inefficient gas usage and reduced maintainability.\n",
            "severity": "Informational",
            "location": [
                "ContractUriUpgradeable.sol",
                "MarketplaceOperatorUpgradeable.sol",
                "PauseUpgradeable.sol",
                "TokenUriUpgradeable.sol"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "Lack of `__gap` Variables",
            "description": "Several upgradeable contracts, including `AllowList`, `DenyList`, and `ERC1155F`, do not include a `__gap` variable to reserve storage slots for future upgrades. Although the current inheritance model avoids conflicts, the absence of `__gap` increases the risk of storage collisions if future changes alter the inheritance structure. The root cause is deviation from OpenZeppelin's recommended upgradeable contract pattern. The impact is potential breaking of upgradeability in future versions, leading to irreversible storage corruption.\n",
            "severity": "Informational",
            "location": [
                "AllowList.sol",
                "DenyList.sol",
                "ERC1155F.sol"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {},
            "title": "Incorrect Storage Gap Size in `AccessListUpgradeable`",
            "description": "The `AccessListUpgradeable` contract defines a `__gap` variable of size 49, assuming `_accessList` occupies one storage slot. However, `EnumerableSetUpgradeable.AddressSet` uses two storage slots, leaving only 48 slots reserved for future use. This miscalculation could lead to storage clashes during upgrades if new variables are added. The root cause is incorrect assumption about struct storage layout. The impact is a risk of storage collision in future upgrades, potentially breaking contract functionality.\n",
            "severity": "Informational",
            "location": [
                "AccessListUpgradeable.sol::__gap#305"
            ],
            "files": []
        },
        {
            "id": 7,
            "category": {},
            "title": "Confusing Error Used",
            "description": "The `recoverTokens` function in `ERC1155F` reverts with `ERC155InvalidReceiver` when an account already has access, which is misleading because the error implies a receiver issue when the actual condition is access-related. The root cause is inappropriate error selection. This can confuse users and developers during debugging. The impact is degraded user experience and potential misdiagnosis of issues during incident response.\n",
            "severity": "Informational",
            "location": [
                "ERC1155F.sol::recoverTokens"
            ],
            "files": []
        },
        {
            "id": 8,
            "category": {},
            "title": "Missing Input Validation",
            "description": "The `mintBatch` function in `ERC1155F` does not validate that the `id`, `amount`, and `URI` arrays are of equal length. This could lead to silent misbehavior or out-of-bounds access if arrays are mismatched. The root cause is missing input validation. An attacker could exploit this by providing malformed input to cause unexpected state changes. The impact includes potential minting errors or reverts during execution, affecting reliability and usability.\n",
            "severity": "Informational",
            "location": [
                "ERC1155F.sol::mintBatch#325-347"
            ],
            "files": []
        },
        {
            "id": 9,
            "category": {},
            "title": "Typographical Errors and Incorrect Comments",
            "description": "The `AccessRegistrySubscriptionUpgradeable` contract contains a function named `__AccessRegsitrySubscription_init` with a typo in \"Registry\". Additionally, NatSpec comments in `hasAccess` functions incorrectly refer to the parameter as `claim` instead of `data`. The root cause is lack of proofreading. These errors reduce code professionalism and may confuse developers. The impact is increased risk of misunderstanding function behavior and reduced trust in code quality.\n",
            "severity": "Informational",
            "location": [
                "AccessRegistrySubscriptionUpgradeable.sol::__AccessRegsitrySubscription_init#50-52",
                "AccessListUpgradeable.sol::hasAccess",
                "AllowList.sol::hasAccess",
                "DenyList.sol::hasAccess"
            ],
            "files": []
        },
        {
            "id": 10,
            "category": {},
            "title": "Gas Optimization",
            "description": "The `_requireHasAccess` function in `ERC1155F` performs redundant checks on `isSender`, and functions like `revokeRole` in `RoleAccessUpgradeable` perform access checks after state updates instead of before. The root cause is suboptimal control flow. This leads to higher gas consumption and missed opportunities for early reverts. The impact is increased transaction costs and reduced efficiency, especially in high-frequency operations.\n",
            "severity": "Informational",
            "location": [
                "ERC1155F.sol::_requireHasAccess#656-665",
                "RoleAccessUpgradeable.sol::revokeRole#42-49"
            ],
            "files": []
        },
        {
            "id": 11,
            "category": {},
            "title": "Missing Functionality For Rescuing ERC-721 and ERC-1155 Tokens",
            "description": "The `SalvageUpgradeable` contract allows recovery of ETH and ERC-20 tokens sent to the contract, but lacks functionality for ERC-721 and ERC-1155 tokens. The root cause is incomplete implementation of token recovery. If such tokens are accidentally sent, they become permanently locked. The impact is potential permanent loss of user funds, reducing the safety and usability of the contract.\n",
            "severity": "Informational",
            "location": [
                "SalvageUpgradeable.sol"
            ],
            "files": []
        }
    ]
}