{
    "path": "dataset-curated/reports/OpenZeppelin/Fireblocks Upgradeable Tokens Audit - ERC20F.md",
    "project_info": {
        "url": [
            "https://github.com/fireblocks/reference-protocols"
        ],
        "commit_id": [
            "e7003dfb9d89aa4b314a7428cbc59d07f178fd76"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2023-11-13",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Retrieving the Whole Access List Might Revert",
            "description": "The `getAccessList` function in the `AccessListUpgradeable` contract retrieves all values from the access list by copying the entire storage into memory using `EnumerableSetUpgradeable.AddressSet.values()`. This operation can consume a large amount of gas when the access list is extensive, potentially exceeding the block gas limit and causing the transaction to revert. The root cause is the lack of pagination or slicing mechanism for large datasets. An attacker or even a legitimate user attempting to retrieve a large list could trigger a revert, leading to denial of service for this functionality. The impact is limited to disruption of access list retrieval, not core token operations.\n",
            "severity": "Low",
            "location": [
                "AccessListUpgradeable.sol::getAccessList#203-205"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Missing Input Validation in burn Function",
            "description": "The `burn` function in the `ERC20F` contract does not validate that the amount to be burned is non-zero. This lack of input validation could allow a user to call the function with zero value, which, while harmless in isolation, may lead to unnecessary gas consumption and could be exploited in combination with other functions or front-running attacks to manipulate state or logs. The root cause is the absence of a basic require check for non-zero amount. An attacker could exploit this by submitting zero-value burn transactions to bloat logs or waste user gas in automated systems. The impact is low, primarily affecting gas efficiency and system clarity.\n",
            "severity": "Low",
            "location": [
                "ERC20F.sol::burn#220-223"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Incorrect Storage Gap Size in AccessListUpgradeable",
            "description": "The `AccessListUpgradeable` contract defines a `__gap` variable of size 49, assuming the `_accessList` struct occupies one storage slot. However, `EnumerableSetUpgradeable.AddressSet` uses two storage slots, leaving only 48 slots available for future use. This miscalculation risks storage collisions during future upgrades if new variables are added. The root cause is incorrect assumption about the storage layout of OpenZeppelin's EnumerableSet. An attacker cannot directly exploit this, but a future upgrade could inadvertently overwrite storage, leading to loss of functionality or state corruption. The impact is medium if unpatched, but was resolved by reducing `__gap` to 48.\n",
            "severity": "Low",
            "location": [
                "AccessListUpgradeable.sol::__gap#305"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Confusing Error Used in recoverTokens",
            "description": "The `recoverTokens` function in `ERC20F` reverts with `ERC20InvalidReceiver` when the target account already has access, which is misleading because the account is not acting as a receiver. This incorrect error message could confuse users and developers during debugging. The root cause is the reuse of an inappropriate error type. While not directly exploitable, it could lead to misdiagnosis of issues or delayed response to real problems. The impact is low, affecting only clarity and user experience. This was resolved by introducing a more descriptive error.\n",
            "severity": "Low",
            "location": [
                "ERC20F.sol::recoverTokens"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Missing Functionality For Rescuing ERC-721 and ERC-1155 Tokens",
            "description": "The `SalvageUpgradeable` contract allows recovery of ETH and ERC-20 tokens sent to the contract but lacks support for ERC-721 and ERC-1155 tokens. This omission means that valuable NFTs or semi-fungible tokens sent by mistake are permanently locked. The root cause is incomplete implementation of token recovery logic. An attacker cannot exploit this directly, but users may suffer permanent loss of assets due to human error. The impact is low to medium depending on usage, but the team chose not to implement it due to lack of demand. This remains an unresolved risk.\n",
            "severity": "Low",
            "location": [
                "SalvageUpgradeable.sol"
            ],
            "files": []
        }
    ]
}