{
    "path": "dataset-curated/reports/OpenZeppelin/Fireblocks Upgradeable Tokens Audit - ERC721F.md",
    "project_info": {
        "url": [
            "https://github.com/fireblocks/reference-protocols"
        ],
        "commit_id": [
            "e7003dfb9d89aa4b314a7428cbc59d07f178fd76"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2023-11-13",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "ERC721F Transfer Access List Can Be Bypassed",
            "description": "The ERC721F contract implements access control checks in its overridden `transferFrom` function to enforce allowlist/denylist restrictions on token transfers. However, the contract inherits from OpenZeppelin's `ERC721Upgradeable`, which includes two `safeTransferFrom` functions that do not internally call the overridden `transferFrom` but instead use `_safeTransfer`, bypassing the access checks entirely. This omission in the inheritance chain allows users without proper access to transfer tokens using `safeTransferFrom`, effectively circumventing the access control mechanism. As a result, malicious or unauthorized actors could transfer tokens they should not be allowed to, undermining the core security model of the access list functionality.\n",
            "severity": "High",
            "location": [
                "ERC721F.sol::transferFrom#279-283",
                "ERC721F.sol::safeTransferFrom"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Burner Can Burn Any ERC721F Token",
            "description": "The `burn` function in the ERC721F contract is intended to allow only addresses with the `BURNER_ROLE` to burn tokens owned by the caller. However, while the function restricts execution to the correct role, it fails to verify that the caller owns the token or has approval to burn it before calling `_burn`. This missing ownership or approval check means that any address with the `BURNER_ROLE` can burn any token in the system regardless of ownership. An attacker or malicious actor with this role could exploit this flaw to destroy arbitrary user assets, leading to irreversible loss of funds and user trust.\n",
            "severity": "Medium",
            "location": [
                "ERC721F.sol::burn#222-225",
                "ERC721F.sol::_burn"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Follow Checks-Effects-Interactions (CEI) Pattern",
            "description": "The `mint` function in the ERC721F contract violates the Checks-Effects-Interactions (CEI) security pattern by calling `_safeMint` before updating the token URI via `_tokenUriUpdate`. Since `_safeMint` triggers an external call to the recipient's `onERC721Received` hook, a malicious contract recipient can re-enter the contract during minting and manipulate state—such as reading or setting the token URI—before the intended URI update occurs. This incorrect ordering enables potential reentrancy-related manipulation of token metadata, which could lead to inconsistent or fraudulent token representations and undermine the integrity of the minting process.\n",
            "severity": "Low",
            "location": [
                "ERC721F.sol::mint#202",
                "ERC721F.sol::_safeMint#204",
                "ERC721F.sol::_tokenUriUpdate#205"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Retrieving the Whole Access List Might Revert",
            "description": "The `getAccessList` function in the `AccessListUpgradeable` contract retrieves all addresses from an `EnumerableSetUpgradeable.AddressSet` by copying the entire storage into memory using the `values()` function. For large access lists, this operation can consume significant gas and potentially exceed the block gas limit, causing the function call to revert. This creates a denial-of-service risk where legitimate users cannot retrieve the full access list when it grows beyond a certain size. Attackers could potentially exploit this by bloating the list, rendering the function unusable for governance or auditing purposes.\n",
            "severity": "Low",
            "location": [
                "AccessListUpgradeable.sol::getAccessList#203-205",
                "EnumerableSetUpgradeable.sol::values"
            ],
            "files": []
        }
    ]
}