{
    "path": "dataset-curated/reports/Zenith/LootGO - Zenith Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Loot-Go/lootgo-contracts"
        ],
        "commit_id": [
            "66ed9a974d05a4e3f74a51856a814c890acf006e"
        ],
        "address": [],
        "chain": null,
        "compiler_version": "n/a",
        "audit_date": "2025-11-07",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "[L-1] fallback() function is not needed",
            "description": "The fallback() function is present in the contract but is not necessary because the receive() function already handles native token payments. Having a fallback function without a specific use case can lead to unintended behavior when the contract receives calls with unrecognized calldata, as it will not revert but may execute unexpectedly.\n\nThe root cause is the inclusion of a fallback function without a clear purpose, which contradicts the principle of least privilege and minimal attack surface.\n\nAn attacker or user could potentially trigger the fallback function with malformed or unexpected data, leading to confusion or unintended state changes if the function were to be modified in the future.\n\nThe impact is low, as the current implementation does not perform any critical actions in the fallback function, but its presence increases the risk of future vulnerabilities during upgrades or maintenance.\n",
            "severity": "Low",
            "location": [
                "LootDrop.sol"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "[I-1] Introduce a pauser role",
            "description": "The pause() function is currently restricted to the DEFAULT_ADMIN_ROLE, which grants full administrative privileges. This creates an operational risk because emergency pausing should ideally be handled by a separate, more limited role to avoid using a highly privileged account for routine or emergency actions.\n\nThe root cause is a lack of role separation in access control design, which reduces operational security and increases the risk of compromise of the admin key.\n\nIf the admin key is used frequently for pausing, it increases its exposure to potential compromise. An attacker gaining access to this key would have full control over the contract.\n\nThe impact is low, as the functionality is secure as long as the admin key is well protected, but introducing a dedicated pauser role would improve security best practices and reduce long-term risk.\n",
            "severity": "Informational",
            "location": [
                "LootDrop.sol"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "[I-2] Validate duplicate recipients",
            "description": "The batchTransferSingleToken() and batchSendETH() functions accept arrays of recipient addresses without validating for duplicates. This could lead to accidental overpayments if the same address appears multiple times in the input array.\n\nThe root cause is the absence of input validation to ensure uniqueness of recipient addresses in batch operations.\n\nAn attacker or user could craft a transaction with duplicate addresses, causing more tokens or ETH to be sent than intended, especially if off-chain logic assumes uniqueness.\n\nThe impact is low, as this is more of an operational safeguard than a critical flaw, but preventing duplicates would reduce the risk of user error and unnecessary gas consumption.\n",
            "severity": "Informational",
            "location": [
                "LootDrop.sol"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "[I-3] Unnecessary payable casts",
            "description": "The code contains unnecessary casts to 'payable' in functions such as sendETH and adminWithdrawETH, and in internal calls like payable(recipients[i]).call. These casts increase deployment cost without providing any functional benefit, as the addresses are already payable.\n\nThe root cause is redundant type casting, which increases bytecode size and deployment gas cost.\n\nWhile not directly exploitable, this inefficiency leads to higher deployment costs and contributes to bloated contract code.\n\nThe impact is low, but removing these casts reduces deployment cost (as noted, from 2780093 to 2768275 gas) and aligns with code optimization best practices.\n",
            "severity": "Informational",
            "location": [
                "LootDrop.sol::sendETH#174",
                "LootDrop.sol::batchSendETH#215",
                "LootDrop.sol::adminWithdrawETH#250"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "[I-4] Use custom errors instead of string error messages",
            "description": "The contract uses string-based error messages in require statements, such as in the insufficient balance check. These strings are expensive to deploy and cannot be efficiently parsed on-chain.\n\nThe root cause is the use of dynamic string reverts instead of custom errors, which are more gas-efficient and provide better readability and maintainability.\n\nWhile not directly exploitable, this design choice increases deployment cost and reduces the efficiency of error handling.\n\nThe impact is low, but switching to custom errors (e.g., InsufficientBalance(tokenAddr)) would reduce gas costs and improve code clarity and standard compliance.\n",
            "severity": "Informational",
            "location": [
                "LootDrop.sol#159"
            ],
            "files": []
        }
    ]
}