{
    "path": "dataset-curated/reports/Zellic/Mitosis Extensible Vaults - Zellic Audit Reports.pdf",
    "project_info": {
        "url": [
            "https://github.com/mitosis-org/extensible-vaults"
        ],
        "commit_id": [
            "cb43175b8bc274c8fcb4b65d996f057f2fffb910"
        ],
        "address": null,
        "chain": "EVM",
        "compiler_version": "n/a",
        "audit_date": "2025-08-11",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Inaccessible contract balance due to flawed withdrawal mechanism",
            "description": "The ListaEarnStrategyManager contract incorrectly handles asset withdrawals by only allowing withdrawal of assets from a vault via the withdraw function, while the totalBalance function includes both vault assets and direct contract-held assets. This discrepancy arises because the contract accumulates assets directly in its balance (e.g., via external transfers or rewards), but the withdraw function does not account for these direct holdings. As a result, any assets that end up in the contract's direct balance cannot be withdrawn, making them permanently inaccessible. An attacker cannot directly exploit this for gain, but the flaw leads to a loss of user funds when withdrawals are attempted and the system reports sufficient assets via totalBalance, yet fails to deliver them. This undermines trust in the vault's solvency and may lead to a partial or complete denial of service for withdrawals when significant funds are trapped.\n",
            "severity": "Medium",
            "location": [
                "ListaEarnStrategyManager.sol::totalBalance",
                "ListaEarnStrategyManager.sol::withdraw",
                "ExtensibleVault.sol::totalAssets"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "The claimLendingEmissions function lacks proper batch-claim support",
            "description": "The claimLendingEmissions function in ListaEarnStrategyManager is designed to claim emissions for multiple tokens but fails to support batch operations correctly. It creates a fixed-size accounts array of length one and hardcodes accounts[0] = address(this), while passing variable-length tokens, amounts, and proofs arrays to the batchClaim function. This causes a mismatch in array lengths expected by batchClaim, which requires all arrays (accounts, tokens, amounts, proofs) to be aligned across multiple accounts. The root cause is improper array construction in the function. When a user with EMISSION_MANAGER_ROLE attempts to claim multiple token types in a single call, the transaction will revert due to the array length mismatch. This limits operational efficiency and usability but does not result in fund loss. The impact is low as it only affects convenience and gas efficiency for admin operations.\n",
            "severity": "Low",
            "location": [
                "ListaEarnStrategyManager.sol::claimLendingEmissions"
            ],
            "files": []
        }
    ]
}