{
    "path": "dataset-curated/reports/Zenith/Mitosis - Zenith Audit Report (August).pdf",
    "project_info": {
        "url": [
            "https://github.com/mitosis-org/TMITO.git"
        ],
        "commit_id": [
            "7f9598ba48ab2bc5980b7b38ede5b64fb62cdcc7"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-15",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Users can redeem with an unfinalized ratio when the lockup period has ended",
            "description": "The vulnerability allows users to initiate redemption transactions even when the redemption ratio has not been finalized by the admin, despite the lockup period having ended. This occurs due to the absence of a check ensuring the ratio is finalized before allowing redemptions. An attacker could exploit this by calling the redeem function during the window between the end of the lockup period and ratio finalization, leading to inconsistent or unintended redemption amounts. The impact is low as it violates protocol flow but does not result in fund loss or critical failure.\n",
            "severity": "Low",
            "location": [
                "src/TMITO.sol#177"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "redeem may revert in some scenarios",
            "description": "The redeem function uses Solidity's transfer function, which forwards a fixed 2300 gas units, insufficient for certain recipient contracts. This can lead to transaction failure when sending to contracts that either lack a payable fallback, require more than 2300 gas in their fallback, or are called through proxies or multisig wallets with higher gas requirements. The root cause is the use of transfer instead of a more flexible method like call. An attacker could potentially force a revert by targeting such recipients, disrupting normal operations. The impact is low as it may cause reverts but does not lead to fund loss or critical system failure.\n",
            "severity": "Low",
            "location": [
                "src/TMITO.sol#183"
            ],
            "files": []
        }
    ]
}