{
    "path": "dataset-curated/reports/Zellic/Odos Cross-Chain Contracts - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/odos-xyz/odos-cross-chain-contracts"
        ],
        "commit_id": [
            "399776e92a72f3882ce10346d1ac81438f4d4736"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-06-17",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Inconsistent handling of native token",
            "description": "1. **Description:** The AcrossHook and OdosRouter contracts use the zero address to represent the native token when interacting with the SpokePool contract, but the SpokePool contract expects the WETH address for native token operations. This inconsistency causes transactions to revert when the zero address is used.\n2. **Cause:** The root cause is a mismatch in how native tokens are represented: the Odos contracts use address(0), while the SpokePool contract only accepts the wrapped native token (WETH) address for native token deposits and requires msg.value to be zero otherwise.\n3. **Exploitation:** Any user attempting to bridge native tokens using the zero address as inputToken will trigger a revert in the SpokePool contract due to msg.value being non-zero while inputToken is not WETH, causing the transaction to fail.\n4. **Impact:** All transactions involving native token bridging that use the zero address will fail, disrupting core functionality and preventing successful cross-chain transfers, which violates the expected behavior of the system.\n",
            "severity": "High",
            "location": [
                "AcrossHook.sol::_executeSpokePoolCall"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Lack of validation of outputToken address",
            "description": "1. **Description:** The executeOdosHook function in the AcrossHook contract does not validate that the outputToken specified in hookData is not the zero address, even though the destination chain's handleV3AcrossMessage function explicitly reverts if tokenSent (i.e., outputToken) is address(0).\n2. **Cause:** The absence of input validation in executeOdosHook allows users to set outputToken to the zero address, which is interpreted as native token on the source side but is disallowed on the destination chain.\n3. **Exploitation:** An attacker or misinformed user could specify the zero address as outputToken, leading to a successful deposit on the source chain but a revert when processing the message on the destination chain, resulting in a failed swap.\n4. **Impact:** The bridging and swap operation will fail on the destination chain, leaving the user's funds potentially stranded or requiring manual recovery, thereby degrading user experience and reliability of the cross-chain functionality.\n",
            "severity": "Medium",
            "location": [
                "AcrossHook.sol::executeOdosHook"
            ],
            "files": []
        }
    ]
}