{
    "path": "dataset-curated/reports/OpenZeppelin/OneSig Audit.md",
    "project_info": {
        "url": [
            "https://github.com/Everdawn-Labs/OneSig/"
        ],
        "commit_id": [
            "5ec9d07d2a92214af5d1f7c6b6110ea9d4218038"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-03-24",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Redundant Version String in DOMAIN_SEPARATOR",
            "description": "The OneSig contract manually hardcodes the version string \"0.0.1\" in the DOMAIN_SEPARATOR construction, despite already defining it as a constant (VERSION). This creates redundancy and increases the risk of version mismatches if the constant is updated but the hardcoded string is not. The cause is inconsistent use of defined constants. While this does not enable direct exploitation, it could lead to confusion during upgrades or audits, potentially resulting in incorrect assumptions about the contract's version. The impact is limited to maintainability and auditability.\n",
            "severity": "Informational",
            "location": [
                "OneSig.sol::DOMAIN_SEPARATOR"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Missing Docstrings",
            "description": "The LEAF_ENCODING_VERSION state variable in OneSig.sol lacks a docstring, and more broadly, several functions and parameters lack proper documentation. This is caused by incomplete or missing NatSpec comments. Without clear documentation, developers and auditors may misunderstand the intended behavior of critical functions, especially those handling sensitive operations. This could lead to incorrect integrations or missed vulnerabilities during review. The impact is reduced code clarity and increased risk of human error during maintenance or third-party interaction.\n",
            "severity": "Informational",
            "location": [
                "OneSig.sol::LEAF_ENCODING_VERSION"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Lack of Security Contact",
            "description": "The contracts do not include a designated security contact via NatSpec (e.g., @custom:security-contact). This omission makes it difficult for security researchers or external parties to responsibly disclose vulnerabilities. The cause is the absence of a standardized communication channel in the code. While not a direct security flaw, it increases the risk that critical issues go unreported or are delayed in reporting, potentially prolonging exposure if a vulnerability is discovered post-deployment. The impact is on incident response efficiency and overall security posture.\n",
            "severity": "Informational",
            "location": [],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Function Visibility Overly Permissive",
            "description": "Several functions, including getSigners in MultiSig.sol and setSeed and executeTransaction in OneSig.sol, are declared as public when they are only intended to be called externally. This overly permissive visibility could allow unnecessary internal calls, potentially increasing gas costs or enabling unintended interactions in derived contracts. The cause is suboptimal visibility settings. While the team acknowledged this is intentional to support inheritance, it deviates from best practices for gas efficiency and interface clarity. The impact is minor, primarily affecting gas optimization and code design.\n",
            "severity": "Informational",
            "location": [
                "MultiSig.sol::getSigners",
                "OneSig.sol::setSeed",
                "OneSig.sol::executeTransaction"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "Floating Pragma",
            "description": "Both MultiSig.sol and OneSig.sol use a floating pragma directive (^0.8.22), which allows compilation with any minor version of Solidity 0.8. This introduces risk because future compiler versions may introduce changes that alter the generated bytecode or introduce new behaviors, potentially leading to unexpected on-chain behavior. The cause is the use of a version range instead of a fixed version. This could result in inconsistent compilation across environments or hidden bugs due to compiler updates. The impact is reduced reproducibility and potential for compiler-related vulnerabilities.\n",
            "severity": "Informational",
            "location": [
                "MultiSig.sol",
                "OneSig.sol"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "Lack of Indexed Event Parameters",
            "description": "Multiple events, including SignerSet, ThresholdSet, SeedSet, and TransactionExecuted, do not have any indexed parameters. This makes it difficult for off-chain services to efficiently filter and query event data, increasing the cost and complexity of monitoring contract activity. The cause is the omission of the indexed keyword on relevant parameters. While this does not affect on-chain security, it hampers observability and integration with indexing services like The Graph. The impact is reduced usability and higher operational costs for external systems.\n",
            "severity": "Informational",
            "location": [
                "MultiSig.sol::SignerSet",
                "MultiSig.sol::ThresholdSet",
                "OneSig.sol::SeedSet",
                "OneSig.sol::TransactionExecuted"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {},
            "title": "verifyNSignatures Strictly Requires Exact Threshold Signatures",
            "description": "The verifyNSignatures function requires the number of signatures to be exactly equal to the threshold, rejecting any additional valid signatures. This inflexible design may cause transaction failures in practice when automated signers or tooling provide extra signatures. The cause is a strict equality check instead of a greater-than-or-equal comparison. This diverges from standard multisig patterns like Gnosis Safe and reduces compatibility with common tooling. While the team considers this non-critical, it increases the risk of operational failures and user frustration without improving security.\n",
            "severity": "Informational",
            "location": [
                "MultiSig.sol::verifyNSignatures#180"
            ],
            "files": []
        },
        {
            "id": 7,
            "category": {},
            "title": "EVM Version May Lead to Cross-Chain Deployment Issues",
            "description": "The project does not specify an evmVersion in its configuration, resulting in compilation with the default (likely 'cancun'), which includes newer opcodes like PUSH0 and MCOPY. These opcodes are not supported on all EVM-compatible chains, potentially causing deployment failures on older networks. The cause is the absence of explicit EVM version pinning. This limits cross-chain compatibility and could block deployment on certain L2s or sidechains. The impact is reduced deployability and potential for unexpected runtime errors on unsupported chains.\n",
            "severity": "Informational",
            "location": [],
            "files": []
        }
    ]
}