{
    "path": "dataset-curated/reports/Zellic/Orderly Strategy Vault - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://gitlab.com/orderlynetwork/orderly-v2/strategy-vault/contracts/",
            "https://gitlab.com/orderlynetwork/orderly-v2/evm-cross-chain/contracts/",
            "https://gitlab.com/orderlynetwork/orderly-v2/contract-evm/",
            "https://github.com/orderly/evm-cross-chain",
            "https://github.com/orderly/contract-evm",
            "https://github.com/orderly/strategy-vault"
        ],
        "commit_id": [
            "35aad3b4a76b4fbef6aced6d7dff572acf88bfd3",
            "7d71522351a74a0290fc7ac8ae49a4a7ce9554ec",
            "cad48d7644d52d355e5c690ae00e959fe8c6f927",
            null,
            null,
            null
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-02-19",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Misleading salt comment in the getDeployed function",
            "description": "The getDeployed function in VaultFactory.sol contains a comment stating that the function hashes the provided salt with the deployer's address to create a namespace per deployer. However, the actual implementation only hashes the salt parameter itself using keccak256(abi.encodePacked(salt)), without including msg.sender (the deployer's address). This discrepancy between the comment and the code constitutes a documentation flaw.\n\nThe root cause is a mismatch between the intended design (as implied by the comment) and the implemented logic. The function fails to incorporate the deployer's address into the salt calculation, which undermines the claimed namespace isolation.\n\nAn attacker or malicious deployer could potentially predict or collide with deployment addresses if they assume namespace isolation exists when it does not. While this does not directly enable fund theft or contract takeover, it may lead to unexpected behavior in systems relying on assumed deployer-specific namespaces.\n\nThe impact is limited to confusion and potential logic errors during integration or future development. It does not result in direct financial loss or critical system failure, but it may reduce the robustness of the deployment mechanism.\n",
            "severity": "Informational",
            "location": [
                "VaultFactory.sol::getDeployed#"
            ],
            "files": []
        }
    ]
}