{
    "path": "dataset-curated/reports/Zellic/Plaza - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Convexity-Research/plaza-evm"
        ],
        "commit_id": [
            "0af9dc82c03171cf9fcacc306b890211033e94dd"
        ],
        "address": [
            null
        ],
        "chain": "base",
        "compiler_version": "n/a",
        "audit_date": "2025-02-13",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Weights are calculated through total balances of tokens",
            "description": "The PreDeposit contract calculates token weights based solely on the ratio of deposited token amounts, without accounting for their actual market prices. This causes all tokens to be treated as having a 1:1 price ratio, which misaligns with Balancer V2's spot price calculation that depends on both weights and balances. The root cause is the failure to incorporate oracle-derived prices when computing weights. An attacker can exploit this by depositing a large amount of a low-value or zero-price token to manipulate the pool's initial pricing, creating significant arbitrage opportunities upon pool creation. Additionally, because Balancer V2 enforces a minimum weight of 1%, tokens contributing less than 1% of the total value cannot be included, preventing pool creation if any token falls below this threshold. This leads to incorrect token valuation, potential loss of user funds due to arbitrage, and reduced composability of the pool.\n",
            "severity": "Medium",
            "location": [
                "PreDeposit.sol::createPool#"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "The _checkCap function is missing a check",
            "description": "The _checkCap function in the PreDeposit contract fails to validate that the totalUserDepositValue is greater than zero before comparing it against the depositCap. The cause is the absence of a basic input validation check, which allows edge cases where token prices are zero (e.g., due to oracle failure or manipulation) to bypass intended deposit limits. An attacker could exploit this by depositing a massive amount of a token with a zero oracle price, which would not increment the totalUserDepositValue, thus evading the deposit cap. Subsequently, a small deposit of a valid-priced token would allow the pool creation to proceed, as the _snapshotCapValue would no longer be zero. The impact includes potential over-deposit beyond the intended cap, leading to economic imbalance and undermining the intended deposit limit safeguards, although the risk is mitigated by the low likelihood of sustained zero pricing.\n",
            "severity": "Low",
            "location": [
                "PreDeposit.sol::_checkCap#"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Missing length check",
            "description": "The _deposit and withdraw functions in the PreDeposit contract do not verify that the lengths of the tokens and amounts arrays are equal. This is a coding oversight that, while not directly exploitable for fund theft or denial of service, can lead to silent reverts when array lengths mismatch, degrading user experience and contract robustness. The root cause is the lack of defensive input validation. Although Solidity's for-loop using tokens.length will only iterate over the token array, if amounts has fewer elements, accessing amounts[i] will cause an out-of-bounds revert. Conversely, extra elements in amounts are ignored. This behavior, while safe, is inconsistent and could confuse integrators or front-end developers. The impact is minimal from a security standpoint, but it affects code quality and reliability, hence the informational severity.\n",
            "severity": "Informational",
            "location": [
                "PreDeposit.sol::_deposit#",
                "PreDeposit.sol::withdraw#"
            ],
            "files": []
        }
    ]
}