{
    "path": "dataset-curated/reports/Zellic/Rover Protocol - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Hydrogen-Labs/rover-contracts"
        ],
        "commit_id": [
            "e99a3171",
            "ea4d1488"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-06-04",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Reward distribution is unfair",
            "description": "1. **Description:** The vulnerability lies in the fee calculation mechanism within the withdraw function of the RovBTC contract. Fees are calculated using shares instead of the actual principal assets, which becomes inaccurate as the value per share increases over time due to staking rewards.\n2. **Cause:** The root cause is the incorrect use of shares in the _calculateRewardsFee function instead of tracking actual asset values. While initially 1 share equals 1 asset, this equivalence breaks as yield accumulates, leading to miscalculated fees.\n3. **Exploitation:** An attacker could exploit this by timing withdrawals when the share-to-asset ratio is high, either to pay disproportionately low fees or force other users to bear higher effective fees.\n4. **Impact:** Users may be unfairly charged higher fees than intended, leading to financial loss and an inequitable distribution of costs among users, undermining trust in the protocol's fairness.\n",
            "severity": "High",
            "location": [
                "RovBTC::withdraw#"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Reward tracking not updated for transfer",
            "description": "1. **Description:** The principalAssets mapping, introduced to fix a prior issue, is not updated when rovBTC tokens are transferred between users. This leads to a mismatch between the token holder and the recorded principal deposit.\n2. **Cause:** The oversight occurs because the _update function (or equivalent hook) is not overridden to synchronize the principalAssets state during token transfers, a common requirement in ERC-4626 vaults with per-user accounting.\n3. **Exploitation:** A malicious user could transfer tokens after accruing rewards but before withdrawing, effectively avoiding fee payments on the earned yield. The recipient would then be charged fees on profits they did not generate.\n4. **Impact:** This creates a financial imbalance where recipients of tokens pay disproportionately high fees on revenue they didn't earn, resulting in direct financial loss and a flawed accounting system.\n",
            "severity": "Medium",
            "location": [
                "RovBTC::principalAssets"
            ],
            "files": []
        }
    ]
}