{
    "path": "dataset-curated/reports/Zellic/SatLayer Pool (Patch) - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/satlayer/deposit-contract"
        ],
        "commit_id": [
            "74703945"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-01-14",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "ERC20Plugins token can lead to reentrancy issues",
            "description": "The vulnerability exists in the `withdraw` function of the SatlayerPoolV2 contract, which does not follow the checks-effects-interactions pattern. Specifically, the function performs an external call to `safeTransfer` before updating the state variables `withdrawAmounts` and `withdrawTimes`. This creates a potential reentrancy window if the token being withdrawn is a malicious ERC20Plugins-compatible token that can trigger a callback during transfer. An attacker could exploit this by reenter the contract and withdraw additional funds before the state is updated. Although the likelihood is low due to the assumption that only legitimate ERC-20 tokens will be used, the impact is high as it could lead to total draining of the pool. The root cause is the incorrect ordering of state updates relative to external calls.\n",
            "severity": "High",
            "location": [
                "SatlayerPool.sol::withdraw"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Tokens with callback support can inflate the actualAmount",
            "description": "The `depositFor` function in SatlayerPoolV2 uses balance difference checks to determine the actual amount of tokens transferred. However, if a token with callback support (e.g., ERC-777) is used, it can reenter the `depositFor` function during the transfer, manipulating the `balanceBefore` value. This allows an attacker to artificially inflate the recorded `actualAmount`, leading to incorrect accounting of staked tokens. For example, during a reentrant call, the balance before and after calculations become inconsistent, resulting in more tokens being credited than actually transferred. The root cause is the lack of reentrancy protection during a critical state calculation. The impact is high due to impaired accounting, though the likelihood is low if such tokens are not intended to be supported.\n",
            "severity": "High",
            "location": [
                "SatlayerPool.sol::depositFor"
            ],
            "files": []
        }
    ]
}