{
    "path": "dataset-curated/reports/Zellic/Solera - Zellic Audit Report (March).pdf",
    "project_info": {
        "url": [
            "https://github.com/SoleraMarkets/solera-contracts"
        ],
        "commit_id": [
            "7f2d916fc97e6af70e8da72dbd66097896035a4e"
        ],
        "address": [],
        "chain": "evm/plume",
        "compiler_version": "n/a",
        "audit_date": "2025-03-13",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Minimum Nest vault's nRWA mint may restrict user",
            "description": "1. **Description:** The Looping contract calls the deposit function on the nRWA token, which enforces a minimum mint percentage. If the asset-to-shares ratio is unexpectedly high, the deposit may revert due to insufficient shares being minted.\n2. **Cause:** The contract does not allow overriding the minimumMintPercentage check during deposit, which is enforced by the IAggregateToken implementation. This rigid requirement can prevent the Looping contract from operating under certain economic conditions.\n3. **Exploitation:** An attacker or adverse market condition could manipulate the asset-to-shares ratio (e.g., via oracle manipulation or extreme price movements) such that the minimum mint requirement is not met, causing the deposit to revert and blocking the leveraged looping flow.\n4. **Impact:** Users may be unable to execute looping strategies under certain market conditions, leading to degraded functionality and reduced usability of the protocol, though no direct fund loss occurs.\n",
            "severity": "Informational",
            "location": [
                "looping/Looping.sol",
                "helpers/WrappedTokenGatewayV3.sol::deposit#(function referenced)"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Lack of support for users who select an E-mode",
            "description": "1. **Description:** The _calculateBorrowAmount and _calculateBorrowAmountSingleAsset functions in the Looping contract use a fixed liquidation threshold from configuration, ignoring the user's selected E-mode category on Aave V3.\n2. **Cause:** The code does not query Aave's E-mode configuration for the user's chosen category, instead defaulting to a static threshold. This leads to incorrect borrowing power calculations when E-mode is active.\n3. **Exploitation:** A user who has selected an E-mode category optimized for their collateral may be denied a borrow or receive a suboptimal amount because the system does not account for the higher borrowing power granted by E-mode.\n4. **Impact:** Users are unable to fully utilize Aave's E-mode functionality, resulting in a suboptimal borrowing experience and potentially lower capital efficiency. This reduces the competitiveness and utility of the Solera platform.\n",
            "severity": "Informational",
            "location": [
                "looping/Looping.sol::_calculateBorrowAmount",
                "looping/Looping.sol::_calculateBorrowAmountSingleAsset"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Unnecessary approvals of zero tokens",
            "description": "1. **Description:** The Looping and WrappedTokenGatewayV3 contracts perform redundant zero-amount ERC20 approvals before setting the actual approval amount for tokens like USDC and WETH.\n2. **Cause:** The code pattern includes an explicit approval of 0 tokens before approving the desired amount, even though most ERC20 tokens (except USDT) do not require this step. The second approval overwrites the first, making the zero approval redundant.\n3. **Exploitation:** While not directly exploitable, this pattern increases gas costs for every transaction that includes such approvals, leading to higher user fees and reduced efficiency.\n4. **Impact:** Increased gas consumption across multiple functions in the protocol, resulting in higher operational costs for users. Although Solera noted USDT's requirement for zeroing approvals, the affected tokens (e.g., WPLUME, USDC, PUSD) do not have this restriction, making the zero approvals unnecessary.\n",
            "severity": "Informational",
            "location": [
                "looping/Looping.sol",
                "helpers/WrappedTokenGatewayV3.sol"
            ],
            "files": []
        }
    ]
}