{
    "path": "dataset-curated/reports/Zellic/Stable Predeposit - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/hourglass-foundation/stable-pre-deposit/"
        ],
        "commit_id": [
            "4b07ff620f27dd5e4796937fcdfd0437a3dc7d15"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-09-26",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "User funds stay locked when the bridge is not KYC-approved",
            "description": "The vulnerability arises because the HourglassStableVaultKYC contract's _setKycStatusWithAccounting function reverts when attempting to set KYC status for an account with zero shares. Since the LayerZero bridge contract starts with zero shares, calling batchSetKycStatus to approve it during the KYC phase will fail unless a share has been minted to it beforehand.\n\nThe root cause is the lack of special handling for critical infrastructure like the bridge contract, which must be KYC-approved to enable withdrawals but cannot receive approval unless it holds at least one share. This creates a dependency on an undocumented and easily missed step—minting a share to the bridge during the Deposit phase.\n\nAn attacker cannot directly exploit this vulnerability, but its existence enables a denial-of-service scenario where legitimate users are unable to withdraw their funds via the bridge during the Withdraw phase. Specifically, the redeemKyc function, which is called during bridge redemption, checks that the caller (the bridge) is KYC-approved. If the bridge was never approved due to the zero-share restriction, all redemption attempts revert.\n\nThe impact is that user funds become permanently locked until Recovery mode is activated after the 180-day timelock expires. This undermines the usability and trust in the system, as users expect a functional withdrawal path post-deposit. The issue is particularly severe because the requirement to mint a share to the bridge is neither documented nor obvious, making it highly likely to be overlooked during deployment.\n",
            "severity": "Medium",
            "location": [
                "HourglassStableVaultKYC.sol::batchSetKycStatus",
                "HourglassStableVaultKYC.sol::_setKycStatusWithAccounting#883-885",
                "HourglassStableVaultBridge.sol::_redeemSharesAndBridgeToStable",
                "HourglassStableVaultKYC.sol::redeemKyc#660-670"
            ],
            "files": []
        }
    ]
}