{
    "path": "dataset-curated/reports/OpenZeppelin/tGBP Audit.md",
    "project_info": {
        "url": [
            "https://github.com/bcp-markets/tGBPv2"
        ],
        "commit_id": [
            "6a91650c2c5c5037718ff1e78e5a7a84873fddda"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-11",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Banned Addresses Can Bypass Restrictions via Cross-Chain Transfers",
            "description": "The vulnerability allows banned addresses on the source chain to perform cross-chain token transfers by exploiting the fact that the `send` function from the `OFTUpgradeable` contract is not overridden in `StableTokenV1OFT`. \nThe root cause is the absence of the `notBanned` modifier on the `send` function, which is responsible for initiating cross-chain transfers. This omission means that while on-chain transfers are blocked for banned addresses, cross-chain transfers are not subject to the same restriction.\nAn attacker who is banned on the source chain could exploit this by calling the `send` function directly to transfer tokens to another chain, effectively bypassing the ban list enforcement.\nThe impact of this vulnerability is critical as it undermines the core compliance mechanism of the stablecoin, allowing sanctioned or malicious actors to move funds across chains despite being banned, potentially leading to regulatory violations and loss of trust in the system.\n",
            "severity": "Critical",
            "location": [
                "StableTokenV1OFT.sol::send"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Non-Compliance with ERC-7201 in `Bannable`",
            "description": "The `Bannable` contract defines a `banList` variable of type `EnumerableSet.AddressSet`, but since the contract is abstract and upgradeable, the storage layout is vulnerable to collisions during future upgrades due to inheritance order dependencies.\nThe root cause is the lack of namespaced storage; the `banList` variable is stored in a default storage slot that could conflict with variables from other inherited or future contracts, especially in an upgradeable context where storage layout must be preserved.\nWhile no direct exploitation vector exists at deployment time, a future upgrade could inadvertently overwrite the `banList` storage if another contract in the inheritance chain uses the same slot, leading to corruption of the ban list or other critical state.\nThe impact is considered low because it does not enable immediate fund loss or direct attack, but it poses a long-term risk to contract integrity and upgrade safety, potentially leading to denial of service or incorrect ban enforcement if storage collisions occur.\n",
            "severity": "Low",
            "location": [
                "Bannable.sol::banList"
            ],
            "files": []
        }
    ]
}