{
    "path": "dataset-curated/reports/OpenZeppelin/TokenOps Zama Confidential Airdrop Audit.md",
    "project_info": {
        "url": [
            "https://github.com/VestingLabs/tokenops-fhe-airdrop"
        ],
        "commit_id": [
            "275139f994bfd4d5269a93598112974b11dd3a6a"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-12-08",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "withdrawOtherConfidentialToken Function Can Leak fhEVM Allowance",
            "description": "The `withdrawOtherConfidentialToken` function in `ConfidentialAirdropCloneable.sol` uses `FHE.allowTransient` to authorize a confidential token transfer, but the encrypted balance is retrieved from the external token contract via `confidentialBalanceOf`. This creates a risk where a malicious confidential token contract could return a handle it should not have access to, and gain transient access to that handle through the `allowTransient` call. The root cause is the unnecessary use of `allowTransient` on a balance provided by an untrusted external contract. An attacker could exploit this by deploying a malicious ERC-7984-compliant token and tricking the admin into calling `withdrawOtherConfidentialToken`, thereby gaining access to encrypted data handles they should not possess. The impact includes potential leakage of confidential state in the fhEVM environment, undermining the privacy guarantees of the system.\n",
            "severity": "Medium",
            "location": [
                "ConfidentialAirdropCloneable.sol::withdrawOtherConfidentialToken#456"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Claim Time Can Be Extended After Airdrop End",
            "description": "The `extendClaimWindow` function allows the `DEFAULT_ADMIN_ROLE` to extend the claim window at any time, even after the airdrop has officially ended. This behavior is logically inconsistent and could confuse users who believe the airdrop has concluded. The root cause is the lack of a guardrail preventing extension of an already-expired claim window. A malicious or compromised admin could exploit this to reopen the airdrop long after its intended end, allowing unauthorized claims. The impact includes potential misuse of admin privileges to distribute tokens outside the expected timeframe, undermining the intended lifecycle of the airdrop and reducing user trust in the system's finality.\n",
            "severity": "Low",
            "location": [
                "ConfidentialAirdropCloneable.sol::extendClaimWindow#392"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "togglePause Function May Be Insecure",
            "description": "The `togglePause` function in `ConfidentialAirdropCloneable.sol` toggles the `isPaused` state without taking a boolean parameter, which can lead to race conditions when multiple admins hold the `DEFAULT_ADMIN_ROLE`. If two admins simultaneously detect an emergency and call `togglePause`, one call may re-enable the contract immediately after the other disables it. The root cause is the use of a toggle pattern instead of an explicit set-state function. This could be exploited in a high-stress scenario where coordination is difficult, leading to a failure to maintain the paused state during an emergency. The impact is a potential denial of effective emergency response, allowing claims to proceed when they should be halted.\n",
            "severity": "Low",
            "location": [
                "ConfidentialAirdropCloneable.sol::togglePause#383"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Duplicate and Similar Code",
            "description": "The `claim`, `getClaimAmount`, and `isSignatureValid` functions in `ConfidentialAirdropCloneable.sol` contain nearly identical logic for checking pause status, claim window validity, signature uniqueness, and admin role verification. This code duplication increases the risk of inconsistencies during future updates and reduces maintainability. The root cause is the lack of modularization of shared logic into internal helper functions. An attacker could potentially exploit subtle discrepancies introduced during manual updates to bypass validation logic. The impact is increased technical debt and a higher likelihood of introducing security bugs during maintenance or upgrades.\n",
            "severity": "Low",
            "location": [
                "ConfidentialAirdropCloneable.sol::claim#206",
                "ConfidentialAirdropCloneable.sol::getClaimAmount#266",
                "ConfidentialAirdropCloneable.sol::isSignatureValid#310"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "deploymentBlockNumber Variable Inconsistent on Arbitrum One Chain",
            "description": "The `deploymentBlockNumber` variable is set using `block.number` in the `initialize` function, but on Arbitrum One, `block.number` does not reflect the actual L2 block number. Instead, it reflects a value derived from the L1 Ethereum block number, which can cause confusion in off-chain analysis and monitoring. The root cause is the reliance on `block.number` without chain-specific handling. An attacker could potentially exploit this inconsistency to manipulate off-chain systems that depend on accurate block numbers for timing or verification. The impact is incorrect interpretation of deployment timing, which could affect monitoring, analytics, and security tooling.\n",
            "severity": "Low",
            "location": [
                "ConfidentialAirdropCloneable.sol::initialize#82"
            ],
            "files": []
        }
    ]
}