{
    "path": "dataset-curated/reports/Zenith/Zenith Audit Report - Gondi.pdf",
    "project_info": {
        "url": [
            "https://github.com/pixeldaogg/florida-contracts"
        ],
        "commit_id": [
            "758308774b92a8f9bdf64e13538abb3d11372734"
        ],
        "address": [],
        "chain": null,
        "compiler_version": "n/a",
        "audit_date": "2025-01-15",
        "project_path": "n/a"
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "executeSellWithETH will lock NFTs during batch transactions, risks of NFT theft",
            "description": "The vulnerability involves the `executeSellWithETH` function potentially locking NFTs during batch transactions, which could lead to permanent loss or theft of NFT collateral.\nThe root cause appears to be improper handling of NFT transfers or approvals during batch execution flows.\nAn attacker could potentially exploit this by initiating a malicious batch transaction that traps the NFT in an unrecoverable state.\nThe impact includes potential loss of user-owned NFTs, undermining trust and functionality of the protocol.\n",
            "severity": "High",
            "location": [
                "executeSellWithETH"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Buyer's address is not saved to transient storage in executeSell",
            "description": "The buyer's address is not properly stored in transient storage during the execution of the `executeSell` function.\nThis could stem from a missing assignment or storage operation in the critical execution path.\nIf transient data is required for post-execution validation or refund logic, this omission could be exploited to manipulate flow outcomes.\nThe impact may include incorrect state updates or potential fund misdirection due to missing identity tracking.\n",
            "severity": "High",
            "location": [
                "executeSell"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Incorrect router approval will DOS swap and sell flow",
            "description": "An incorrect approval setup for the router can lead to a denial-of-service (DOS) condition in the swap and sell functionality.\nThe cause is likely improper ERC20 token approval to the Uniswap router or a similar DEX router.\nAn attacker or user could trigger a transaction that fails permanently due to insufficient or misdirected approvals.\nThis would prevent legitimate users from completing swaps or sales, disrupting core protocol operations.\n",
            "severity": "High",
            "location": [
                "executeSell"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {},
            "title": "Buyer's remaining Weth will not be refunded",
            "description": "The function fails to refund excess WETH sent by the buyer during a transaction.\nThis is likely due to missing logic to calculate and transfer back the difference between sent and used amounts.\nA user could overpay and lose funds unnecessarily, which an attacker might exploit by inducing high-volume overpayments.\nThe impact is economic loss for users and reduced capital efficiency in the system.\n",
            "severity": "High",
            "location": [
                "executeSellWithETH"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {},
            "title": "ERC20 asset approval is not reset during executeSell",
            "description": "The contract does not reset ERC20 approvals after the `executeSell` function completes.\nThis leaves lingering approvals that could be exploited if the approved address is compromised later.\nAn attacker could reuse old approvals to drain user funds in subsequent operations.\nThe impact includes potential unauthorized token transfers and long-term security risks for users.\n",
            "severity": "Medium",
            "location": [
                "executeSell"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {},
            "title": "executeSellWithETH always reverts when the collateral NFT is wrapped punk sold in bundler",
            "description": "The `executeSellWithETH` function reverts when dealing with wrapped Punk NFTs within the bundler flow.\nThis suggests incompatibility in how Punk-specific logic is handled compared to standard ERC721 tokens.\nLegitimate transactions involving wrapped Punks would fail, disrupting intended functionality.\nThe impact is a denial of service for users holding Punk-based collateral, limiting protocol flexibility.\n",
            "severity": "Medium",
            "location": [
                "executeSellWithETH"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {},
            "title": "Invalid whitelisted currency check",
            "description": "The validation for whitelisted currencies is incorrectly implemented, potentially allowing unauthorized tokens to be used.\nThe cause may be a flawed condition or missing check in the currency verification logic.\nAn attacker could exploit this to use non-whitelisted tokens in sensitive operations like repayments or swaps.\nThe impact includes potential manipulation of value flows and introduction of low-value or malicious tokens.\n",
            "severity": "Low",
            "location": [
                "executeOperation"
            ],
            "files": []
        },
        {
            "id": 7,
            "category": {},
            "title": "Multiple flows have insufficient input validations",
            "description": "Several functions lack proper input validation, increasing the risk of unexpected behavior.\nThis could be due to missing checks on addresses, amounts, or encoded data parameters.\nAttackers might provide malformed or extreme inputs to trigger edge cases or bypass logic.\nThe impact ranges from transaction failures to potential state corruption or fund loss.\n",
            "severity": "Low",
            "location": [],
            "files": []
        },
        {
            "id": 8,
            "category": {},
            "title": "Incorrect order typehash",
            "description": "The order typehash used for EIP-712 signing is incorrectly defined, leading to potential signature malleability.\nThis could result from a mismatch between the Solidity `typeHash` and the frontend or off-chain expected hash.\nUsers might sign unintended orders, or valid signatures could be rejected.\nThe impact includes usability issues and potential for phishing or front-running attacks.\n",
            "severity": "Low",
            "location": [],
            "files": []
        }
    ]
}