{
    "path": "dataset-curated/reports/TrailofBits/2025-06-reserveprotocol-solidity400-securityreview.pdf",
    "project_info": {
        "url": [
            "https://github.com/reserve-protocol/reserve-index-dtf",
            "https://github.com/reserve-protocol/trusted-fillers"
        ],
        "commit_id": [
            "e82bfd60b391832640800f32bb41f735a0e1e56f",
            "20ec35af10212eefaa3963cefce7318231c20567"
        ],
        "address": [],
        "chain": "ethereum",
        "compiler_version": "n/a",
        "audit_date": "2025-06-17",
        "project_path": {
            "2025-06-reserveprotocol-solidity400-securityreview.pdf-source": "dataset-curated/contracts/2025-06-reserveprotocol-solidity400-securityreview.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Insufficient test coverage of new features",
            "description": "The code added to support trusted fillers and rebalancing in the reserve-index-dtf and trusted-fillers repositories lacks sufficient test coverage. Several new functions in the Folio and TrustedFillerRegistry contracts are not tested at all, and some functions in the CowSwapFiller contract are only partially tested. The root cause is inadequate testing methodology and insufficient test cases for critical functionality, such as nonce handling and rebalance lifecycle management. An attacker could exploit undetected bugs in untested code paths, potentially leading to incorrect state transitions or failed operations during rebalancing. The impact includes potential operational failures, loss of trust, and financial losses due to unhandled edge cases in production.\n",
            "severity": "Informational",
            "location": [
                "Folio.sol::stateChangeActive#213",
                "Folio.sol::setTrustedFillerRegistry#282",
                "Folio.sol::getRebalance#454",
                "Folio.sol::endRebalance#794",
                "TrustedFillerRegistry.sol::deprecateTrustedFiller#36",
                "TrustedFillerRegistry.sol::isAllowed#59",
                "CowSwapFiller.sol::swapActive#89",
                "CowSwapFiller.sol::rescueToken",
                "Folio.t.sol::isValidSignature#1359"
            ],
            "files": [
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/Folio.sol",
                "20ec35af10212eefaa3963cefce7318231c20567/trusted-fillers/contracts/TrustedFillerRegistry.sol",
                "20ec35af10212eefaa3963cefce7318231c20567/trusted-fillers/contracts/fillers/cowswap/CowSwapFiller.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "Functions can be called repeatedly, causing misleading events",
            "description": "Several event-emitting functions in the Folio contract—startRebalance, endRebalance, and closeAuction—can be called repeatedly without requiring intervening calls to their corresponding counterpart functions. This behavior can lead to off-chain systems receiving misleading or inconsistent event sequences, such as multiple RebalanceStarted events without a RebalanceEnded in between. The root cause is the lack of state checks to prevent redundant calls. An attacker or malicious actor could exploit this by spamming these functions, causing bots or monitoring systems that rely on predictable event patterns to malfunction. The impact includes incorrect behavior of off-chain automation tools, potentially leading to financial losses for users relying on such systems.\n",
            "severity": "Low",
            "location": [
                "Folio.sol::startRebalance#485",
                "Folio.sol::endRebalance#794",
                "Folio.sol::closeAuction#773",
                "AuctionLib.sol::openAuction#114"
            ],
            "files": [
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/Folio.sol",
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/utils/AuctionLib.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Order surplus extraction",
            "description": "The CowSwapFiller contract's isValidSignature function fails to validate the appData field in CoW Swap orders, which can contain partner fee information. This allows an attacker to manipulate the appData field to include arbitrarily high partner fees while keeping the signature valid. The root cause is improper data validation of a critical order parameter. During settlement, the CoW Protocol processes these inflated fees, redirecting surplus funds to the attacker’s address. The impact is the potential loss of order surplus, which would otherwise go to the user, resulting in financial loss for users whose orders are exploited.\n",
            "severity": "Low",
            "location": [
                "GPv2OrderLib.sol::appData#19"
            ],
            "files": [
                "20ec35af10212eefaa3963cefce7318231c20567/trusted-fillers/contracts/fillers/cowswap/CowSwapFiller.sol",
                "20ec35af10212eefaa3963cefce7318231c20567/trusted-fillers/contracts/fillers/cowswap/GPv2OrderLib.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "DAO can receive slightly lower fees than expected",
            "description": "The contract calculates the per-second fee floor from an annual percentage using a fixed-point approximation of 1/31536000 (ONE_OVER_YEAR), which introduces precision loss due to rounding down. Additionally, the calculation does not account for leap years, making the inaccuracy worse in those years. The root cause is the use of imprecise fixed-point arithmetic and the omission of leap year adjustments. While the deviation is small (e.g., 0.15% becomes ~0.14999990833183%), it results in the DAO receiving slightly lower fees than intended. The impact is a minor but systematic under-collection of fees, affecting revenue predictability and transparency.\n",
            "severity": "Informational",
            "location": [
                "Folio.sol::feeFloor#937"
            ],
            "files": [
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/Folio.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Denial of service allows blocking operations during Dutch auctions",
            "description": "A malicious actor can trigger a denial of service by creating a CowSwap filler at the beginning of a block and performing a minimal swap (e.g., 1 wei), causing the swapActive function to return true. This causes the sync modifier to revert, blocking all dependent functions. The root cause is the lack of a minimum threshold for swaps to be considered valid in the swapActive check. During Dutch auctions, where prices decrease over time, an attacker can exploit this to block other users' transactions and then bid at a lower price after the price drops. The impact is a temporary disruption of service and potential financial gain for the attacker at the expense of other users, undermining fair access to auctions.\n",
            "severity": "Medium",
            "location": [
                "CowSwapFiller.sol::swapActive#88-104"
            ],
            "files": [
                "20ec35af10212eefaa3963cefce7318231c20567/trusted-fillers/contracts/fillers/cowswap/CowSwapFiller.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Redundant Auction End Time Storage",
            "description": "The system maintains auction end times in two separate data structures: the `endTime` field within the Auction struct and the `auctionEnds` mapping in the Folio contract. This redundancy increases the risk of state inconsistency because both must be updated in sync across multiple functions, such as in `bid` and `closeAuction`. The root cause is poor data model design, leading to duplicated state. An attacker could potentially exploit a scenario where these values fall out of sync due to a logic error or incomplete update, leading to incorrect auction state transitions. The impact includes potential manipulation of auction timing, which could affect bid validity and fairness.\n",
            "severity": "Medium",
            "location": [
                "Folio.sol::closeAuction#773-789",
                "AuctionLib.sol::bid#179-235",
                "AuctionLib.sol#48-57"
            ],
            "files": [
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/Folio.sol",
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/utils/AuctionLib.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-834"
                ]
            },
            "title": "Unbounded Iteration in Folio Functions",
            "description": "Several externally callable functions in the Folio contract iterate over variable-sized data structures such as `basket.values` and `feeRecipients`, including `startRebalance`, `getRebalance`, `totalAssets`, `toAssets`, `mint`, `redeem`, and `distributeFees`. The cause is the use of loops over dynamic arrays without checks on their size. If the number of tokens or fee recipients grows sufficiently large, the gas cost of these functions could exceed the block gas limit, rendering them uncallable. An attacker could exploit this by inflating the size of these collections, leading to a denial of service for critical rebalancing and fee distribution operations. While the report estimates this would require an impractically large number of tokens (~2.75 million), the risk remains as the system scales.\n",
            "severity": "Medium",
            "location": [
                "Folio.sol::startRebalance",
                "Folio.sol::getRebalance",
                "Folio.sol::totalAssets",
                "Folio.sol::toAssets",
                "Folio.sol::mint",
                "Folio.sol::redeem",
                "Folio.sol::distributeFees",
                "Folio.sol::setFeeRecipients"
            ],
            "files": [
                "e82bfd60b391832640800f32bb41f735a0e1e56f/reserve-index-dtf/contracts/Folio.sol"
            ]
        }
    ]
}