{
    "path": "dataset-curated/reports/Sherlock/2025.05.03 - Final - Aegis.im YUSD Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Aegis-im/aegis-contracts"
        ],
        "commit_id": [
            "eaaf21ec7f3a9bf30a2aadd7118499b7bcf43681"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-28",
        "project_path": {
            "aegis-contracts": "dataset-curated/contracts/2025.05.03 - Final - Aegis.im YUSD Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Insolvency as YUSD will depeg overtime as the redemption fees are disbursed with no collaterals backing them.",
            "description": "1. **Description:** The protocol allows redemption of YUSD where the full collateral backing is sent to the user, but a fee is taken from the YUSD amount and burned, while the remaining YUSD is not backed by any collateral. This leads to an erosion of the collateral base over time, causing potential insolvency.\n2. **Cause:** The vulnerability arises because the redemption fee is taken from the YUSD amount without adjusting the collateral payout accordingly. The fee is not backed by any real collateral, yet it reduces the total YUSD supply without reducing the total collateral proportionally, leading to a negative yield for the protocol.\n3. **Exploitation:** As users continue to redeem YUSD, the accumulated fees (which are unbacked) increase, gradually depleting the effective collateral ratio. Over time, this causes the stablecoin to depeg due to loss of confidence in its backing.\n4. **Impact:** The protocol becomes insolvent as the collateral backing per YUSD decreases over time, leading to a collapse in the value of YUSD and loss of user funds.\n",
            "severity": "High",
            "location": [
                "AegisMinting.sol::approveRedeemRequest#(line numbers not specified)"
            ],
            "files": [
                "aegis-contracts/contracts/AegisMinting.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Collateral can get stuck in the minting contract under certain conditions or be accounted as profit",
            "description": "1. **Description:** Due to the untracked nature of collateral moved between the minting contract and custodial partners, collateral withdrawn for redemption can become stuck in the contract if the redemption request is rejected or canceled. Additionally, such stuck funds could be incorrectly treated as profit, leading to undercollateralized minting of YUSD.\n2. **Cause:** The system does not virtually account for funds that are pending redemption or income. The _untrackedAvailableAssetBalance function does not distinguish between funds intended for redemption and actual profit, creating ambiguity in fund usage.\n3. **Exploitation:** An attacker or regular user could trigger a redemption, cause it to fail post-withdrawal (e.g., via slippage, blacklisting, or expiration), leaving collateral stranded. Alternatively, an admin could intentionally classify stuck funds as profit and mint new YUSD without adding real collateral.\n4. **Impact:** Collateral remains locked in the contract and cannot be reused, harming the protocol's delta-neutral strategy. Worse, if these funds are declared as profit, undercollateralized YUSD is minted, accelerating de-pegging and risking insolvency.\n",
            "severity": "Medium",
            "location": [
                "AegisMinting.sol::_untrackedAvailableAssetBalance#(line numbers not specified)",
                "AegisMinting.sol::depositIncome#407-424"
            ],
            "files": [
                "aegis-contracts/contracts/AegisMinting.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ]
            },
            "title": "A whale adversary can grief the redeem functionality through redeem limit consumption",
            "description": "1. **Description:** The minting contract increments a global redemption limit when a redeem request is made but fails to decrement it when the request is withdrawn or rejected. This allows a malicious user to exhaust the redemption quota without consequence.\n2. **Cause:** The _checkMintRedeemLimit function increases the currentPeriodTotalAmount upon request, but no corresponding decrease occurs in withdrawRedeemRequest or _rejectRedeemRequest, creating a one-way accumulation of used limit.\n3. **Exploitation:** An attacker with sufficient YUSD can submit multiple redeem requests up to the period limit, blocking other users from redeeming. After the requests expire, the attacker withdraws their YUSD, leaving the limit still exhausted until the next period.\n4. **Impact:** Legitimate users are denied access to redemption functionality for the remainder of the period, resulting in a denial-of-service (DoS) that could lead to financial losses during critical market conditions.\n",
            "severity": "Medium",
            "location": [
                "AegisMinting.sol::_checkMintRedeemLimit#785-803",
                "AegisMinting.sol::withdrawRedeemRequest#373-390",
                "AegisMinting.sol::_rejectRedeemRequest#702-711"
            ],
            "files": [
                "aegis-contracts/contracts/AegisMinting.sol"
            ]
        }
    ]
}