{
    "path": "dataset-curated/reports/TrailofBits/2025-07-scroll-feynmanupgradesmartcontractchanges-securityreview.pdf",
    "project_info": {
        "url": [
            "https://github.com/scroll-tech/scroll-contracts"
        ],
        "commit_id": [
            "8e6a02b...00e2a89"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-07-10",
        "project_path": {
            "scroll-contracts": "dataset-curated/contracts/2025-07-scroll-feynmanupgradesmartcontractchanges-securityreview.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-862"
                ]
            },
            "title": "Old failed L1 to L2 messages can be executed by anyone on behalf of a user",
            "description": "This vulnerability allows any user to retry a failed L1 to L2 message originally sent by another user. The replayMessage function in the L1ScrollMessenger contract does not restrict who can trigger the replay, and there is no mechanism for a user to cancel a failed message. The root cause is the lack of access control and expiration mechanism for replayable messages. An attacker can monitor failed messages and replay them at a later time when conditions have changed (e.g., a previously paused contract is unpaused), leading to unexpected execution of old user intents. The impact includes potential confusion and financial loss for the original sender, who may believe the transaction was permanently failed, while also creating a user experience risk where users suspect wallet compromise.\n",
            "severity": "Informational",
            "location": [
                "src/L1/L1ScrollMessenger.sol::replayMessage#221-280"
            ],
            "files": [
                "scroll-contracts/src/L1/L1ScrollMessenger.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Malicious submissions to commitAndFinalizeBatch can break off-chain indexers",
            "description": "The commitAndFinalizeBatch function uses the OnlyTopLevelCall modifier to ensure that calls originate from externally owned accounts (EOAs) and not from smart contracts, in order to preserve correct parsing by off-chain indexers. However, the modifier is ineffective because it only checks for non-zero contract code length, which is absent during a constructor execution. As a result, a malicious actor can call the function from a contract constructor, where msg.sender has no code, bypassing the check. This allows malformed or unexpected call data to be submitted as top-level transactions, which can cause off-chain indexers to crash or misinterpret the data. The impact is a degradation or corruption of data used by external services relying on accurate batch commitment and finalization tracking, especially during enforced liveness mode when users can manually submit batches.\n",
            "severity": "Low",
            "location": [
                "src/L1/rollup/ScrollChain.sol::commitAndFinalizeBatch#396-400",
                "src/L1/rollup/ScrollChain.sol::OnlyTopLevelCall#199-203"
            ],
            "files": [
                "scroll-contracts/src/L1/rollup/ScrollChain.sol"
            ]
        }
    ]
}