{
    "path": "dataset-curated/reports/TrailofBits/2026-1-offchain-arbitrum-quorum-changes-securityreview.pdf",
    "project_info": {
        "url": [
            "https://github.com/ArbitrumFoundation/governance"
        ],
        "commit_id": [
            "74e32d4c2baf07918b3367eecb70c1f8786bb79a",
            "1ee03ed990a1b3c06e6b4e91503c4d245bb42a8f",
            "a2f690adb9df17f89a810273d3d83a798daca9fb"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-11-14",
        "project_path": {
            "governance": "dataset-curated/contracts/2026-1-offchain-arbitrum-quorum-changes-securityreview.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "adjustTotalDelegation allows the new value to be zero",
            "description": "The adjustTotalDelegation function in L2ArbitrumToken.sol allows the DAO to set the total delegation value to zero via an adjustment. This occurs because while the function checks that the new value is non-negative, it does not prevent it from being exactly zero. The root cause is the lack of an explicit validation check to ensure the new value is greater than zero. An attacker with ownership privileges could set the total delegation to zero, which would cause the quorum calculation to fall back to using getPastCirculatingSupply, potentially altering quorum expectations for existing proposals. However, since the function is protected by the onlyOwner modifier, only the DAO can invoke it, limiting the risk. The impact is limited to a change in quorum calculation logic, which could affect governance outcomes if misused, but does not lead to fund loss or direct exploitation by unauthorized actors.\n",
            "severity": "Informational",
            "location": [
                "governance/src/L2ArbitrumToken.sol::adjustTotalDelegation"
            ],
            "files": [
                "governance/src/L2ArbitrumToken.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-684"
                ],
                "3": [
                    "CWE-440"
                ]
            },
            "title": "L2ArbitrumGovernor does not align with the expected EIP-165 interface",
            "description": "The L2ArbitrumGovernor contract implements EIP-165 via the supportsInterface function but fails to properly reflect its full public interface. Specifically, after PR #365 introduced a new public function 'cancel', the supportsInterface function was not updated to return true for the corresponding interface ID. The root cause is a failure to maintain interface consistency when extending the contract's public API. This could mislead external systems or tooling that rely on EIP-165 to determine which functions are available, leading to incorrect assumptions about contract capabilities. While this does not directly enable malicious exploitation, it undermines the reliability of interface detection mechanisms. The impact is a potential mismatch between expected and actual contract behavior from the perspective of integrators or automated tools, reducing interoperability and security assurance.\n",
            "severity": "Informational",
            "location": [
                "governance/src/L2ArbitrumGovernor.sol::supportsInterface"
            ],
            "files": [
                "governance/src/L2ArbitrumGovernor.sol"
            ]
        }
    ]
}