{
    "path": "dataset-curated/reports/Ackee-Blockchain/ackee-blockchain-lido-triggerable-withdrawals-report.pdf",
    "project_info": {
        "url": [
            "https://github.com/lidofinance/core"
        ],
        "commit_id": [
            "628c8736d12478fc9e9a7dcba7dc2e7e6ebb8715"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-06-05",
        "project_path": {
            "core": "dataset-curated/contracts/ackee-blockchain-lido-triggerable-withdrawals-report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Inconsistent update of exit limits on config change",
            "description": "The ExitLimitUtils.setExitLimits function allows updating exit limits configuration parameters, but it does not correctly update the current exit limit (_data.prevExitRequestsLimit) when the maximum limit changes. \nThe root cause is a logic error in the update condition: the current limit is only reset when the new maximum is smaller than the current limit or when there was no prior limit, but it is not proportionally adjusted based on previously consumed exits. \nAn attacker or malicious actor could exploit this by manipulating the timing of limit changes to either accelerate or delay the availability of exit requests, potentially disrupting withdrawal scheduling. \nThe impact is low, as it does not lead to loss of funds or system failure, but it reduces the system's responsiveness and predictability when configuration changes are made.\n",
            "severity": "Low",
            "location": [
                "ExitLimitUtils.sol::setExitLimits#102-109"
            ],
            "files": [
                "core/contracts/0.8.9/lib/ExitLimitUtils.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ]
            },
            "title": "Inconsistent calculation of total requests processed",
            "description": "The system fails to consistently update the total number of processed exit requests when configuration parameters change, leading to a discrepancy between expected and actual state.\nThe cause is an incorrect handling of exit request counters during reconfiguration, where the system does not account for previously processed requests relative to the old limits.\nThis could be exploited by an observer to manipulate perception of system progress or to trigger edge cases in dependent components that rely on accurate request counts.\nThe impact is low, as it does not result in fund loss or critical failure, but it may affect operational accuracy and monitoring.\nSpecifically, the ValidatorsExitBusOracle contract maintains a variable to track the total number of processed triggerable withdrawal requests, but this variable is only updated during the Consensus path and not during the Easy Track path. This inconsistency arises because the counter update is missing in the Easy Track flow, specifically in the submitExitRequestsData function. As a result, when requests are processed via the Easy Track, the counter does not reflect the actual number of processed requests. An attacker or malicious actor is not required for exploitation; normal protocol usage can trigger the inconsistency. The impact is a misleading view of protocol activity for off-chain monitors and tooling relying on the counter, leading to inaccurate operational decisions and reduced transparency.\n",
            "severity": "Low",
            "location": [
                "ValidatorsExitBusOracle.sol::submitReportData#154",
                "ValidatorsExitBus.sol::submitExitRequestsData#251"
            ],
            "files": [
                "core/contracts/0.8.9/oracle/ValidatorsExitBusOracle.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-431"
                ]
            },
            "title": "Unimplemented function called",
            "description": "The contract calls a function that is declared but not implemented, which could lead to a revert or unexpected behavior when invoked.\nThe root cause is a missing implementation for a referenced interface function, likely due to incomplete integration or oversight during development.\nAn attacker could trigger this by calling the affected function path, leading to a failed transaction or disruption in expected workflow.\nThe impact is classified as Warning because the issue cannot be exploited under current configuration, but it poses a risk if the function is later implemented or called unintentionally.\nSpecifically, the StakingRouter.updateRefundedValidatorsCount function calls the NodeOperatorsRegistry.updateRefundedValidatorsCount function, which is not implemented in the target contract. This occurs because the NodeOperatorsRegistry contract fails to implement the IStakingModule interface method despite the external call expecting its existence. As a result, any call to updateRefundedValidatorsCount in StakingRouter will cause the transaction to revert. An attacker could potentially trigger such a call if they have the appropriate role, leading to a failed transaction and disruption in validator refund accounting. The impact is functional disruption in a critical staking management function, although it does not directly lead to fund loss.\n",
            "severity": "Informational",
            "location": [
                "StakingRouter.sol::updateRefundedValidatorsCount#373-381",
                "NodeOperatorsRegistry.sol"
            ],
            "files": [
                "core/contracts/0.8.9/StakingRouter.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-758"
                ]
            },
            "title": "Missing interface inheritance",
            "description": "Contracts in the codebase do not inherit from their corresponding interfaces, which can lead to ABI mismatches and potential integration issues.\nThis is a code quality and design issue where the implementation does not explicitly declare conformance to the interface, increasing the risk of function signature mismatches.\nWhile not directly exploitable, this could allow deployment of contracts with incorrect function selectors, especially in upgradeable systems.\nThe impact is Warning, as it does not pose an immediate security threat but could become critical if interface compatibility is assumed elsewhere.\nSpecifically, several contracts in the codebase do not inherit from their corresponding interfaces, including IStakingRouter, IWithdrawalVault, ITriggerableWithdrawalsGateway, IConsensusContract, IValidatorsExitBus, and IStakingModule. This omission is a code quality issue that reduces code clarity, complicates static analysis, and increases the risk of interface-contract mismatches. The root cause is architectural decisions that avoid inheritance for bytecode stability. While not directly exploitable, this practice can lead to runtime errors such as silent failures or reverts when external calls assume interface compliance. The impact is reduced code maintainability and increased risk of integration errors, especially in complex multi-contract systems.\n",
            "severity": "Informational",
            "location": [
                "**/*.sol"
            ],
            "files": [
                "core/contracts/0.8.25/interfaces/IStakingRouter.sol",
                "core/contracts/0.4.24/Lido.sol",
                "core/contracts/0.8.9/TriggerableWithdrawalsGateway.sol",
                "core/contracts/0.8.9/oracle/ValidatorsExitBus.sol",
                "core/contracts/0.8.9/oracle/BaseOracle.sol",
                "core/contracts/0.8.25/interfaces/IValidatorsExitBus.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Outdated IConsensusContract interface",
            "description": "The IConsensusContract interface used in the codebase is outdated and does not reflect the current specification or expected behavior.\nThis discrepancy may lead to incorrect assumptions about the consensus layer's functionality, especially in cross-contract interactions.\nIf the actual consensus contract evolves, the outdated interface could result in failed calls or misinterpretation of return data.\nThe impact is Warning, as it currently does not lead to exploitability but represents a technical debt and future compatibility risk.\nSpecifically, the IConsensusContract interface in BaseOracle.sol defines a getFrameConfig function that returns two values, but the actual implementation in HashConsensus returns three values, including an additional fastLaneLengthSlots parameter. This discrepancy causes the AccountingOracle._checkOracleMigration function to fail when calling getFrameConfig via the outdated interface. The cause is a lack of interface synchronization after implementation changes. An attacker cannot directly exploit this, but it can lead to failed oracle migrations or incorrect state assumptions during upgrades. The impact is potential disruption in oracle-related functionality and failure of critical migration checks, undermining system reliability.\n",
            "severity": "Informational",
            "location": [
                "BaseOracle.sol::getFrameConfig#28",
                "HashConsensus.sol::getFrameConfig#288-292",
                "AccountingOracle.sol::_checkOracleMigration#511-512"
            ],
            "files": [
                "core/contracts/0.8.9/oracle/BaseOracle.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-191"
                ]
            },
            "title": "_setExitDeadlineThreshold underflow",
            "description": "The _setExitDeadlineThreshold function is susceptible to an underflow condition if a very small or zero value is provided for the threshold parameter.\nThe cause is insufficient input validation or arithmetic safeguards when updating the deadline threshold, which could allow arithmetic underflow in dependent calculations.\nAn attacker could exploit this by setting an extremely low threshold, potentially causing arithmetic errors or reverting critical operations.\nThe impact is Warning, as the issue is not currently exploitable under normal configuration but could become a vulnerability if access controls are relaxed.\nSpecifically, the NodeOperatorsRegistry._setExitDeadlineThreshold function computes currentCutoffTimestamp as block.timestamp - _threshold - _lateReportingWindow but does not check for underflow. If the sum of _threshold and _lateReportingWindow exceeds block.timestamp, the result underflows, producing a large incorrect timestamp. Although the Packed64x4 library may revert on uint64 overflow, certain underflowed values may still fit within uint64 and be stored, corrupting the state. Once corrupted, the require condition prevents correction. The root cause is missing arithmetic safety checks. A privileged user with the ability to call this function could inadvertently or maliciously set an invalid timestamp, leading to permanent state corruption. The impact is loss of control over exit penalty timing, potentially freezing certain protocol functions.\n",
            "severity": "Informational",
            "location": [
                "NodeOperatorsRegistry.sol::_setExitDeadlineThreshold#1076-1082"
            ],
            "files": [
                "core/contracts/0.4.24/nos/NodeOperatorsRegistry.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Code optimizations",
            "description": "Several opportunities for code optimization were identified, including redundant checks and inefficient data handling.\nThese are primarily code quality issues that do not directly affect security but could improve gas efficiency and readability.\nWhile not exploitable, unoptimized code may increase attack surface or complicate future audits.\nThe impact is informational, as these findings are suggestions for improvement rather than security risks.\nSpecifically, multiple gas inefficiencies were identified in the codebase. In ValidatorExitDelayVerifier.verifyValidatorExitDelay, a redundant array access can be replaced with a direct variable reference. In ExitLimitUtils.updatePrevExitLimit, the computation of framesPassed and passedTime uses division and multiplication that can be optimized using modulo arithmetic to reduce gas consumption. The root cause is suboptimal arithmetic and memory access patterns. While not a security vulnerability per se, inefficient code increases transaction costs for all users. An attacker cannot exploit this directly, but the protocol incurs unnecessary operational expenses. The impact is higher gas fees and reduced economic efficiency, especially under heavy usage.\n",
            "severity": "Informational",
            "location": [
                "ExitLimitUtils.sol::updatePrevExitLimit#70-85",
                "ValidatorExitDelayVerifier.sol::verifyValidatorExitDelay#193"
            ],
            "files": [
                "core/contracts/0.8.9/lib/ExitLimitUtils.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ],
                "4": [
                    "CWE-778"
                ]
            },
            "title": "Lack of event emission",
            "description": "Certain critical state changes do not emit events, making it difficult for off-chain systems to track changes.\nThe absence of events reduces transparency and can hinder monitoring, indexing, and bot-based automation.\nThis could be exploited indirectly by obscuring malicious activity from detection systems.\nThe impact is informational, as it does not directly compromise security but affects observability.\nSpecifically, the ValidatorsExitBus._setMaxValidatorsPerReport function modifies the MAX_VALIDATORS_PER_REPORT_POSITION storage variable but does not emit an event to log this change. The absence of an event makes it difficult for off-chain services and monitoring tools to detect and react to configuration updates. The root cause is incomplete state change logging. While not directly exploitable, this omission reduces transparency and auditability. The impact is degraded observability, making it harder to track administrative actions and potentially delaying incident response.\n",
            "severity": "Informational",
            "location": [
                "ValidatorsExitBus.sol::_setMaxValidatorsPerReport#519-522"
            ],
            "files": [
                "core/contracts/0.8.9/oracle/ValidatorsExitBus.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ],
                "3": [
                    "CWE-1111"
                ]
            },
            "title": "Lack of context in deprecated function NatSpec",
            "description": "Deprecated functions contain incomplete or missing NatSpec documentation, reducing clarity for developers and auditors.\nThis is a documentation issue where the purpose and deprecation rationale are not clearly communicated.\nWhile not a direct security flaw, poor documentation can lead to misuse or incorrect assumptions.\nThe impact is informational, serving as a recommendation for better code maintenance.\nSpecifically, the deprecated updateTargetValidatorsLimits function in NodeOperatorsRegistry.sol lacks sufficient NatSpec documentation to explain the differences from its replacement. Specifically, it does not clarify that the new function uses a numeric _targetLimitMode parameter instead of a boolean _isTargetLimitActive, supporting additional operational modes. The root cause is incomplete documentation during refactoring. This can mislead developers into incorrect usage or assumptions about backward compatibility. The impact is increased risk of integration errors and confusion during maintenance, reducing code safety and developer experience.\n",
            "severity": "Informational",
            "location": [
                "NodeOperatorsRegistry.sol::updateTargetValidatorsLimits#589-595"
            ],
            "files": [
                "core/contracts/0.4.24/nos/NodeOperatorsRegistry.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused errors",
            "description": "The codebase defines custom errors that are not used anywhere in the contract system.\nThis increases bytecode size unnecessarily and may confuse developers during maintenance.\nAlthough not exploitable, unused artifacts contribute to technical debt and reduce code clarity.\nThe impact is informational, with no direct security consequences.\nSpecifically, the codebase contains several declared errors that are never used, including in ValidatorExitBusOracle.sol, OracleReportSanityChecker.sol, and TriggerableWithdrawalsGateway.sol. These unused errors increase contract size unnecessarily, leading to higher deployment costs and reduced code clarity. The root cause is failure to clean up legacy or unused code elements. While not exploitable, this represents poor code hygiene. The impact is increased gas costs for deployment and reduced readability, making audits and maintenance more difficult.\n",
            "severity": "Informational",
            "location": [
                "ValidatorExitBusOracle.sol",
                "OracleReportSanityChecker.sol",
                "TriggerableWithdrawalsGateway.sol"
            ],
            "files": [
                "core/contracts/0.8.9/oracle/ValidatorExitBusOracle.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused using-for directive",
            "description": "A 'using-for' directive is declared but not utilized in any function, leading to unnecessary code bloat.\nThis is a code hygiene issue that does not affect runtime behavior or security.\nThe impact is informational, as it represents a minor inefficiency without exploit potential.\nSpecifically, the ValidatorsExitBusOracle contract contains unused 'using-for' directives for ExitLimitUtilsStorage and ExitLimitUtils. These directives import library functions that are never invoked in the contract. The root cause is leftover code from prior development iterations. Unused directives contribute to bloat in the compiled bytecode, increasing deployment costs. The impact is unnecessary gas expenditure during deployment and reduced code clarity, though runtime behavior is unaffected.\n",
            "severity": "Informational",
            "location": [
                "ValidatorsExitBusOracle.sol"
            ],
            "files": [
                "core/contracts/0.8.9/oracle/ValidatorsExitBusOracle.sol"
            ]
        }
    ]
}