{
    "path": "dataset-curated/reports/Ackee-Blockchain/ackee-blockchain-everstake-eth2-batch-deposit-report.pdf",
    "project_info": {
        "url": [
            "https://github.com/everstake/eth2-batch-deposit-contract"
        ],
        "commit_id": [
            "c2c12ba"
        ],
        "address": [
            "0x4ff41fa0f4e77129c4c0607994050473c2067e6d"
        ],
        "chain": "evm/mainnet",
        "compiler_version": "n/a",
        "audit_date": "2025-11-11",
        "project_path": {
            "eth2-batch-deposit-contract": "dataset-curated/contracts/ackee-blockchain-everstake-eth2-batch-deposit-report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Limited deposit validation",
            "description": "The BatchDepositConsolidation contract lacks sufficient input validation for critical parameters. Specifically, it does not verify that the withdrawal address is not a zero address and does not validate the type of withdrawal. Additionally, it does not check whether the number of deposits in the batch is non-zero, which could allow empty transactions.\nThe root cause is the absence of proper input validation checks in the `batchDeposit` function. This omission increases the risk of accidental misconfiguration, which could lead to invalid validator deposits.\nAn attacker or user could exploit this by providing a zero address as the withdrawal credential, resulting in funds being deposited to an invalid or non-recoverable address. Similarly, submitting an empty batch could waste gas without meaningful effect.\nThe impact of this vulnerability is primarily on fund safety and operational correctness. Invalid deposits could result in irreversible loss of funds due to misconfigured withdrawal credentials. However, since no direct fund theft or system compromise is possible, the severity is classified as informational.\n",
            "severity": "Informational",
            "location": [
                "ETH2BatchDepositConsolidation.sol::batchDeposit#23"
            ],
            "files": [
                "eth2-batch-deposit-contract/contracts/ETH2BatchDepositConsolidation.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Missing cumulative deposit funds check",
            "description": "The `batchDeposit` function does not validate that the total ETH sent with the transaction (msg.value) matches the sum of all deposit values specified in the `values` array. This deviates from the expected behavior where the total ETH should exactly cover all deposits.\nThe root cause is the lack of a validation check comparing `msg.value` to the computed sum of `values`. The official ETH2 Deposit Contract only enforces loose bounds on the value, not exact matching, so this check must be enforced at the caller level.\nAn attacker could exploit this by sending less ETH than required, relying on the contract's existing balance to cover the shortfall, effectively stealing value from previous deposits. Alternatively, sending excess ETH would leave funds stranded in the contract with no withdrawal mechanism.\nThe impact includes potential loss of funds due to underpayment exploiting residual balances, transaction failures from underfunding, or permanent locking of excess funds. While no direct theft mechanism exists, the risk of fund loss justifies the finding, though it remains at Info severity due to the narrow exploit conditions.\n",
            "severity": "Informational",
            "location": [
                "ETH2BatchDepositConsolidation.sol::batchDeposit#41-61"
            ],
            "files": [
                "eth2-batch-deposit-contract/contracts/ETH2BatchDepositConsolidation.sol"
            ]
        }
    ]
}