{
    "path": "dataset-curated/reports/Ackee-Blockchain/ackee-blockchain-cow-flash-loan-router-report.pdf",
    "project_info": {
        "url": [
            "https://github.com/cowprotocol/flash-loan-router"
        ],
        "commit_id": [
            "930914fd8b73a9f9c6a628beada616110fb8ec35"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-03-17",
        "project_path": {
            "flash-loan-router": "dataset-curated/contracts/ackee-blockchain-cow-flash-loan-router-report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "W1: Missing events",
            "description": "1. **Description:** The FlashLoanRouter contract does not emit an event to track which solver initiated a settlement, resulting in loss of off-chain traceability. While the CoW Settlement contract emits a Settlement event, when invoked via FlashLoanRouter, the msg.sender becomes the router contract itself, obscuring the original solver identity.\n\n2. **Cause:** The absence of an explicit event emission in the FlashLoanRouter contract for settlements initiated through it. This design omits critical off-chain monitoring capabilities.\n\n3. **Exploitation:** This issue cannot be exploited maliciously, but it hampers the ability of off-chain services (e.g., analytics, monitoring, or indexing systems) to correctly attribute settlement actions to the original solver.\n\n4. **Impact:** The impact is limited to operational transparency and observability. Without proper event logging, it becomes difficult to debug, monitor, or attribute actions in the system, potentially affecting trust and auditability.\n",
            "severity": "Informational",
            "location": [
                "FlashLoanRouter.sol::flashLoanAndSettle"
            ],
            "files": [
                "flash-loan-router/src/FlashLoanRouter.sol"
            ]
        },
        {
            "id": 1,
            "category": {},
            "title": "I1: Documentation errors",
            "description": "1. **Description:** The Borrower.sol and LoansWithSettlement.sol contracts contain typographical and grammatical errors in their NatSpec comments, such as using \"An\" instead of \"A\" and \"fist\" instead of \"first\".\n\n2. **Cause:** Oversight during code documentation writing, likely due to lack of proofreading or automated linting for comments.\n\n3. **Exploitation:** These errors cannot be exploited in any way, as they do not affect runtime behavior or security logic.\n\n4. **Impact:** The impact is minimal, limited to reduced code readability and professionalism. However, clear documentation is important for maintainability and external developer understanding.\n",
            "severity": "Informational",
            "location": [
                "Borrower.sol",
                "LoansWithSettlement.sol"
            ],
            "files": [
                "flash-loan-router/src/mixin/Borrower.sol",
                "flash-loan-router/src/library/LoansWithSettlement.sol"
            ]
        },
        {
            "id": 2,
            "category": {},
            "title": "I2: Aave flash loan call optimization",
            "description": "1. **Description:** The AaveBorrower.sol contract uses the generic flashLoan function for single-asset flash loans, even though Aave provides a more gas-efficient flashLoanSimple function for such cases.\n\n2. **Cause:** Use of a more general-purpose Aave interface function when a specialized, cheaper alternative is available. This leads to unnecessary gas costs.\n\n3. **Exploitation:** An attacker cannot exploit this directly, but inefficient gas usage increases transaction costs for legitimate users and solvers.\n\n4. **Impact:** Increased gas consumption for flash loan operations, leading to higher operational costs. The client acknowledged the finding but chose to retain the current implementation to preserve eligibility for flash loan fee waiving.\n",
            "severity": "Informational",
            "location": [
                "AaveBorrower.sol::triggerFlashLoan#26-41"
            ],
            "files": [
                "flash-loan-router/src/AaveBorrower.sol"
            ]
        },
        {
            "id": 3,
            "category": {},
            "title": "I3: Missing view in interfaces",
            "description": "1. **Description:** Several functions in the ICowSettlement.sol and IFlashLoanRouter.sol interfaces are missing the view modifier, despite clearly not modifying state.\n\n2. **Cause:** Omission of the view keyword in interface declarations, which reduces compiler-level enforcement of immutability and prevents optimization via staticcall.\n\n3. **Exploitation:** This cannot be exploited maliciously, but it may lead to incorrect tooling assumptions or missed gas optimizations when calling these functions.\n\n4. **Impact:** Reduced code clarity, potential for incorrect usage in implementations, and missed optimization opportunities. The issue was fixed by adding the view modifier in the updated interfaces.\n",
            "severity": "Informational",
            "location": [
                "ICowSettlement.sol::authenticator",
                "IFlashLoanRouter.sol::settlementContract",
                "IFlashLoanRouter.sol::settlementAuthentication"
            ],
            "files": [
                "flash-loan-router/src/interface/ICowSettlement.sol",
                "flash-loan-router/src/interface/IFlashLoanRouter.sol"
            ]
        }
    ]
}