{
    "path": "dataset-curated/reports/OpenZeppelin/Across Linea CCTP Diff Audit.md",
    "project_info": {
        "url": [
            "https://github.com/across-protocol/contracts"
        ],
        "commit_id": [
            "0720878762ebf99034aa62893c091237ef44fdf7"
        ],
        "address": [],
        "chain": "evm/linea",
        "compiler_version": "n/a",
        "audit_date": "2025-03-13",
        "project_path": {
            "contracts": "dataset-curated/contracts/Across Linea CCTP Diff Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Check For CCTP Version Is Not Fully Reliable",
            "description": "The CircleCCTPAdapter contract uses a low-level call to the `feeRecipient` function of a CCTP TokenMessenger to determine whether CCTP V1 or V2 should be used, based on the presence and return value of this function. \nThe root cause of the vulnerability lies in the unreliable handling of the return data: the contract casts the 32-byte padded return value directly to `bytes20`, which only captures the first 20 bytes (including 12 bytes of padding), thus potentially truncating the actual address; it does not validate the size of the return data, making it susceptible to incorrect parsing if unexpected data length is returned; and it assumes that any non-zero 20-byte value implies a valid V2 contract, even though a malicious or misconfigured contract with a fallback function returning arbitrary data could spoof this check.\nAn attacker could potentially exploit this by deploying a contract that returns crafted data mimicking a valid `feeRecipient` response, leading the system to incorrectly assume CCTP V2 is available when it is not, or vice versa.\nThis could result in incorrect bridging logic being executed, potentially leading to failed transactions, user fund loss due to incorrect routing, or unexpected behavior in cross-chain transfers.\n",
            "severity": "Low",
            "location": [
                "CircleCCTPAdapter.sol::constructor#83-86"
            ],
            "files": [
                "contracts/contracts/libraries/CircleCCTPAdapter.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ]
            },
            "title": "Insufficient Documentation",
            "description": "The `_transferUsdc` function in the CircleCCTPAdapter contract performs critical operations for bridging USDC using either CCTP V1 or V2, including querying the TokenMinter address and checking burn limits. \nThe root cause is the lack of clear inline documentation indicating that the `cctpTokenMessenger` variable, typed as `ITokenMessenger` (V1), may point to a `TokenMessengerV2` contract, and that the returned `localMinter` could be either `ITokenMinter` or `ITokenMinterV2`, despite both exposing the required `burnLimitsPerMessage` function.\nWhile this does not introduce direct runtime vulnerabilities, the absence of explicit comments about version compatibility makes the code harder to understand, review, and maintain, increasing the risk of future bugs during upgrades or modifications by developers unfamiliar with the implicit assumptions.\nThe impact is primarily on code maintainability and auditability, potentially leading to integration errors or incorrect assumptions by future developers, which could indirectly result in security issues if changes are made without full understanding of the dual-version logic.\n",
            "severity": "Low",
            "location": [
                "CircleCCTPAdapter.sol::_transferUsdc#113"
            ],
            "files": [
                "contracts/contracts/libraries/CircleCCTPAdapter.sol"
            ]
        }
    ]
}