{
    "path": "dataset-curated/reports/Zellic/Berachain BEND v2 - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/berachain/contracts-metamorpho-v1.1"
        ],
        "commit_id": [
            "ff447631"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-09-08",
        "project_path": {
            "contracts-metamorpho-v1.1": "dataset-curated/contracts/Berachain BEND v2 - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Compromised MetaFeePartitioner owner could halt MetaMorphoV1_1 vaults",
            "description": "1. **Description:** The MetaMorphoV1_1 vault operations (deposit, mint, withdraw, redeem) and administrative functions (setFee, setFeeRecipient) all call _accrueInterest(), which in turn calls FEE_PARTITIONER.getShares() when feeShares is nonzero. Since FEE_PARTITIONER is an upgradable contract, a compromised owner could upgrade it to a malicious implementation that reverts on getShares(), thereby blocking all vault operations that require fee accrual.\n\n2. **Cause:** The vulnerability stems from the centralization risk inherent in the upgradable MetaFeePartitioner contract. The FEE_PARTITIONER address is set as immutable during deployment, creating a permanent dependency. Because the contract is upgradeable via UUPS, a single compromised owner key can introduce a malicious implementation.\n\n3. **Exploitation:** An attacker who gains control of the MetaFeePartitioner owner's private key could deploy a malicious upgrade where getShares() always reverts. This would cause _accrueInterest() to revert whenever feeShares != 0, effectively halting all critical vault functions in MetaMorphoV1_1.\n\n4. **Impact:** The impact is operational disruption — an attacker could freeze all MetaMorphoV1_1 vaults that have nonzero feeShares, preventing users from depositing, withdrawing, minting, or redeeming assets. While funds are not directly at risk of theft, the protocol's functionality would be severely degraded.\n",
            "severity": "Informational",
            "location": [
                "MetaMorphoV1_1.sol::_accrueInterest",
                "MetaFeePartitioner.sol::getShares"
            ],
            "files": [
                "contracts-metamorpho-v1.1/src/MetaMorphoV1_1.sol"
            ]
        }
    ]
}