{
    "path": "dataset-curated/reports/BlockSec/blocksec_raincoin_wrain_v1.0-signed.pdf",
    "project_info": {
        "url": [
            "https://github.com/werewolfe/wrain-vaul-t"
        ],
        "commit_id": [
            "9760db4bd5eaa32dd792e1cad616e81008e7daef"
        ],
        "address": [
            "0x9fcc429f37b175224ada40ede54977d828b1def0"
        ],
        "chain": "polygon",
        "compiler_version": "v0.8.24+commit.e11b9ed9",
        "audit_date": "2025-12-11",
        "project_path": {
            "WrappedRainVault": "dataset-curated/contracts/blocksec_raincoin_wrain_v1.0-signed.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {},
            "title": "Share value dilution due to incorrect ratio in function deposit()",
            "description": "1. **Description:** The deposit() function mints shares at a 1:1 ratio based on the after-tax amount of Rain Coin received, which causes dilution of existing shareholders' value. Since Rain Coin uses a reflection-tax mechanism, the actual amount received by the contract is less than the amount deposited, but shares are minted based on the received amount without accounting for accumulated reflections.\n2. **Cause:** The vulnerability arises from the incorrect assumption that a 1:1 minting ratio based on post-tax received assets preserves share value. This fails to account for the fact that earlier depositors' shares are diluted when new deposits are made after reflections have increased the total asset balance.\n3. **Exploitation:** An attacker (or any user) can repeatedly deposit assets after reflections have accrued, thereby minting new shares at a lower effective cost and diluting the share value of earlier depositors.\n4. **Impact:** Earlier depositors suffer a reduction in the value of their shares, leading to unfair distribution of rewards and potential loss of trust in the protocol.\n",
            "severity": "High",
            "location": [
                "WrappedRainVault.sol::deposit#157-179",
                "WrappedRainVault.sol::convertToShares#36-43"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {},
            "title": "Inconsistent logic between function previewWithdraw() and withdraw()",
            "description": "1. **Description:** The previewWithdraw() function returns a 1:1 share amount when totalSupply or totalAssets is zero, while the withdraw() function reverts under the same conditions due to insufficient assets. This creates a discrepancy between the expected and actual behavior.\n2. **Cause:** The inconsistency stems from differing logic paths in the two functions when handling edge cases involving empty vault states. previewWithdraw() assumes a 1:1 conversion, while withdraw() enforces asset availability.\n3. **Exploitation:** Front-end applications or integrators relying on previewWithdraw() for user interface calculations may display incorrect withdrawal estimates, leading to failed transactions or user confusion.\n4. **Impact:** The inconsistency disrupts the reliability of valuation logic used by external tools and can result in poor user experience or integration errors.\n",
            "severity": "Low",
            "location": [
                "WrappedRainVault.sol::previewWithdraw#94-109"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {},
            "title": "Inconsistency in asset conversion logic at empty vault state",
            "description": "1. **Description:** When totalAssets is zero, the convertToAssets() function returns shares directly instead of following the ERC4626 standard, which specifies returning zero in such cases. This deviation can lead to incorrect asset calculations.\n2. **Cause:** The implementation of convertToAssets() does not align with the ERC4626 standard's internal _convertToAssets() logic, which uses a formula involving totalAssets + 1 and totalSupply + offset to prevent division by zero and ensure correct rounding.\n3. **Exploitation:** External contracts or tools that depend on convertToAssets() for accurate asset estimation may miscalculate values when the vault is empty, potentially leading to incorrect financial decisions or failed transactions.\n4. **Impact:** The inconsistency may cause errors in external integrations, leading to incorrect behavior in DeFi platforms or wallets that rely on standard-compliant ERC4626 functionality.\n",
            "severity": "Low",
            "location": [
                "WrappedRainVault.sol::convertToAssets#126-127"
            ],
            "files": []
        }
    ]
}