{
    "path": "dataset-curated/reports/Cantina/cantina_managed_sky_lockstake_april2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/makerdao/lockstake"
        ],
        "commit_id": [
            "ccc1c16b60a5eb30b4c5836ac93d63a138f70f54"
        ],
        "address": [],
        "chain": "n/a",
        "compiler_version": "n/a",
        "audit_date": "2024-04-18",
        "project_path": {
            "lockstake": "dataset-curated/contracts/cantina_managed_sky_lockstake_april2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Missing fee check in the LSE",
            "description": "The LockstakeEngine contract sets the fee used in free operations as an immutable field in the constructor without validating it against WAD (10^18, the equivalent of 100%). In previous versions, a validation check ensured that the fee was less than WAD to prevent invalid configurations. The absence of this validation in the current version could allow deployment with an incorrect fee value, although it is set immutably and not dynamically adjustable. This does not pose an immediate exploit risk but reduces safety guarantees.\n",
            "severity": "Informational",
            "location": [
                "LockstakeEngine.sol#L131"
            ],
            "files": [
                "lockstake/src/LockstakeEngine.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Wrong README formatting",
            "description": "The README.md file has incorrect formatting in the \"Configurable Parameters\" section for StakingRewards, which is placed after the Migrator section. This leads to confusion for developers and users trying to understand the configuration flow and structure of the system. While this does not affect the code's functionality, it impacts readability and maintainability of documentation.\n",
            "severity": "Informational",
            "location": [
                "README.md"
            ],
            "files": [
                "lockstake/README.md"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-439"
                ]
            },
            "title": "Lockstake migration might bring users closer to liquidation",
            "description": "During the migration from the old LockstakeEngine (LSE) to the new version, users' CDPs are converted from MKR to SKY. The new LSE uses a different oracle (SKY) which may have different price feeds and configuration for mat (liquidation ratio). This change could result in migrated positions being closer to liquidation than before, introducing unexpected risk for users. The issue stems from a shift in oracle dependency and risk parameters without automatic adjustment of collateral ratios.\n",
            "severity": "Informational",
            "location": [
                "LockstakeMigrator.sol#L137"
            ],
            "files": [
                "lockstake/src/LockstakeMigrator.sol"
            ]
        }
    ]
}