{
    "path": "dataset-curated/reports/Cantina/cantina_seamless_april2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/seamless-protocol/leverage-tokens"
        ],
        "commit_id": [
            "4e5277684e5ce0313f33843d987b9a68b0972ed7"
        ],
        "address": null,
        "chain": "base",
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": {
            "leverage-tokens": "dataset-curated/contracts/cantina_seamless_april2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Incorrect rounding in _convertToShares for withdrawal-based actions leads to 1 dead share for users",
            "description": "1. **Description:** The _convertToShares function uses floor rounding in all cases, which causes a loss of one share for users during withdrawal-based actions due to incorrect rounding direction.\n2. **Cause:** The function does not adjust rounding based on the type of action (deposit vs. withdrawal), always applying Math.Rounding.Floor regardless of context.\n3. **Exploitation:** Users withdrawing funds will receive slightly fewer shares than they should due to the floor rounding, effectively losing a small amount of value per withdrawal.\n4. **Impact:** This leads to a systematic loss of user funds on every withdrawal, reducing the accuracy of share conversion and eroding user trust.\n",
            "severity": "Medium",
            "location": [
                "LeverageManager.sol::#L349-L362",
                "LeverageManager.sol::#L381",
                "LeverageManager.sol::#L419"
            ],
            "files": [
                "leverage-tokens/src/LeverageManager.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-1265"
                ]
            },
            "title": "Protect external facing LeverageManager functions from reentrancy",
            "description": "1. **Description:** Several external functions in the LeverageManager contract, such as deposit, withdraw, rebalance, and createNewLeverageToken, perform state changes and external calls without reentrancy protection.\n2. **Cause:** The absence of a nonReentrant modifier or similar guard allows potential reentrancy attacks, especially during rebalance operations where state can be manipulated mid-execution.\n3. **Exploitation:** An attacker could exploit reentrancy during rebalance to manipulate the state of a leveraged token, potentially putting it into an invalid state that bypasses validation checks.\n4. **Impact:** This could lead to temporary invalid states in leveraged tokens, disrupting system integrity and potentially enabling further exploits or fund loss.\n",
            "severity": "Medium",
            "location": [],
            "files": [
                "leverage-tokens/src/LeverageManager.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Remove configurability of DECIMALS_OFFSET parameter or account for offset in LeverageToken contract",
            "description": "1. **Description:** The DECIMALS_OFFSET parameter in LeverageManager is not properly accounted for in the LeverageToken contract's decimals() function, leading to potential inconsistencies in virtual share calculations.\n2. **Cause:** If DECIMALS_OFFSET is set to a non-zero value before deployment, the LeverageToken does not adjust its decimals accordingly, causing misalignment in share representation.\n3. **Exploitation:** An incorrect configuration could result in miscalculations of share values during deposits and withdrawals, especially when virtual shares are involved.\n4. **Impact:** This may lead to incorrect equity distribution among users and potential loss of funds due to inaccurate share conversions.\n",
            "severity": "Low",
            "location": [
                "LeverageManager.sol::#L65",
                "LeverageManager.sol::#L358",
                "LeverageToken.sol::#L20"
            ],
            "files": [
                "leverage-tokens/src/LeverageManager.sol",
                "leverage-tokens/src/LeverageToken.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Fractional collateral remainder from a rebalance could be pulled with lone removeCollateral action",
            "description": "1. **Description:** A fractional amount of collateral remaining after a rebalance can be withdrawn by a user calling removeCollateral without providing any input tokens.\n2. **Cause:** The rebalance logic does not fully account for small leftover collateral amounts, allowing them to be claimed by subsequent users via removeCollateral.\n3. **Exploitation:** A user can call removeCollateral with no inputs and still receive a small amount of leftover collateral from previous operations.\n4. **Impact:** This results in unintended transfer of value to opportunistic users, leading to loss of funds for the original stakeholders.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "leverage-tokens/src/LeverageManager.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Struct that is written to and accessed in storage could be optimized from 3 slots to 1",
            "description": "1. **Description:** The Auction struct in DataTypes.sol uses three storage slots due to inefficient packing of its fields, increasing gas costs for storage operations.\n2. **Cause:** The struct contains two uint256 timestamps and a bool, which are not tightly packed, resulting in suboptimal storage layout.\n3. **Exploitation:** This is not exploitable in a security sense but leads to higher gas consumption on every write and read operation involving the struct.\n4. **Impact:** Increased transaction costs for users interacting with functionality that uses the Auction struct, reducing efficiency and economic viability.\n",
            "severity": "Informational",
            "location": [
                "DataTypes.sol::#L38-L46"
            ],
            "files": [
                "leverage-tokens/src/types/DataTypes.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-862"
                ]
            },
            "title": "createNewLeverageToken is permissionless and accepts any adapters, including possibly malicious",
            "description": "1. **Description:** The createNewLeverageToken function allows anyone to create a new leverage token using any lending adapter, including untrusted or malicious ones.\n2. **Cause:** There is no whitelist or validation mechanism in place to restrict which adapters can be used during token creation.\n3. **Exploitation:** An attacker could deploy a malicious adapter and trick users into interacting with a leverage token that uses it, leading to theft of funds.\n4. **Impact:** Users may unknowingly interact with unsafe contracts, resulting in loss of funds and reduced trust in the platform.\n",
            "severity": "Informational",
            "location": [
                "LeverageManager.sol::#L162",
                "LeverageManager.sol::#L176-L179"
            ],
            "files": [
                "leverage-tokens/src/LeverageManager.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-345"
                ],
                "3": [
                    "CWE-1293"
                ]
            },
            "title": "MorphoLendingAdapter is susceptible to oracle collusion or manipulation",
            "description": "1. **Description:** The MorphoLendingAdapter relies on external oracle data for critical pricing decisions, making it vulnerable to oracle manipulation or collusion attacks.\n2. **Cause:** The adapter uses price feeds from Morpho, which may be influenced by coordinated attacks or inaccurate data sources.\n3. **Exploitation:** Attackers could manipulate the oracle to report false prices, leading to incorrect valuation of collateral and debt during rebalancing or liquidation.\n4. **Impact:** This could result in unfair liquidations, incorrect leverage adjustments, or loss of user funds due to mispriced assets.\n",
            "severity": "Informational",
            "location": [
                "MorphoLendingAdapter.sol::#L104-L121"
            ],
            "files": [
                "leverage-tokens/src/lending/MorphoLendingAdapter.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ]
            },
            "title": "Rebalancers must correctly specify tokensOut when rebalancing or lose tokens to others",
            "description": "1. **Description:** Rebalancers must provide exact values for the tokensOut parameter during rebalancing; otherwise, excess tokens may be left in the contract or the transaction may revert.\n2. **Cause:** The LeverageManager does not automatically transfer all resulting token balances after rebalancing, relying instead on precise user input.\n3. **Exploitation:** If a rebalancer underestimates tokensOut, leftover tokens remain in the contract and could be drained by others; if overestimated, the transaction reverts.\n4. **Impact:** This creates operational risk for rebalancers and potential loss of funds due to incorrect parameter specification.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "leverage-tokens/src/LeverageManager.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-1265"
                ]
            },
            "title": "General notes on morpho markets integration",
            "description": "1. **Description:** The integration with Morpho markets introduces risks related to re-entrancy and on-chain pricing mechanisms, particularly because leverage tokens use convertToShares/assets functions that can be influenced during callbacks.\n2. **Cause:** The leverage manager is not re-entrancy safe and may be called in the context of Morpho callbacks, potentially allowing manipulation of price() values through read-only re-entrancy.\n3. **Exploitation:** An attacker could manipulate the execution context during a callback to influence pricing calculations, leading to incorrect valuations.\n4. **Impact:** This could result in incorrect pricing of assets within leverage tokens, affecting rebalancing accuracy and potentially leading to financial loss.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "leverage-tokens/src/LeverageManager.sol",
                "leverage-tokens/src/lending/MorphoLendingAdapter.sol"
            ]
        }
    ]
}