{
    "path": "dataset-curated/reports/Cantina/cantina_fastlane_april2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/FastLane-Labs/atlas"
        ],
        "commit_id": [
            "1ef75ad"
        ],
        "address": [
            null
        ],
        "chain": "n/a",
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": {
            "atlas": "dataset-curated/contracts/cantina_fastlane_april2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-345"
                ],
                "3": [
                    "CWE-649"
                ]
            },
            "title": "Solvers may receive less gas than they expect",
            "description": "1. **Description:** In Atlas v1.6, the gas limit forwarded to solvers is set to the minimum of solverOp.gas and dConfig.solverGasLimit. This change introduces a risk where solvers may receive less gas than expected if dConfig.solverGasLimit is lowered after the solver signs the operation.\n2. **Cause:** The userOp hash does not include dConfig.solverGasLimit, so changes to this value after signing are not reflected in the solver's expectations.\n3. **Exploitation:** A malicious DAppControl could intentionally lower dConfig.solverGasLimit after a solver has signed, causing the solver to receive less gas than required for execution.\n4. **Impact:** Solvers may fail to execute their operations due to insufficient gas, leading to financial loss or operational disruption.\n",
            "severity": "Medium",
            "location": [
                "Escrow.sol#L367-L368"
            ],
            "files": [
                "atlas/src/contracts/atlas/Escrow.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Net repayments can be counted across multiple solverOps",
            "description": "1. **Description:** The _isBalanceReconciled() function in GasAccounting.sol incorrectly considers a solverOp's balance as reconciled when multipleSuccessfulSolvers == true, because it does not track how much of the net repayment has already been used by previous solverOps.\n2. **Cause:** The logic allows the same net repayment to be reused across multiple solverOps, as it does not deduct used repayments from a shared pool.\n3. **Exploitation:** An attacker could construct multiple solverOps that each claim the same net repayment, falsely satisfying the reconciliation check.\n4. **Impact:** This can result in a gas reimbursement shortfall during the final settle() call, forcing the bundler to cover the difference, potentially leading to financial loss.\n",
            "severity": "Medium",
            "location": [
                "GasAccounting.sol#L605"
            ],
            "files": [
                "atlas/src/contracts/atlas/GasAccounting.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "solverGasLiability() overestimated when multipleSuccessfulSolvers == true",
            "description": "1. **Description:** The solverGasLiability() function overestimates the gas liability for solvers when multipleSuccessfulSolvers == true, as it assumes each solver must pay for all calldata rather than just their own.\n2. **Cause:** The function's logic was designed before the multipleSuccessfulSolvers feature and does not account for shared calldata costs in that mode.\n3. **Exploitation:** While not directly exploitable for gain, this overestimation leads to inefficient gas accounting and higher prepayment requirements than necessary.\n4. **Impact:** Solvers may be required to prepay more gas than needed, reducing capital efficiency and increasing operational costs.\n",
            "severity": "Low",
            "location": [
                "GasAccLib.sol#L71-L82"
            ],
            "files": [
                "atlas/src/contracts/libraries/GasAccLib.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-190"
                ]
            },
            "title": "Unsafe typecasts",
            "description": "1. **Description:** Several variables are downcasted from uint256 to uint40 without overflow checks, which could result in silent truncation if the value exceeds the range of uint40.\n2. **Cause:** Direct typecasting without using SafeCast or similar safeguards.\n3. **Exploitation:** If a value exceeds 2^40 - 1, it will wrap around, potentially leading to incorrect state or miscalculations.\n4. **Impact:** Could result in incorrect gas accounting, reward calculations, or other state inconsistencies, depending on the context of the cast.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "atlas/src/contracts/atlas/GasAccounting.sol",
                "atlas/src/contracts/atlas/Escrow.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ]
            },
            "title": "Use OZ Math.min()",
            "description": "1. **Description:** The code uses ternary operators to compute the minimum of two values in multiple locations, such as in Atlas.sol and GasAccounting.sol.\n2. **Cause:** Manual implementation instead of using OpenZeppelin's Math.min(), which is more gas-efficient and readable.\n3. **Exploitation:** Not exploitable for security breaches, but represents a missed optimization.\n4. **Impact:** Slightly higher gas costs during execution and reduced code readability.\n",
            "severity": "Informational",
            "location": [
                "Atlas.sol#L295-L296",
                "GasAccounting.sol#L300"
            ],
            "files": [
                "atlas/src/contracts/atlas/Atlas.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused surcharge mask constants",
            "description": "1. **Description:** The constants _ATLAS_SURCHARGE_MASK and _BUNDLER_SURCHARGE_MASK in AtlasConstants.sol are defined but not used anywhere in the codebase.\n2. **Cause:** These constants were likely left over from earlier versions or unused features.\n3. **Exploitation:** No direct exploit, but increases code bloat and confusion.\n4. **Impact:** Unnecessary complexity and potential confusion for developers reading the code.\n",
            "severity": "Informational",
            "location": [
                "AtlasConstants.sol#L49-L52"
            ],
            "files": [
                "atlas/src/contracts/types/AtlasConstants.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Incorrect comments in _verifyCallConfig()",
            "description": "1. **Description:** The comments in _verifyCallConfig() incorrectly reference invertsBidValue when describing disallowed configurations involving multipleSuccessfulSolvers, while the actual code correctly enforces the restrictions.\n2. **Cause:** Outdated or inaccurate inline documentation.\n3. **Exploitation:** Could mislead developers into thinking the logic involves invertsBidValue, potentially leading to incorrect modifications.\n4. **Impact:** Risk of future bugs due to misunderstanding of the code logic based on incorrect comments.\n",
            "severity": "Informational",
            "location": [
                "AtlasVerification.sol#L285-L296"
            ],
            "files": [
                "atlas/src/contracts/atlas/AtlasVerification.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Analytics consider all solvers as failed when multipleSuccessfulSolvers == true",
            "description": "1. **Description:** When multipleSuccessfulSolvers is true, the system treats all solverOps as failed in analytics by calling _handleSolverFailAccounting() regardless of success, leading to inaccurate monitoring and reporting.\n2. **Cause:** The accounting logic does not differentiate between success and failure in this mode.\n3. **Exploitation:** Not a security exploit, but results in loss of visibility into actual solver performance.\n4. **Impact:** Inaccurate analytics and operational insights, potentially affecting decision-making and system monitoring.\n",
            "severity": "Informational",
            "location": [
                "GasAccounting.sol#L328"
            ],
            "files": [
                "atlas/src/contracts/atlas/GasAccounting.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ],
                "3": [
                    "CWE-1111"
                ]
            },
            "title": "Missing Natspec",
            "description": "1. **Description:** The _settle() function has a new argument multipleSuccessfulSolvers that lacks Natspec documentation.\n2. **Cause:** Omission during code updates.\n3. **Exploitation:** Could lead to misuse or misunderstanding of the function's parameters by external developers or auditors.\n4. **Impact:** Reduced code clarity and maintainability, increasing the risk of integration errors.\n",
            "severity": "Informational",
            "location": [
                "GasAccounting.sol#L439-L449"
            ],
            "files": [
                "atlas/src/contracts/atlas/GasAccounting.sol"
            ]
        }
    ]
}