{
    "path": "dataset-curated/reports/Cantina/cantina_coinbase_zora_creator_coin_sep2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/ourzora/zora-protocol"
        ],
        "commit_id": [
            "ae9424ab"
        ],
        "address": [],
        "chain": "evm/base",
        "compiler_version": "n/a",
        "audit_date": "2025-10-21",
        "project_path": {
            "zora-protocol": "dataset-curated/contracts/cantina_coinbase_zora_creator_coin_sep2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-459"
                ]
            },
            "title": "Stale poolKey mapping in ZoraV4CoinHook after hook migration may cause unexpected behavior",
            "description": "The ZoraV4CoinHook contract's migrateLiquidity function allows migration of liquidity from an old hook to a new one but fails to remove the old pool key from the poolCoins mapping after migration. This causes stale state to persist, where the old pool key remains associated with its coin and positions. The root cause is the omission of cleanup logic in the migration function. An attacker or user could potentially interact with the stale liquidity, leading to unexpected behavior such as incorrect reward distribution or state inconsistencies. The impact is considered low as it does not directly lead to fund loss but may cause operational issues and inconsistencies in the system.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "zora-protocol/packages/coins/src/hooks/ZoraV4CoinHook.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Missing checks allow migration to unregistered hooks",
            "description": "The migrateLiquidity function in ZoraV4CoinHook checks for a registered upgrade path via HookUpgradeGate.isRegisteredUpgradePath but does not verify that the new hook is registered in ZoraHookRegistry via isRegisteredHook. This allows migration to unregistered hooks if their upgrade path remains registered, which could happen if the protocol unregisters a hook but forgets to remove its upgrade path. The root cause is the lack of validation on the new hook's registration status. An attacker or user could exploit this by migrating liquidity to an unregistered hook, potentially leading to loss of funds or unexpected behavior if the hook is malicious or deprecated. The impact is low as the registry is considered informational, but it introduces unnecessary risk.\n",
            "severity": "Low",
            "location": [
                "ZoraHookRegistry.sol#L34-L36",
                "ZoraHookRegistry.sol#L71-L92",
                "ZoraV4CoinHook.sol#L183-L185",
                "ZoraV4CoinHook.sol#L373-L376"
            ],
            "files": [
                "zora-protocol/packages/coins/src/hooks/ZoraV4CoinHook.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Creator coin vesting duration is 1.25 days less than expected",
            "description": "The CREATOR_VESTING_DURATION constant in CreatorCoinConstants is set to 5 * 365 days, which assumes a year has exactly 365 days and ignores leap years. The actual vesting period should account for leap years, as there is one every four years on average. The root cause is the use of an imprecise time calculation. This leads to the vesting period being 1.25 days shorter than the intended 5-year duration. While no direct exploitation is possible, the impact is a minor discrepancy in the vesting schedule, which could affect creator token claims and user expectations. The severity is low as the deviation is small and does not compromise security.\n",
            "severity": "Low",
            "location": [
                "CreatorCoin.sol#L65-L66",
                "CreatorCoinConstants.sol#L13"
            ],
            "files": [
                "zora-protocol/packages/coins/src/libs/CreatorCoinConstants.sol",
                "zora-protocol/packages/coins/src/CreatorCoin.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ],
                "3": [
                    "CWE-248"
                ]
            },
            "title": "Swaps with native ETH will fail if one of the reward recipients cannot receive native ETH",
            "description": "The _afterSwap function in ZoraV4CoinHook calls CoinRewardsV4.distributeMarketRewards, which reverts if a reward transfer in native ETH fails due to a recipient being unable to receive ETH (e.g., a contract without a payable fallback). The root cause is the lack of error handling for ETH transfers. This could cause all swaps involving native ETH to fail if any of the five reward recipients (payoutRecipient, platformReferrer, protocolRewardRecipient, doppler, tradeReferrer) cannot accept ETH. While unlikely under normal conditions, a misconfiguration or malicious setup could brick swaps. The impact is low due to the unlikelihood of such a scenario, but it could disrupt functionality. The issue was later fixed by introducing a backup recipient.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "zora-protocol/packages/coins/src/hooks/ZoraV4CoinHook.sol",
                "zora-protocol/packages/coins/src/libs/CoinRewardsV4.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1041"
                ]
            },
            "title": "Duplicated and inconsistent constants across CoinConstants and MarketConstants",
            "description": "Constants such as POOL_LAUNCH_SUPPLY and CONTENT_COIN_MARKET_SUPPLY are duplicated across multiple libraries (CoinConstants, MarketConstants, CreatorCoinConstants), increasing the risk of inconsistency if one is updated and others are not. The root cause is poor code organization and lack of a single source of truth. This could lead to mismatches in token supply calculations or allocation logic during upgrades. The impact is informational, as it does not directly lead to exploits but reduces code maintainability and increases the likelihood of future bugs. The issue was partially fixed by consolidating constants, but dynamic relationships were not addressed.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "zora-protocol/packages/coins/src/libs/CoinConstants.sol",
                "zora-protocol/packages/coins/src/libs/MarketConstants.sol",
                "zora-protocol/packages/coins/src/libs/CreatorCoinConstants.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ]
            },
            "title": "Restrictive ETH receive function in ZoraV4CoinHook",
            "description": "The receive() function in ZoraV4CoinHook is restricted to onlyPoolManager, preventing direct ETH deposits from unauthorized addresses. However, this does not prevent ETH from being forcibly sent via self-destruct or protocol rewards, potentially leaving ETH stuck in the contract. The root cause is the absence of a withdrawal mechanism for recovered funds. While the restriction reduces risk, it does not eliminate the possibility of ETH accumulation. The impact is informational, as there is no direct exploit, but it represents a potential loss of funds if ETH becomes trapped. No fix was implemented as the team considers it acceptable risk.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "zora-protocol/packages/coins/src/hooks/ZoraV4CoinHook.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Missing _disableInitializers() in ZoraHookRegistry",
            "description": "The ZoraHookRegistry contract uses an initializer but does not call _disableInitializers() in its constructor, which could allow re-initialization attacks on the implementation contract. The root cause is a missing security best practice for upgradeable contracts. However, the client clarified that the contract is not upgradeable and the initializer is meant to be called once. Despite this, the absence of _disableInitializers() is a common anti-pattern. The impact is informational, as the risk is mitigated by deployment constraints. A comment was added to clarify the deployment flow instead of modifying the code.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "zora-protocol/packages/coins/src/hook-registry/ZoraHookRegistry.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Misleading documentation on ContentCoin backing currency",
            "description": "The documentation states that ContentCoin uses creator coins as backing currency, but the contract logic allows any currency (e.g., ETH, other tokens). The root cause is outdated or incorrect documentation. This discrepancy can mislead developers and integrators into making incorrect assumptions about protocol behavior. The impact is informational, as it does not introduce a security flaw but can lead to integration errors or confusion. The issue was fixed by updating the documentation to reflect the actual functionality.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "zora-protocol/packages/coins/src/ContentCoin.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Using the same version across different contracts is misleading",
            "description": "Multiple contracts (BaseCoin, ZoraV4CoinHook, ZoraFactoryImpl) inherit ContractVersionBase and return the same version (e.g., 2.2.0), even if only one is updated. The root cause is a centralized versioning system based on the npm package version. This can be misleading when tracking individual contract changes, as version increments may not reflect actual code changes. The impact is informational, affecting traceability and clarity. The team acknowledged the issue but chose not to fix it, as the current system works for their deployment model.\n",
            "severity": "Informational",
            "location": [
                "ZoraHookRegistry.sol#L64-L68",
                "ZoraV4CoinHook.sol#L159-L161",
                "ContractVersionBase.sol#L9-L14",
                "ZoraFactoryImpl.sol#L116"
            ],
            "files": [
                "zora-protocol/packages/coins/src/BaseCoin.sol",
                "zora-protocol/packages/coins/src/hooks/ZoraV4CoinHook.sol",
                "zora-protocol/packages/coins/src/ZoraFactoryImpl.sol",
                "zora-protocol/packages/coins/src/hook-registry/ZoraHookRegistry.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ],
                "3": [
                    "CWE-561"
                ]
            },
            "title": "ReentrancyGuardUpgradeable is not required for BaseCoin",
            "description": "BaseCoin inherits ReentrancyGuardUpgradeable, but none of its functions use the nonReentrant modifier. The root cause is likely legacy code or unnecessary inheritance. This adds contract bloat and reduces readability without providing any security benefit. The impact is informational, as it does not introduce a vulnerability but represents code quality issues. The issue was fixed by removing the unnecessary inheritance, improving code clarity and reducing size.\n",
            "severity": "Informational",
            "location": [
                "BaseCoin.sol#L57"
            ],
            "files": [
                "zora-protocol/packages/coins/src/BaseCoin.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ]
            },
            "title": "Using initializer modifier on constructor is non-standard",
            "description": "BaseCoin uses the initializer modifier on its constructor to prevent re-initialization, which is a non-standard pattern compared to calling _disableInitializers() in the constructor. The root cause is a deviation from common upgradeable contract patterns. While functionally equivalent in this context, it may confuse auditors or developers familiar with standard practices. The impact is informational, affecting code readability and maintainability. The team acknowledged the feedback but chose not to change it, as it achieves the intended security goal.\n",
            "severity": "Informational",
            "location": [
                "BaseCoin.sol#L97"
            ],
            "files": [
                "zora-protocol/packages/coins/src/BaseCoin.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Stale/Incorrect/Missing comments reduce readability",
            "description": "Several comments in the codebase are stale, incorrect, or missing, reducing code readability and maintainability. Examples include outdated @notice tags, misleading @dev comments, and missing @param documentation. The root cause is lack of comment maintenance during development. This can lead to misunderstandings about function behavior or contract logic. The impact is informational, as it does not directly affect security but increases the risk of future bugs or misconfigurations. The issue was fixed by updating the relevant comments.\n",
            "severity": "Informational",
            "location": [
                "ContentCoin.sol#L17-L21",
                "CreatorCoin.sol#L77-L80",
                "ZoraV4CoinHook.sol#L170-L185",
                "ZoraV4CoinHook.sol#L346-L349",
                "CoinRewardsV4.sol#L178-L190"
            ],
            "files": [
                "zora-protocol/packages/coins/src/ContentCoin.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "Forced downcasting is risky",
            "description": "The convertDeltaToPositiveUint128 function in CoinRewardsV4.sol performs a forced downcast from int256 to uint128 without bounds checking beyond ensuring the value is non-negative. The root cause is the use of unsafe casting practices. While large delta values are unlikely, this could lead to truncation and unexpected behavior in edge cases. The impact is informational, as the risk is low but represents a deviation from safe casting best practices. The issue was fixed by implementing proper bounds checking or safe casting.\n",
            "severity": "Informational",
            "location": [
                "CoinRewardsV4.sol#L89-L94"
            ],
            "files": [
                "zora-protocol/packages/coins/src/libs/CoinRewardsV4.sol"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Creator coins do not support postDeployHook functionality",
            "description": "Unlike ContentCoin, CreatorCoin does not support postDeployHook functionality, which is used to trigger actions like initial token purchases immediately after deployment. The root cause is a lack of feature parity between contract types. This limits functionality and consistency in the protocol. The impact is informational, as it does not introduce a security issue but represents a missed opportunity for feature alignment. The issue was fixed by adding postDeployHook support to CreatorCoin.\n",
            "severity": "Informational",
            "location": [
                "ZoraFactoryImpl.sol#L76-L120",
                "ZoraFactoryImpl.sol#L123-L137",
                "ZoraFactoryImpl.sol#L165-L169"
            ],
            "files": [
                "zora-protocol/packages/coins/src/ZoraFactoryImpl.sol"
            ]
        }
    ]
}