{
    "path": "dataset-curated/reports/Cantina/cantina_honeyjar_february2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/0xHoneyJar/LST"
        ],
        "commit_id": [
            "941db283c7e758abec33822b94372c36e6ddd9e8"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": {
            "LST": "dataset-curated/contracts/cantina_honeyjar_february2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Admin can lock funds",
            "description": "1. **Description:** The admin (or reward notifier) can set reward parameters in a way that effectively locks user funds by misconfiguring the reward system, particularly in the notifyRewardAmount function.\n2. **Cause:** The function lacks validation checks to ensure the reward token is not the zero address or the contract itself, which could lead to incorrect reward distribution or locking of funds.\n3. **Exploitation:** An attacker with admin privileges could set a malicious reward token address, preventing proper reward distribution and effectively locking user funds by disrupting the expected functionality.\n4. **Impact:** Users may be unable to claim their rightful rewards, leading to loss of trust and potential financial loss if the system becomes unusable.\n",
            "severity": "Medium",
            "location": [
                "fatBERA.sol#L206",
                "fatBERA.sol#L252"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-437"
                ]
            },
            "title": "Deposits and Mints to Whitelisted Vaults Result in Lost Rewards",
            "description": "1. **Description:** Depositing or minting directly to a whitelisted vault results in lost rewards because such vaults are treated as having zero effective balance.\n2. **Cause:** The contract does not prevent deposits or mints to whitelisted vaults, which bypass the reward tracking mechanism since these vaults do not accumulate shares in the expected way.\n3. **Exploitation:** A user could deposit funds into a whitelisted vault, causing their shares to be recorded without proper reward synchronization, leading to permanent loss of accrued rewards.\n4. **Impact:** Users lose out on expected rewards, undermining the incentive model of the protocol and potentially leading to financial loss.\n",
            "severity": "Medium",
            "location": [
                "fatBERA.sol#L323-L343",
                "fatBERA.sol#L352-L359",
                "fatBERA.sol#L368-L376"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ]
            },
            "title": "Whitelisted Vaults Not Receiving Accumulated Rewards",
            "description": "1. **Description:** When a vault is added to the whitelist after having been active, it does not receive rewards that accrued while it was not whitelisted.\n2. **Cause:** The setWhitelistedVault function does not update rewards before changing the vault's status, so any potential rewards during the non-whitelisted period are lost.\n3. **Exploitation:** An attacker could delay whitelisting a vault they control to manipulate reward accrual timing, or users may simply lose out due to the missing update.\n4. **Impact:** Loss of expected rewards for vault operators, reducing fairness and economic integrity of the system.\n",
            "severity": "Medium",
            "location": [
                "fatBERA.sol#L262-L264"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Misleading Values on Preview Functions When Withdrawals Are Disabled",
            "description": "1. **Description:** The previewWithdraw and previewRedeem functions return non-zero values even though withdrawals are disabled by maxWithdraw and maxRedeem returning 0.\n2. **Cause:** The preview functions are not overridden to reflect the disabled state, leading to inconsistent behavior.\n3. **Exploitation:** A user or frontend interface may rely on preview functions to determine if withdrawals are possible, leading to failed transactions and poor user experience.\n4. **Impact:** User confusion, failed transactions, and potential loss of trust in the system due to misleading interface behavior.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-362"
                ]
            },
            "title": "setMaxDeposits Can Be Front-Run and Prevent Proper Deposit Management",
            "description": "1. **Description:** The setMaxDeposits function can be front-run by users who deposit just before the admin's transaction, causing the new maxDeposits value to be less than the current depositPrincipal and reverting the admin's transaction.\n2. **Cause:** The function allows newMax to be set equal to depositPrincipal without accounting for potential frontrunning, making it vulnerable to race conditions.\n3. **Exploitation:** An attacker can monitor mempool for admin transactions and submit a deposit to push depositPrincipal above the intended newMax, causing the admin's transaction to fail.\n4. **Impact:** The admin may be unable to adjust deposit caps effectively, disrupting deposit management and potentially leaving the system exposed to uncontrolled deposits.\n",
            "severity": "Low",
            "location": [
                "fatBERA.sol#L179-L182"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ],
                "3": [
                    "CWE-826"
                ]
            },
            "title": "Principal Withdrawal Can Cause Underflow and Withdrawal Failures",
            "description": "1. **Description:** The withdrawPrincipal function allows the admin to withdraw principal assets, which can reduce depositPrincipal to a level where future withdrawals fail due to insufficient balance.\n2. **Cause:** The function does not ensure that the contract retains enough balance to cover future user withdrawals after principal is withdrawn.\n3. **Exploitation:** An admin could withdraw too much principal, causing subsequent user withdrawal attempts to fail when the contract lacks sufficient funds to transfer.\n4. **Impact:** Users may be unable to withdraw their funds, leading to loss of funds and trust in the protocol.\n",
            "severity": "Low",
            "location": [
                "fatBERA.sol#L190-L196"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "_updateReward calculation could lead to reward inflation allowing a user to steal rewards",
            "description": "1. **Description:** The _updateReward function calculates additional rewards using totalSupply, but if totalSupply is less than 1e18, the reward per share becomes inflated due to division by a very small number.\n2. **Cause:** The calculation assumes a minimum totalSupply of 1e18, but no such guarantee is enforced, leading to arithmetic inflation when supply is low.\n3. **Exploitation:** A user controlling a large portion of a very small total supply could trigger reward distribution and receive disproportionately high rewards.\n4. **Impact:** Reward inflation could allow a malicious actor to steal a significant portion of the reward pool, diluting other users' rewards and compromising economic fairness.\n",
            "severity": "Low",
            "location": [
                "fatBERA.sol#L562-L566",
                "fatBERA.sol#L545-L548"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1041"
                ]
            },
            "title": "claimRewards(address) contains duplicate code and could be simplified",
            "description": "1. **Description:** The claimRewards(address) function duplicates logic already present in claimRewards(address,address), increasing code size and gas costs.\n2. **Cause:** Redundant implementation instead of reusing the more specific public function.\n3. **Exploitation:** While not directly exploitable, this increases deployment and execution costs unnecessarily.\n4. **Impact:** Higher gas consumption for users, reduced code maintainability, and increased risk of bugs due to duplicated logic.\n",
            "severity": "Informational",
            "location": [
                "fatBERA.sol#L384-L409"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Inconsistent errors",
            "description": "1. **Description:** The contract uses string-based revert messages in some places (require(..., \"error\")) instead of custom errors, leading to inconsistent error handling.\n2. **Cause:** Mixed use of Solidity error patterns without standardization across the codebase.\n3. **Exploitation:** Not directly exploitable, but increases bytecode size and reduces readability and gas efficiency.\n4. **Impact:** Higher gas costs and reduced code clarity, making integration and debugging harder for external developers.\n",
            "severity": "Informational",
            "location": [
                "fatBERA.sol#L223",
                "fatBERA.sol#L251-L252"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Unnecessary storage reads in _lastTimeRewardApplicable",
            "description": "1. **Description:** The _lastTimeRewardApplicable function reads rewardData[token] from storage even though it is already read in the calling function _updateReward.\n2. **Cause:** Redundant storage access due to poor function design and lack of parameter passing.\n3. **Exploitation:** Not exploitable, but increases gas cost unnecessarily.\n4. **Impact:** Increased gas consumption for reward calculations, affecting all users interacting with reward functions.\n",
            "severity": "Informational",
            "location": [
                "fatBERA.sol#L558-L575"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-571"
                ]
            },
            "title": "Unnecessary amount checks",
            "description": "1. **Description:** The contract includes checks for amount > 0 on uint256 parameters, which is redundant since unsigned integers cannot be negative.\n2. **Cause:** Over-cautious validation that does not account for Solidity type semantics.\n3. **Exploitation:** No security risk, but wastes gas on unnecessary checks.\n4. **Impact:** Increased gas costs for transactions involving these functions, reducing efficiency.\n",
            "severity": "Informational",
            "location": [
                "fatBERA.sol#L191",
                "fatBERA.sol#L205"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-269"
                ],
                "3": [
                    "CWE-266"
                ]
            },
            "title": "Separation of Pause and Unpause Permissions",
            "description": "1. **Description:** Both pause and unpause functions require DEFAULT_ADMIN_ROLE, which does not follow the principle of least privilege for emergency response.\n2. **Cause:** Lack of role separation between pausing (emergency action) and unpausing (recovery action).\n3. **Exploitation:** In an emergency, if the admin key is not immediately available, the system cannot be paused quickly, increasing risk.\n4. **Impact:** Slower response to security incidents, reduced operational security, and potential for greater damage during attacks.\n",
            "severity": "Informational",
            "location": [
                "fatBERA.sol#L134-L144"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-703"
                ]
            },
            "title": "Implemented, but not ready functions",
            "description": "1. **Description:** Functions like withdraw and redeem are implemented but disabled by setting maxWithdraw to 0, indicating they are not yet ready for use.\n2. **Cause:** Incomplete feature rollout without proper function disabling (e.g., using revert or noop).\n3. **Exploitation:** Users may attempt to call these functions, expecting them to work, only to have transactions fail unexpectedly.\n4. **Impact:** Poor user experience, potential confusion, and possible integration issues with frontends or other contracts.\n",
            "severity": "Informational",
            "location": [
                "fatBERA.sol#L411-L452"
            ],
            "files": [
                "LST/src/fatBERA.sol"
            ]
        }
    ]
}