{
    "path": "dataset-curated/reports/Cantina/cantina_charm_june2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/charmfinance/alpha-contracts-v2.1"
        ],
        "commit_id": [
            "4932841d"
        ],
        "address": null,
        "chain": "n/a",
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": {
            "alpha-contracts-v2.1": "dataset-curated/contracts/cantina_charm_june2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Insufficient factory check during vault creation",
            "description": "1. **Description:** When creating a new vault in AlphaProVaultFactory, the contract checks for a field but does not verify that the provided Uniswap V3 pool address is valid for the given token pair and fee.\n2. **Cause:** The factory does not perform a lookup or validation to confirm that the provided pool address corresponds to the correct (token0, token1, fee) triplet.\n3. **Exploitation:** An attacker could provide a fake or incorrect pool address during vault creation, leading to integration with a malicious or non-functional pool.\n4. **Impact:** This could result in loss of funds or inability to operate the vault correctly due to interaction with an invalid Uniswap V3 pool.\n",
            "severity": "Medium",
            "location": [
                "AlphaProVaultFactory.sol#L46-L47"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVaultFactory.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Fee rounding consistency in getPositionAmounts",
            "description": "1. **Description:** The function getPositionAmounts in AlphaProVault.sol uses a rounding method that differs from the one used in _burnAndCollect, leading to inconsistencies in fee calculations.\n2. **Cause:** The rounding logic for computing pending fees is not standardized across functions, relying on different formulas.\n3. **Exploitation:** While not directly exploitable for large gains, this inconsistency could lead to minor miscalculations in user shares or fee distributions during deposit and withdrawal operations.\n4. **Impact:** Users may receive slightly inaccurate amounts of tokens or shares, undermining fairness and precision in the protocol's financial calculations.\n",
            "severity": "Low",
            "location": [
                "AlphaProVault.sol#L589-L590"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Protocol fee could be fetched from factory after rebalance",
            "description": "1. **Description:** The AlphaProVault contract maintains its own protocol fee setting, while the factory also has a setter for future vaults. This creates redundancy and potential inconsistency.\n2. **Cause:** The vault does not fetch the protocol fee from the factory at critical points such as after a rebalance.\n3. **Exploitation:** A discrepancy between the factory's intended fee and the vault's stored fee could be exploited if not synchronized, especially after governance updates.\n4. **Impact:** This could lead to incorrect fee collection, either under-collecting or over-collecting fees, affecting revenue distribution and user trust.\n",
            "severity": "Low",
            "location": [
                "AlphaProVault.sol#L688-L693"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-863"
                ]
            },
            "title": "Manager can allow himself to rebalance unrestricted",
            "description": "1. **Description:** The checkCanRebalance function includes rate-limiting logic, but the manager can potentially bypass these restrictions.\n2. **Cause:** The access control mechanism does not sufficiently restrict the manager from manipulating rebalance conditions.\n3. **Exploitation:** A malicious or compromised manager could trigger rebalances more frequently than allowed, potentially to exploit price movements or execute sandwich attacks.\n4. **Impact:** This could lead to unfair advantages for the manager, increased gas costs for users, or manipulation of the vault’s position for personal gain.\n",
            "severity": "Low",
            "location": [
                "AlphaProVault.sol#L740-L743"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Vault can be drained if baseThreshold is equal to wideThreshold",
            "description": "1. **Description:** If baseThreshold equals wideThreshold, the assumption that wide and base positions are independent breaks down, leading to incorrect liquidity calculations.\n2. **Cause:** The code does not prevent or handle the case where baseThreshold == wideThreshold, which disrupts the expected behavior of deposit, rebalance, and withdraw functions.\n3. **Exploitation:** An attacker could set these thresholds to be equal, causing an imbalance in liquidity withdrawal—e.g., withdrawing 75% of liquidity when only 50% is intended.\n4. **Impact:** This could allow an attacker to drain the vault by withdrawing more liquidity than their share entitles them to, resulting in significant loss of funds.\n",
            "severity": "Low",
            "location": [
                "AlphaProVault.sol#L312-L314",
                "AlphaProVault.sol#L231-L239",
                "AlphaProVault.sol#L361-L371"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Rounding error during direct deposit may Dos deposits",
            "description": "1. **Description:** During direct deposit, rounding up of amounts in _calcAmountsAndShares can cause the pulled amounts to exceed the desired amounts by a few wei.\n2. **Cause:** The amounts are rounded up three times in sequence, leading to a final value that slightly exceeds amount0Desired or amount1Desired.\n3. **Exploitation:** This could cause the deposit transaction to revert if the user does not have sufficient balance to cover the overage, effectively blocking deposits.\n4. **Impact:** Users may be unable to deposit funds due to minor rounding errors, leading to a denial-of-service condition for deposit functionality.\n",
            "severity": "Low",
            "location": [
                "AlphaProVault.sol#L228-L239"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "ERC777 tokens will enable caller to self sandwich mint to extract part of deposit",
            "description": "1. **Description:** If one of the tokens in the pool is an ERC777 token, the _callTokensToSend hook can be exploited by the caller to manipulate the Uniswap V3 pool price before minting liquidity.\n2. **Cause:** The integration does not account for the callback behavior of ERC777, which allows the sender to execute code during token transfer.\n3. **Exploitation:** A user depositing an ERC777 token can trigger a price manipulation via the hook, then mint liquidity at the manipulated price, extracting value from other LPs.\n4. **Impact:** This could lead to value extraction from the vault, harming other liquidity providers and undermining the fairness of the system.\n",
            "severity": "Low",
            "location": [
                "AlphaProVault.sol#L227-L229"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ]
            },
            "title": "Storage variables can be immutable",
            "description": "1. **Description:** Several variables in AlphaProVault are set during initialization and never changed, yet they are stored in mutable storage.\n2. **Cause:** These variables are not declared as immutable, leading to higher gas costs on every read.\n3. **Exploitation:** Not directly exploitable, but represents inefficient code design.\n4. **Impact:** Increased gas consumption for all users interacting with the contract, leading to higher transaction costs.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L99-L102"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Storage variables can be packed",
            "description": "1. **Description:** Multiple storage variables in AlphaProVault are declared separately but can be packed into fewer slots.\n2. **Cause:** Variables like accruedProtocolFees0/1 and accruedManagerFees0/1 are not packed, wasting storage space.\n3. **Exploitation:** Not exploitable, but inefficient.\n4. **Impact:** Higher gas costs for storage operations; packing could save SSTORE and SLOAD costs.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L112-L116"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-193"
                ]
            },
            "title": "Tick boundary check is off by one in checkCanRebalance",
            "description": "1. **Description:** The checkCanRebalance function incorrectly rejects valid tick boundaries by using a strict inequality.\n2. **Cause:** The function reverts when newBaseLower == -maxTick or newBaseUpper == maxTick, even though these are valid bounds.\n3. **Exploitation:** Users or the manager cannot set the base range to the maximum allowable ticks, unnecessarily restricting functionality.\n4. **Impact:** Reduced flexibility in position management, potentially limiting optimal rebalancing strategies.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L459-L460"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "Fee share may not be distributed to user in edge-case",
            "description": "1. **Description:** During withdrawal, fees are only collected if liquidity > 0, but in edge cases, fees may be due even when liquidity is zero.\n2. **Cause:** The condition `liquidity > 0` prevents fee collection when liquidity is zero, even if accrued fees exist.\n3. **Exploitation:** Not exploitable by attackers, but may lead to incorrect distribution.\n4. **Impact:** Users may not receive their full entitled fees in rare edge cases, leading to loss of expected rewards.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L337-L344"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ],
                "4": [
                    "CWE-1099"
                ]
            },
            "title": "Minor changes and renaming suggestions",
            "description": "1. **Description:** Several variable and function names are unclear or ambiguous and could be improved for readability.\n2. **Cause:** Names like `period` and `maxTwapDeviation` do not clearly indicate their purpose or units.\n3. **Exploitation:** Not exploitable.\n4. **Impact:** Reduced code clarity and maintainability; better naming would improve developer understanding.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-799"
                ]
            },
            "title": "Emergency burn action should have cooldown",
            "description": "1. **Description:** The emergencyBurn function can be misused by a malicious manager to disrupt normal operations.\n2. **Cause:** There is no cooldown or state restriction after emergencyBurn is called.\n3. **Exploitation:** A manager could repeatedly trigger emergency actions to block deposits or rebalances.\n4. **Impact:** Potential for denial-of-service or manipulation during rebalancing due to lack of safeguards.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L777-L780"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-684"
                ],
                "3": [
                    "CWE-440"
                ]
            },
            "title": "_verifyTick is a misnomer",
            "description": "1. **Description:** The function _verifyTick does not verify a tick but instead clamps it to a valid range.\n2. **Cause:** The function name suggests validation, but it actually modifies the input.\n3. **Exploitation:** Not exploitable.\n4. **Impact:** Misleading function name could confuse developers, leading to incorrect assumptions about its behavior.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L483-L492"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1078"
                ]
            },
            "title": "Shadowed function name",
            "description": "1. **Description:** The variable name `totalSupply` is used as a local variable or parameter in multiple functions, shadowing the state variable.\n2. **Cause:** Use of `totalSupply` as a parameter shadows the contract's state variable of the same name.\n3. **Exploitation:** Could lead to confusion or bugs if developers误assume they are referencing the state variable.\n4. **Impact:** Reduced code clarity and potential for subtle bugs due to variable shadowing.\n",
            "severity": "Informational",
            "location": [
                "AlphaProVault.sol#L255",
                "AlphaProVault.sol#L302",
                "AlphaProVault.sol#L330"
            ],
            "files": [
                "alpha-contracts-v2.1/contracts/AlphaProVault.sol"
            ]
        }
    ]
}