{
    "path": "dataset-curated/reports/Cantina/cantina_coinbase_flywheel_sep2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/base/flywheel"
        ],
        "commit_id": [
            "676c37c1"
        ],
        "address": [],
        "chain": "base",
        "compiler_version": "n/a",
        "audit_date": "2023-09-09",
        "project_path": {
            "flywheel": "dataset-curated/contracts/cantina_coinbase_flywheel_sep2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-703"
                ]
            },
            "title": "InvalidCode error uses empty value for toCode() function",
            "description": "The InvalidCode error is triggered when converting a tokenId to a code using normalizeSmallString, which may return a value differing from the direct bytes32 cast—likely due to case differences. The root cause is the ambiguity in error signaling: the error implies the output (code) is invalid, rather than clearly indicating the input (tokenId) is invalid. An attacker cannot directly exploit this, but it creates confusion during debugging and error handling. The impact is low, as it does not lead to fund loss or control issues, but it reduces code clarity and user experience.\n",
            "severity": "Low",
            "location": [
                "BuilderCodes.sol#L292-L296"
            ],
            "files": [
                "flywheel/src/BuilderCodes.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Buyers of BuilderCodes tokens might lose payouts due to missing updating payout address",
            "description": "The updatePayoutAddress() function allows a token owner to set the address for receiving payouts. However, upon token transfer, the payout address is not automatically updated to the new owner. The cause is the lack of integration between token transfer logic and payout address management. An attacker could not directly exploit this, but a new owner who fails to update the payout address risks having rewards sent to the previous owner. The impact is potential loss of payouts for legitimate owners, though the risk is mitigated by user action.\n",
            "severity": "Low",
            "location": [
                "BuilderCodes.sol#L178"
            ],
            "files": [
                "flywheel/src/BuilderCodes.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-330"
                ],
                "3": [
                    "CWE-340"
                ],
                "4": [
                    "CWE-341"
                ]
            },
            "title": "createCampaign() is front-runnable which might cause confusion for callers and potentially lost funds",
            "description": "The createCampaign() function uses CREATE2 with a salt that does not include msg.sender, making the deployment deterministic and susceptible to front-running. The root cause is the predictable salt, allowing an attacker to replicate the salt and deploy the contract first. Exploitation involves submitting a transaction with the same salt, causing the victim's transaction to revert. This can lead to confusion, failed dependent transactions, or perceived loss of funds if pre-funded addresses are used. The impact is moderate user disruption and potential DoS-like behavior, though no direct theft occurs.\n",
            "severity": "Low",
            "location": [
                "Flywheel.sol#L241"
            ],
            "files": [
                "flywheel/src/Flywheel.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ],
                "3": [
                    "CWE-248"
                ]
            },
            "title": "Reverting token transfers can undo payout batches",
            "description": "When batch payouts are processed, a single failing transfer (e.g., due to a recipient being on a blocklist like USDC) causes the entire batch to revert. The cause is the use of unchecked transfers in a loop without error handling. An attacker cannot directly trigger this unless they control a blocklisted address, but the system becomes fragile under edge cases. The impact is delayed or failed payouts, requiring manual intervention to retry, which reduces reliability and user trust.\n",
            "severity": "Low",
            "location": [
                "Campaign.sol#L41-L49"
            ],
            "files": [
                "flywheel/src/Campaign.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ]
            },
            "title": "Excessive fees can prevent users from receiving bridged funds immediately",
            "description": "The BridgeRewards hook reverts if the feeBps exceeds a limit, which locks user funds in the bridge until the issue is resolved. The root cause is a strict validation that reverts instead of capping the fee. There is no direct exploitation path, but malicious or misconfigured fee settings could delay fund delivery. The impact is temporary fund lockup, degrading user experience and trust in the bridging mechanism.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "flywheel/src/hooks/BridgeRewards.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ],
                "3": [
                    "CWE-390"
                ]
            },
            "title": "Non-existent builder codes can prevent users from receiving bridged funds immediately",
            "description": "If an incorrect builder code is used during bridging, the transaction reverts, and user funds remain locked in the bridge. The cause is strict validation of builder codes without fallback handling. While not directly exploitable for gain, it creates a poor user experience where user error leads to fund immobilization. The impact is temporary fund loss from the user's perspective, requiring operator intervention to resolve.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "flywheel/src/BuilderCodes.sol",
                "flywheel/src/Flywheel.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Unnecessary call to hook contracts when updating metadata",
            "description": "The Flywheel contract makes an extra external call to retrieve the updated URI after calling onUpdateMetadata(), even though the hook could return it directly. The cause is inefficient design in the metadata update flow. This does not pose a security risk but increases gas costs unnecessarily. The impact is higher transaction costs for users, with no direct financial loss but reduced efficiency.\n",
            "severity": "Informational",
            "location": [
                "Flywheel.sol#L448-L449"
            ],
            "files": [
                "flywheel/src/Flywheel.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused imports",
            "description": "The contracts CashbackRewards.sol and Flywheel.sol contain unused imports (CampaignHooks and SafeERC20, respectively). The cause is leftover or unnecessary import statements. This does not introduce security vulnerabilities but increases contract size and deployment cost. The impact is minor, limited to higher gas usage during deployment, but represents a code hygiene issue.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "flywheel/src/hooks/CashbackRewards.sol",
                "flywheel/src/Flywheel.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "owner_ is not used in the Adconversion constructor",
            "description": "The AdConversion constructor accepts an owner_ parameter that is never used, and the contract lacks any ownership-based access control. The cause is redundant code or incomplete implementation. This does not pose a security risk but may confuse developers. The impact is purely code clarity and maintenance, with no effect on functionality or security.\n",
            "severity": "Informational",
            "location": [
                "AdConversion.sol#L190"
            ],
            "files": [
                "flywheel/src/hooks/AdConversion.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "_onCreateCampaign does not check existence before overwriting",
            "description": "The _onCreateCampaign function in hook contracts (e.g., CashbackRewards) does not verify if a campaign is already registered before overwriting its data. The cause is missing validation logic. Although Flywheel generates unique addresses, future versions or integrations might reuse addresses, leading to silent data corruption. The impact is potential loss of campaign state in edge cases, especially if multiple Flywheel instances interact with the same hook.\n",
            "severity": "Informational",
            "location": [
                "CashbackRewards.sol#L91-L99"
            ],
            "files": [
                "flywheel/src/hooks/CashbackRewards.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-330"
                ],
                "3": [
                    "CWE-331"
                ],
                "4": [
                    "CWE-332"
                ]
            },
            "title": "Edge case for referral code mismatch in case of reorgs",
            "description": "Referral codes generated by PseudoRandomRegistrar depend on block context (timestamp, prevrandao, block hash), which can be identical across reorged blocks, especially on chains like Arbitrum. If transaction order changes during a reorg, users may receive swapped referral codes. The cause is insufficient entropy in code generation. The impact is low—a rare edge case—but could lead to incorrect attribution and user confusion.\n",
            "severity": "Informational",
            "location": [
                "PseudoRandomRegistrar.sol#L57-L59"
            ],
            "files": [
                "flywheel/src/registrars/PseudoRandomRegistrar.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "BuilderCodes.updateMetadata: Missing tokenId existence check",
            "description": "The updateMetadata function emits a MetadataUpdate event without verifying that the tokenId exists or is owned by the caller. The cause is missing _requireOwned(tokenId) check. This allows events to be emitted for non-existent or future tokens, potentially misleading off-chain indexers. The impact is data inconsistency in event-based systems, though no direct fund loss occurs.\n",
            "severity": "Informational",
            "location": [
                "BuilderCodes.sol#L160-L162"
            ],
            "files": [
                "flywheel/src/BuilderCodes.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Out-of-order alphanumeric characters",
            "description": "The constant ALLOWED_CHARACTERS in BuilderCodes.sol and ALPHANUMERIC in PseudoRandomRegistrar.sol contain misplaced 'n' and 'o', resulting in \"monpqrstuvwxyz\" instead of \"nopqrstuvwxyz\". The cause is a typographical error. This leads to incorrect character sets being used in code generation, potentially reducing entropy or causing unexpected behavior. The impact is functional correctness and security of generated codes, though likely limited in practice.\n",
            "severity": "Informational",
            "location": [
                "BuilderCodes.sol#L47",
                "PseudoRandomRegistrar.sol#L16"
            ],
            "files": [
                "flywheel/src/BuilderCodes.sol",
                "flywheel/src/registrars/PseudoRandomRegistrar.sol"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-400"
                ],
                "3": [
                    "CWE-405"
                ],
                "4": [
                    "CWE-1050"
                ]
            },
            "title": "Potential out-of-gas issue in future hooks implementations",
            "description": "The createCampaign() function allows arbitrary hook contracts that may write unbounded data in _onCreateCampaign(). The cause is lack of constraints on hook behavior. Future hook implementations could accumulate storage, leading to out-of-gas errors when iterating over data. The impact is potential denial of service in dependent functions, especially as the number of campaigns grows.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "flywheel/src/CampaignHooks.sol"
            ]
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ]
            },
            "title": "Missing foundry.lock file",
            "description": "The repository does not include a foundry.lock file, which is used to lock dependency versions for deterministic builds. The cause is omission from version control. Without it, different contributors may use different dependency versions, risking inconsistent builds or supply-chain attacks (e.g., via compromised npm packages). The impact is reduced build reproducibility and potential security vulnerabilities from unverified dependencies.\n",
            "severity": "Informational",
            "location": [],
            "files": []
        }
    ]
}