{
    "path": "dataset-curated/reports/Cantina/cantina_sky_spark_alm_controller_aug2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/sparkdotfi/spark-alm-controller"
        ],
        "commit_id": [
            "cc8b6e30e74ad1d5eef554df17d88bc4d1cb4a00"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-26",
        "project_path": {
            "spark-alm-controller": "dataset-curated/contracts/cantina_sky_spark_alm_controller_aug2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Malicious relayer could take spark vault assets and deposit them back",
            "description": "The vulnerability allows a malicious relayer (acting as the ALM proxy or taker) to withdraw assets from a Spark Vault without burning shares, and then deposit those same assets back into the vault to receive new shares. The root cause lies in the lack of coordination between rate limits for asset withdrawal and deposit controls, which enables the taker to manipulate the vault's accounting state. An attacker could exploit this by first taking assets via the taker role and then depositing them back through ERC4626 mechanisms, thereby inflating their share balance and causing the totalAssets() function to report an incorrect value. The impact is a potential discrepancy in vault accounting, which could affect fairness and accuracy in share calculations, though no direct fund loss is implied. This was classified as low risk due to the specific conditions required and the mitigation implemented in the vault code.\n",
            "severity": "Low",
            "location": [
                "MainnetController.sol::#L888-L897"
            ],
            "files": [
                "spark-alm-controller/src/MainnetController.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "The superstateRedemption and artifacts can be removed",
            "description": "The Superstate redemption functionality was previously removed from the MainnetController, but related code artifacts (such as variables or functions) were left behind in the contract. The root cause is incomplete cleanup after feature removal. While this does not introduce a direct security risk, it increases code complexity, reduces readability, and may lead to confusion during future audits or maintenance. There is no direct exploitation path, but leftover code can obscure real vulnerabilities. The impact is limited to code maintainability and audit efficiency. This is purely an informational finding recommending code hygiene improvements.\n",
            "severity": "Informational",
            "location": [
                "MainnetController.sol::#L60-L64",
                "MainnetController.sol::#L141"
            ],
            "files": [
                "spark-alm-controller/src/MainnetController.sol"
            ]
        }
    ]
}