{
    "path": "dataset-curated/reports/Cantina/cantina_eco_pr247_nov2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/eco/eco-routes"
        ],
        "commit_id": [
            "df431603"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-11-17",
        "project_path": {
            "eco-routes": "dataset-curated/contracts/cantina_eco_pr247_nov2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "No 0-checks on incoming message",
            "description": "1. **Description:** The CCIPProver contract does not perform zero-value checks on critical incoming message fields such as senderAddress, sourceChainSelector, and messageId in the ccipReceive function, unlike other provers (HyperProver, MetaProver, LayerZeroProver) which include such validations.\n2. **Cause:** The absence of input validation for zero values in the ccipReceive function increases the risk of processing malformed or invalid messages, which could lead to unexpected behavior or errors downstream.\n3. **Exploitation:** An attacker could potentially craft a malicious message with zero-valued fields, which might bypass certain assumptions in the system and lead to incorrect state transitions or reverts that could be exploited in edge cases.\n4. **Impact:** While the impact is limited due to downstream safeguards, the lack of consistency in validation reduces code robustness and increases the risk surface. The issue was acknowledged and fixed.\n",
            "severity": "Informational",
            "location": [
                "CCIPProver.sol::ccipReceive#L78"
            ],
            "files": [
                "eco-routes/contracts/prover/CCIPProver.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Prover accepts too-large proof batch sizes",
            "description": "1. **Description:** The CCIPProver contract does not pre-validate the size of the encodedProofs bytes array, allowing it to be arbitrarily large, despite CCIP's documented maximum data size limit of 30 KB.\n2. **Cause:** The contract relies on external reverts (e.g., from the router during fee calculation) to handle oversized data rather than proactively checking the size.\n3. **Exploitation:** A caller could submit a proof batch exceeding the CCIP data limit, causing the transaction to revert at the router level, leading to wasted gas and potential denial-of-service vectors if exploited repeatedly.\n4. **Impact:** This results in inefficient gas usage and a poor user experience. While not directly exploitable for fund loss, it represents a deviation from best practices in input validation. The issue was acknowledged by the team.\n",
            "severity": "Informational",
            "location": [
                "CCIPProver.sol::encodedProofs#L183"
            ],
            "files": [
                "eco-routes/contracts/prover/CCIPProver.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "The sender of proofs must ensure that the allowOutOfOrderExecution flag respects chain restrictions",
            "description": "1. **Description:** The responsibility of setting the allowOutOfOrderExecution flag correctly lies entirely with the caller of the prove() function. If set incorrectly, the EVM2EVMOnRamp contract may revert with ExtraArgOutOfOrderExecutionMustBeTrue().\n2. **Cause:** The contract does not enforce or validate the flag's value, leaving it to external actors to comply with chain-specific requirements.\n3. **Exploitation:** A caller who fails to set allowOutOfOrderExecution=true on chains that require it could cause transaction reverts, disrupting message delivery and potentially blocking critical operations.\n4. **Impact:** This could lead to failed message executions and inconsistent behavior across chains, especially when interacting with contracts that depend on ordered execution. The issue was fixed in PR 351.\n",
            "severity": "Informational",
            "location": [
                "CCIPProver.sol::allowOutOfOrderExecution#L189"
            ],
            "files": [
                "eco-routes/contracts/prover/CCIPProver.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "The provided gasLimit is not checked against MIN_GAS_LIMIT",
            "description": "1. **Description:** The gasLimit parameter in the prove() function of CCIPProver is not validated against a minimum threshold (MIN_GAS_LIMIT), unlike in LayerZeroProver.\n2. **Cause:** The absence of a validation check allows callers to set an unreasonably low gas limit, which may result in insufficient gas for successful execution on the destination chain.\n3. **Exploitation:** A malicious or misconfigured caller could set a gas limit below the required minimum, causing the execution to fail mid-operation, leading to wasted resources and potential denial of service.\n4. **Impact:** This could result in failed message processing and loss of user funds due to gas consumption without successful completion. The issue was fixed in PR 352.\n",
            "severity": "Informational",
            "location": [
                "CCIPProver.sol::gasLimit#L188"
            ],
            "files": [
                "eco-routes/contracts/prover/CCIPProver.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Missing documentation for the new CCIP prover in various NatSpecs",
            "description": "1. **Description:** The NatSpec comments in Inbox.sol and IProver.sol list existing prover systems but do not include documentation for the new CCIPProver, creating a gap in developer understanding.\n2. **Cause:** The addition of CCIPProver was not accompanied by updates to the inline documentation that explains domain ID mappings for different bridge providers.\n3. **Exploitation:** Developers relying on the NatSpec comments may misunderstand how CCIP handles chain identifiers, leading to incorrect integration or configuration.\n4. **Impact:** This reduces code clarity and maintainability, increasing the risk of integration errors. While not a direct security vulnerability, it affects the overall quality and safety of the system. The issue was fixed in PR 353.\n",
            "severity": "Informational",
            "location": [
                "Inbox.sol::#L100",
                "Inbox.sol::#L149",
                "IProver.sol::#L84"
            ],
            "files": [
                "eco-routes/contracts/Inbox.sol",
                "eco-routes/contracts/interfaces/IProver.sol"
            ]
        }
    ]
}