{
    "path": "dataset-curated/reports/Cantina/cantina_generic_money_nov2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/MetaFi-Labs/generic-protocol",
            "https://github.com/MetaFi-Labs/generic-bridging"
        ],
        "commit_id": [
            "67cb0291",
            "7a6c887b"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2023-11-03",
        "project_path": {
            "cantina_generic_money_nov2025.pdf-source": "dataset-curated/contracts/cantina_generic_money_nov2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Insufficient slippage control for vault operations",
            "description": "The protocol performs vault operations, including user deposits/withdrawals and privileged rebalancing, without proper slippage controls. This is due to reliance on the ERC4626 standard without guaranteeing monotonically increasing share prices, which exposes operations to potential slippage in volatile vaults such as those integrated with Curve's 3pool. An attacker could exploit price discrepancies during vault operations to cause unexpected losses. The impact includes potential loss of user funds during deposits or withdrawals and incorrect valuation during rebalancing, undermining the system's financial integrity.\n",
            "severity": "High",
            "location": [
                "RebalancingManager.sol::#L99-L111",
                "RebalancingManager.sol::#L128-L161"
            ],
            "files": [
                "67cb0291/generic-protocol/src/controller/RebalancingManager.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Vault price manipulation allows yield manager to mint tokens",
            "description": "The yield manager can mint additional tokens when the perceived value of backing assets exceeds the total shares. This vulnerability arises because the _additionalOwnedAssets() function, used to determine asset value, is susceptible to manipulation—such as through an attacker distorting pool prices in Curve 3pool. By inflating the perceived asset value, an attacker can trigger erroneous yield distribution and minting. The yield manager, especially if malicious, could front-run these calls and redirect funds. The impact includes unauthorized token minting and potential theft of protocol funds, especially when combined with governance-controlled yield distribution.\n",
            "severity": "High",
            "location": [
                "YieldManager.sol::#L51-L61"
            ],
            "files": [
                "67cb0291/generic-protocol/src/controller/YieldManager.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-807"
                ]
            },
            "title": "Periphery manager can manipulate rebalance and rewards and extract funds",
            "description": "The periphery manager, who controls the swapper and yield distributor addresses, can manipulate slippage during rebalancing by controlling the swapper contract's return values. Since the protocol trusts these values without validating actual asset balances before and after swaps, the periphery manager can extract funds beyond surplus yield. Additionally, re-entrancy during external calls allows temporary balance inflation to bypass value checks. The safety buffer check is also sometimes disabled, reducing protection. This could lead to significant fund loss, especially during rebalancing when safeguards are inactive.\n",
            "severity": "Medium",
            "location": [
                "RebalancingManager.sol::#L128-L160",
                "RewardsManager.sol::#L69-L89"
            ],
            "files": [
                "67cb0291/generic-protocol/src/controller/RebalancingManager.sol",
                "67cb0291/generic-protocol/src/controller/PeripheryManager.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ]
            },
            "title": "An attacker can (temporarily) freeze deposits and withdrawals",
            "description": "An attacker can trigger a deadlock state by manipulating vault proportions such that two or more vaults simultaneously hit their min or max proportionality limits. For example, driving two vaults to minimum and two to maximum proportionality blocks all deposits and withdrawals. Recovery requires external intervention, such as donations or rebalancing. The attacker can sandwich rebalancing transactions to induce this state without financial loss. The impact is a temporary freeze of all user funds, leading to a denial-of-service condition that disrupts protocol functionality and user access.\n",
            "severity": "Medium",
            "location": [],
            "files": [
                "67cb0291/generic-protocol/src/controller/RebalancingManager.sol",
                "67cb0291/generic-protocol/src/controller/VaultManager.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Message id's are not strictly unique which potentially prevents rollbacks",
            "description": "Message IDs are generated using target chain ID, bridge type, timestamp, and nonce, but do not include the source chain ID. This can result in ID collisions if two adapters on different chains create messages with identical parameters. Since rollback mechanisms rely on unique message IDs, a collision could overwrite failure records, allowing only the last failed message to be rolled back. This undermines the reliability of the rollback system and could prevent recovery from failed cross-chain messages, leading to inconsistent state or loss of message integrity.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "7a6c887b/generic-bridging/src/BridgeCoordinatorL1.sol",
                "7a6c887b/generic-bridging/src/BridgeCoordinatorL2.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Use uint256 for nonce will result in shorter assembly",
            "description": "The nonce in BaseAdapter.sol is defined as uint32, which leads to more complex EVM bytecode due to range-checking operations during increment. Using uint256 would reduce gas costs because storage operations are natively 256-bit, eliminating the need for masking and truncation. Although it uses an extra storage slot, the performance gain outweighs the cost, especially since nonce is frequently incremented. The impact is suboptimal gas efficiency, increasing transaction costs for all bridge operations.\n",
            "severity": "Informational",
            "location": [
                "BaseAdapter.sol::#L82-L84"
            ],
            "files": [
                "7a6c887b/generic-bridging/src/adapters/BaseAdapter.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-128"
                ]
            },
            "title": "32-bit nonce can run out",
            "description": "The 32-bit nonce in the bridge adapter can overflow after approximately 4.3 billion transactions. Under high-throughput conditions or targeted attacks, this limit could be reached in as little as 554 days if all Ethereum gas were consumed by bridge transactions. Once exhausted, the nonce would wrap, potentially breaking message ordering and uniqueness. This could disrupt message processing and compromise bridge security. The recommendation is to use uint64 or uint256 to ensure long-term viability.\n",
            "severity": "Informational",
            "location": [
                "BaseAdapter.sol::#L30-L33"
            ],
            "files": [
                "7a6c887b/generic-bridging/src/adapters/BaseAdapter.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ],
                "4": [
                    "CWE-778"
                ]
            },
            "title": "Missing vault update events",
            "description": "The GenericUnit contract does not emit VaultUpdate events when a vault linked to a share is modified, as recommended by ERC-7575. While this is not a mandatory requirement, emitting such events improves transparency and allows external systems to track vault changes reliably. The absence of these events reduces observability and may hinder integration with indexing services or monitoring tools, potentially delaying detection of critical configuration changes.\n",
            "severity": "Informational",
            "location": [
                "GenericUnit.sol::#L51-L52"
            ],
            "files": [
                "67cb0291/generic-protocol/src/unit/GenericUnit.sol"
            ]
        }
    ]
}