{
    "path": "dataset-curated/reports/Cantina/cantina_panoptic_sep2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/panoptic-labs/multitoken-merkle-distributor"
        ],
        "commit_id": [
            "0897d3ecba6c4b071ae122d900a0f2c504a755b"
        ],
        "address": null,
        "chain": "ethereum",
        "compiler_version": "n/a",
        "audit_date": "2025-09-15",
        "project_path": {
            "multitoken-merkle-distributor": "dataset-curated/contracts/cantina_panoptic_sep2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-862"
                ]
            },
            "title": "Anyone can call claim for any account",
            "description": "1. **Description:** The `claim` function in the MerkleDistributor contract allows any third party to initiate a claim on behalf of any account, as long as they provide a valid Merkle proof. The tokens are sent to the account specified in the Merkle leaf, not necessarily the caller.\n2. **Cause:** The function does not require the caller (`msg.sender`) to be the same as the account receiving the tokens, enabling permissionless claiming.\n3. **Exploitation:** A malicious actor or griefer could monitor the distribution and front-run intended recipients by submitting claims for accounts they believe are inactive or unwilling to claim, sending funds to potentially incorrect or unintended addresses.\n4. **Impact:** If a leaf contains an incorrect account address, a third party could claim tokens to that address, permanently preventing recovery via the admin's `withdrawUnclaimed` function after the clawback period, leading to loss of user funds.\n",
            "severity": "Medium",
            "location": [
                "MerkleDistributor.sol::claim#61"
            ],
            "files": [
                "multitoken-merkle-distributor/contracts/MerkleDistributor.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-1329"
                ]
            },
            "title": "Admin key is a single EOA set to msg.sender and immutable",
            "description": "1. **Description:** The `admin` role is set to the deployer's externally owned account (EOA) during construction and cannot be changed due to immutability. There is no mechanism to recover or transfer admin privileges.\n2. **Cause:** The admin address is hardcoded to `msg.sender` at deployment and stored in an immutable variable, with no upgrade or recovery functionality.\n3. **Exploitation:** If the admin's private key is lost or compromised, an attacker could wait until the `withdrawableAt` timestamp and then withdraw all unclaimed funds. No recovery is possible.\n4. **Impact:** Permanent loss of unclaimed tokens in the contract if the admin key is compromised or lost, with no governance or recovery mechanism in place.\n",
            "severity": "Low",
            "location": [
                "MerkleDistributor.sol::constructor#37"
            ],
            "files": [
                "multitoken-merkle-distributor/contracts/MerkleDistributor.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Token registry uses mapping + array instead of an enumerable set",
            "description": "1. **Description:** The contract uses a combination of a `mapping(address => bool)` and an array `tokenList` to track supported tokens. This dual structure is error-prone and can lead to inconsistencies.\n2. **Cause:** Manual management of both data structures increases the risk of bugs such as duplicate entries, failed removals, or desynchronization between the mapping and array.\n3. **Exploitation:** While not currently enforced during `claim`, if future logic were to rely on these structures, inconsistencies could lead to incorrect behavior, such as blocking valid claims or allowing unsupported tokens.\n4. **Impact:** Increased maintenance burden and potential for logic errors in future updates. Currently, the impact is limited since these structures are only used for off-chain reading.\n",
            "severity": "Informational",
            "location": [
                "MerkleDistributor.sol::supportedTokens#17",
                "MerkleDistributor.sol::tokenList#18"
            ],
            "files": [
                "multitoken-merkle-distributor/contracts/MerkleDistributor.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Lack of end-to-end Merkle tests before release",
            "description": "1. **Description:** The project lacks integration or fork-based end-to-end tests that validate the entire Merkle distribution process, including leaf encoding, proof verification, and token balances.\n2. **Cause:** Absence of pre-deployment testing that reconstructs the Merkle root and simulates claims for all leaves under real conditions.\n3. **Exploitation:** Discrepancies in leaf data (e.g., incorrect amounts, malformed addresses, or unsupported tokens) may only be discovered post-deployment, potentially preventing some users from claiming their tokens.\n4. **Impact:** Risk of denial-of-service for legitimate claimants if data inconsistencies exist, leading to reputational damage and user fund loss.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "multitoken-merkle-distributor/test/MerkleDistributor.t.sol",
                "multitoken-merkle-distributor/test/MerkleDistributor.test.ts",
                "multitoken-merkle-distributor/test/MerkleDistributor.spec.ts.old"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Using MerkleProof.verify (memory) instead of verifyCalldata",
            "description": "1. **Description:** The contract uses `MerkleProof.verify`, which copies the Merkle proof from calldata to memory, incurring unnecessary gas costs.\n2. **Cause:** The proof is passed as calldata but is processed using a function that requires memory, resulting in a redundant data copy.\n3. **Exploitation:** Attackers cannot exploit this directly, but every claim operation wastes gas due to the memory copy.\n4. **Impact:** Higher transaction costs for users claiming tokens, reducing efficiency and increasing the economic barrier for small claims.\n",
            "severity": "Informational",
            "location": [
                "MerkleDistributor.sol::verify#71"
            ],
            "files": [
                "multitoken-merkle-distributor/contracts/MerkleDistributor.sol"
            ]
        }
    ]
}