{
    "path": "dataset-curated/reports/Cantina/cantina_coinbase_nov2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/base/basenames"
        ],
        "commit_id": [
            "fb15e223"
        ],
        "address": [],
        "chain": "base",
        "compiler_version": "n/a",
        "audit_date": "2025-11-06",
        "project_path": {
            "basenames": "dataset-curated/contracts/cantina_coinbase_nov2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ],
                "4": [
                    "CWE-778"
                ]
            },
            "title": "Missing event for signer rotations",
            "description": "1. **Description:** The `setSigner` function in `SignatureDiscountValidator.sol` updates the signer address without emitting an event, and the constructor also initializes the signer silently. This omission prevents off-chain systems from being notified of signer changes.\n2. **Cause:** The lack of an event emission when the signer state is modified means there is no log-based mechanism for external systems to detect changes.\n3. **Exploitation:** An attacker or misconfigured service relying on stale signer data could accept signatures from a deprecated signer if revocation is delayed due to polling inefficiencies.\n4. **Impact:** This increases operational risk and delays in revocation detection for off-chain services such as discount portals, caching layers, and monitoring tools, potentially leading to misuse of outdated trust assumptions.\n",
            "severity": "Informational",
            "location": [
                "SignatureDiscountValidator.sol#L35-L39"
            ],
            "files": [
                "basenames/src/L2/discounts/SignatureDiscountValidator.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Incorrect NatSpec Comment for Signature Expiration Boundary Condition",
            "description": "1. **Description:** The NatSpec comment for the `SignatureExpired` error incorrectly states that it is thrown when the signature expiry date is greater than or equal to the current block timestamp, while the actual condition only reverts when `expires < block.timestamp`.\n2. **Cause:** The documentation (NatSpec) does not match the implementation logic, creating a discrepancy between expected and actual behavior at the boundary condition where `expires == block.timestamp`.\n3. **Exploitation:** Developers or integrators relying on the incorrect comment might assume signatures are invalid at equality, leading to incorrect assumptions in client-side logic or security reviews.\n4. **Impact:** Misleading documentation can result in integration errors, flawed security analyses, or incorrect handling of signature validity at the exact expiration moment, undermining trust in the codebase.\n",
            "severity": "Informational",
            "location": [
                "SybilResistanceVerifier.sol#L19"
            ],
            "files": [
                "basenames/src/lib/SybilResistanceVerifier.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-345"
                ],
                "3": [
                    "CWE-347"
                ]
            },
            "title": "Discount signatures scoped per validator instance",
            "description": "1. **Description:** The `isValidDiscountRegistration` function validates signatures based only on (claimer, expires, signature) and does not include the `discountKey` in the verification payload. This design could allow replay of a valid signature across different discount tiers if multiple keys were associated with the same validator.\n2. **Cause:** The signed message payload omits the `discountKey`, creating a potential for signature replay across tiers if the same validator serves multiple keys.\n3. **Exploitation:** If the deployment ever allowed multiple discount keys per validator, an attacker could reuse a valid signature intended for one tier to claim a different discount.\n4. **Impact:** While currently not exploitable due to the operational constraint of one key per validator, this represents a latent risk that could become active if the architecture evolves without corresponding code changes, leading to unauthorized discount claims.\n",
            "severity": "Informational",
            "location": [
                "SignatureDiscountValidator.sol#L48-L51"
            ],
            "files": [
                "basenames/src/L2/discounts/SignatureDiscountValidator.sol"
            ]
        }
    ]
}