{
    "path": "dataset-curated/reports/Cantina/cantina_coinbase_dec2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/base/flywheel"
        ],
        "commit_id": [
            "6004a0f8"
        ],
        "address": [],
        "chain": "base",
        "compiler_version": "n/a",
        "audit_date": "2025-12-10",
        "project_path": {
            "flywheel": "dataset-curated/contracts/cantina_coinbase_dec2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-807"
                ]
            },
            "title": "Non-Deterministic Bridged and Fee Amounts",
            "description": "The fee and payout amounts prepared in _onSend are derived from the campaign's on-chain balance at execution time, rather than from values that can be deterministically known or enforced by the sender on the source side of the bridge. This creates a situation where the bridgedAmount is calculated based on the current balance of the campaign minus previously allocated fees, and the feeAmount is derived as a percentage of that value. Because the bridgedAmount depends on the live balance of the campaign contract, it can be influenced externally between the time the sender initiates the bridge and when _onSend executes. The root cause is the reliance on dynamic, mutable state rather than sender-provided or locked-in values. An attacker or third party could manipulate the outcome by sending unsolicited funds to the campaign contract before the _onSend function executes. This could result in a larger payout than expected on the destination chain, potentially causing reverts in recipient contracts that enforce strict amount checks, leading to unexpected failures and reduced composability. While not a direct exploit leading to fund loss, it breaks assumptions about payout predictability and may affect integration reliability.\n",
            "severity": "Low",
            "location": [
                "BridgeReferralFees.sol::#L72-L112"
            ],
            "files": [
                "flywheel/src/hooks/BridgeReferralFees.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-439"
                ]
            },
            "title": "Failing test cases",
            "description": "Multiple fuzz test cases fail when running the test suite with the latest version of Foundry (forge v1.5.0-stable). For example, the test_success_emptyBuilderCode_zeroFees test in test/unit/hooks/BridgeReferralFees/onSend.t.sol fails under specific conditions where the user equals the address of bridgeReferralFeesCampaign. This indicates a discrepancy between expected and actual behavior in the test environment, likely due to changes in Foundry's behavior or unhandled edge cases in the test setup. The root cause is either outdated test assertions or insufficient handling of edge cases in the test logic. If left unaddressed, failing tests reduce confidence in the correctness and robustness of the implementation, potentially masking real bugs. Although this does not directly impact on-chain security, it undermines the reliability of the development and verification process. The issue was fixed in PR 155, confirming its recognition and resolution by the team.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "flywheel/test/unit/hooks/BridgeReferralFees/onSend.t.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Prioritize using abi.decode for decoding bytes data for consistency and readability",
            "description": "The _onDistributeFees and _onUpdateMetadata functions perform explicit typecasting of bytes hookData to string, while other hook functions in the same contract use abi.decode for parsing input data. This inconsistency in decoding methods reduces code readability and maintainability for developers and auditors. The root cause is a lack of standardized data parsing practices across functions. Although both methods are functionally valid, using mixed approaches increases the cognitive load and risk of errors during future modifications. There is no direct security impact, but inconsistent patterns can obscure logic and make audits more difficult. The recommendation is to standardize on abi.decode for all such operations to improve clarity and consistency across the codebase. This is a best practice suggestion rather than a vulnerability.\n",
            "severity": "Informational",
            "location": [
                "BridgeReferralFees.sol::#L124",
                "BridgeReferralFees.sol::#L166"
            ],
            "files": [
                "flywheel/src/hooks/BridgeReferralFees.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Unused and redundant code",
            "description": "The BridgeReferralFees contract contains minor code quality issues that affect maintainability. Specifically, the ZeroBridgedAmount custom error is declared but never used in the contract, and the NATIVE_TOKEN address is redundantly defined instead of reusing the existing Constants.NATIVE_TOKEN constant. The root cause is incomplete cleanup during development or refactoring. Unused code elements like errors and duplicated constants increase code bloat and reduce clarity, making the contract harder to audit and maintain. While there is no direct security risk, such issues can mislead reviewers into thinking certain conditions are handled when they are not, or create confusion about the source of truth for shared values. Removing unused errors and consolidating constants improves code hygiene and reduces the chance of inconsistencies in future updates. This issue was acknowledged and fixed in commit a5056e3c.\n",
            "severity": "Informational",
            "location": [
                "BridgeReferralFees.sol::#L19",
                "BridgeReferralFees.sol::#L36-L37"
            ],
            "files": [
                "flywheel/src/hooks/BridgeReferralFees.sol"
            ]
        }
    ]
}