{
    "path": "dataset-curated/reports/Cantina/cantina_sky_spark_alm_controller_july2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/sparkdotfi/spark-alm-controller"
        ],
        "commit_id": [
            "c0292396956dabfdfcf7fce2f21b2438d7a41f3b"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": {
            "spark-alm-controller": "dataset-curated/contracts/cantina_sky_spark_alm_controller_july2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Withdrawing from ERC4626 and Aave requires deposit rate limits to be set",
            "description": "The vulnerability arises when users attempt to withdraw from ERC4626 or Aave vaults via withdrawERC4626, redeemERC4626, or withdrawAave functions, which consume the WITHDRAW rate limit and reset the corresponding DEPOSIT rate limits. The root cause is that resetting the DEPOSIT limit requires the existing DEPOSIT limit to be non-zero, as enforced by a require statement in the rate limiter: require(maxAmount > 0, \"RateLimits/zero-maxAmount\"). An attacker cannot trigger a reset if the DEPOSIT limit was previously zero, potentially blocking legitimate withdrawals that depend on this reset mechanism. This leads to a functional restriction where operators must maintain a non-zero deposit limit, even if deposits are not intended, to allow withdrawals to succeed.\n",
            "severity": "Low",
            "location": [
                "MainnetController.sol::withdrawERC4626#L319",
                "MainnetController.sol::redeemERC4626#L319",
                "MainnetController.sol::withdrawAave#L319"
            ],
            "files": [
                "spark-alm-controller/src/MainnetController.sol",
                "spark-alm-controller/src/ForeignController.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ],
                "3": [
                    "CWE-1112"
                ]
            },
            "title": "Improved documentation",
            "description": "The issue is a lack of centralized documentation detailing which rate limits are triggered by each function in the controller. Currently, developers and auditors must manually trace through the code to determine rate limit behavior, increasing the risk of misconfiguration or incorrect assumptions during integration or review. The root cause is the absence of a comprehensive matrix or table in the documentation that maps functions to their associated rate limits. While this does not introduce a direct security exploit, it can lead to operational errors or oversights in security assessments. The impact is reduced clarity and maintainability of the system, especially for external contributors or future audits.\n",
            "severity": "Informational",
            "location": [
                "README.md"
            ],
            "files": [
                "spark-alm-controller/README.md"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Cannot perform a pure staking farm rewards claim",
            "description": "The contract does not support claiming staking rewards without also performing a withdrawal from the farm, due to the withdraw function reverting when the amount is zero. The root cause is the require(amount > 0, \"Cannot withdraw 0\") check in the farm's withdraw function, which forces any call to withdrawFromFarm to include a non-zero withdrawal even if the intent is only to claim rewards. This leads to an inability to perform a claim-only operation, limiting flexibility for users who wish to harvest rewards without altering their staked position. While not a security vulnerability per se, it reduces usability and may force unnecessary balance changes. The recommendation is to conditionally execute the withdrawal only when usdsAmount > 0, allowing zero-amount reward claims.\n",
            "severity": "Informational",
            "location": [
                "MainnetController.sol::withdrawFromFarm#L878"
            ],
            "files": [
                "spark-alm-controller/src/MainnetController.sol"
            ]
        }
    ]
}