{
    "path": "dataset-curated/reports/Cantina/cantina_byzantine_sep2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/Byzantine-Finance/debt-fund-vault-v2"
        ],
        "commit_id": [
            "a09167948336b6138c5cfccb16cd7a668b947a3c"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-08-31",
        "project_path": {
            "debt-fund-vault-v2": "dataset-curated/contracts/cantina_byzantine_sep2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-697"
                ],
                "2": [
                    "CWE-1023"
                ]
            },
            "title": "Anyone can overwrite factory mapping",
            "description": "The CompoundV3AdapterFactory stores deployed adapter addresses in a mapping keyed only by parentVault and comet, excluding the cometRewards parameter. This allows any user to deploy a new adapter with the same parentVault and comet but a different cometRewards address, overwriting the existing mapping entry. The root cause is the insufficient key structure in the mapping, which fails to account for all configuration parameters. An attacker could exploit this by deploying a malicious adapter with altered reward logic, causing downstream systems relying on the mapping to interact with the wrong or malicious contract. While the contract is not directly used by other audited contracts, external integrators may be misled, potentially leading to fund loss. Due to the uncertain scope of impact, it is classified as medium risk despite high exploit likelihood.\n",
            "severity": "Medium",
            "location": [
                "CompoundV3AdapterFactory.sol#L23"
            ],
            "files": [
                "debt-fund-vault-v2/src/adapters/CompoundV3AdapterFactory.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Inconsistent skim protection between adapters",
            "description": "The CompoundV3Adapter's skim() function lacks validation to prevent the withdrawal of underlying protocol tokens (cTokens), unlike the secure implementation in ERC4626MerklAdapter. The root cause is the absence of a safeguard that checks whether the token being skimmed is the underlying asset of the vault. A malicious or compromised skimRecipient could call skim() with the cToken address, draining the adapter's entire asset balance and potentially causing the parent vault to become insolvent. This creates a critical financial risk, though the likelihood is reduced due to the protected role of skimRecipient. The impact is high due to potential insolvency, but the overall severity is medium due to lower exploit likelihood.\n",
            "severity": "Medium",
            "location": [
                "CompoundV3Adapter.sol#L55-L60"
            ],
            "files": [
                "debt-fund-vault-v2/src/adapters/CompoundV3Adapter.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Missing slippage protection in claim functions",
            "description": "Both CompoundV3Adapter and ERC4626MerklAdapter perform token swaps in their claim functions without enforcing minimum output amounts, leaving users exposed to MEV and sandwich attacks. The root cause is the lack of slippage controls during swap execution, where only a minimal check (receiving at least 1 wei) is performed. An attacker could exploit this by frontrunning or backrunning claim transactions to manipulate swap prices and extract value. This could result in significant loss of reward value during liquidation, especially for large claims. The impact ranges from medium to high depending on the value involved, and the likelihood is medium due to partial mitigation via private mempools, leading to a medium severity rating.\n",
            "severity": "Medium",
            "location": [
                "CompoundV3Adapter.sol#L94"
            ],
            "files": [
                "debt-fund-vault-v2/src/adapters/CompoundV3Adapter.sol",
                "debt-fund-vault-v2/src/adapters/ERC4626MerklAdapter.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-184"
                ]
            },
            "title": "Adapters should protect from resetting approval to parent vault",
            "description": "The adapters currently prevent interaction with underlying vaults in claim functions but do not block calls to the parentVault. The root cause is the missing validation that the swapper address is not the parentVault. If a claim function were to call the parentVault directly, it could trigger a reset of the approval between the adapter and the parentVault, potentially disrupting normal operations. While this scenario is unlikely and requires specific conditions, it represents a potential logic flaw. The impact is low as it does not lead to direct fund loss, but it could cause operational issues. The recommendation is to add a require statement to block such calls, hence the low severity.\n",
            "severity": "Low",
            "location": [
                "CompoundV3Adapter.sol#L101",
                "ERC4626MerklAdapter.sol#L125"
            ],
            "files": [
                "debt-fund-vault-v2/src/adapters/CompoundV3Adapter.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1093"
                ]
            },
            "title": "Inefficient data encoding in ERC4626MerklAdapter.claim()",
            "description": "The claim() function in ERC4626MerklAdapter uses an unnecessary wrapper struct (ClaimParams) that combines MerklParams and SwapParams[], leading to extra encoding and decoding overhead. The root cause is suboptimal data structuring, which increases gas consumption during function execution. While this does not pose a security risk, it results in inefficient gas usage, which can raise transaction costs for users. The issue can be exploited by anyone paying higher gas fees, but the intent is not malicious—rather, it reflects poor optimization. The impact is limited to increased operational costs, making this an informational finding focused on code quality and efficiency.\n",
            "severity": "Informational",
            "location": [
                "ERC4626MerklAdapter.sol#L106",
                "ERC4626MerklAdapter.sol#L109-L112"
            ],
            "files": [
                "debt-fund-vault-v2/src/adapters/ERC4626MerklAdapter.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Increase test coverage",
            "description": "The audit identifies insufficient test coverage for key contracts, specifically CompoundV3Adapter and ERC4626MerklAdapter. The root cause is a lack of comprehensive test cases covering all execution paths, which increases the risk of undetected bugs or regressions after code changes. While no immediate exploit exists, this weakens the project's long-term reliability and security assurance. An attacker could potentially discover and exploit edge cases not covered by tests. The impact is indirect but significant over time, as untested code paths may lead to vulnerabilities in future upgrades. This is classified as informational because it does not represent a direct flaw in the current logic, but rather a process improvement.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "debt-fund-vault-v2/src/adapters/CompoundV3Adapter.sol",
                "debt-fund-vault-v2/src/adapters/CompoundV3AdapterFactory.sol",
                "debt-fund-vault-v2/test/integration/CompoundV3IntegrationTest.sol",
                "debt-fund-vault-v2/test/integration/CompoundV3IntegrationClaimTest.sol",
                "debt-fund-vault-v2/src/adapters/ERC4626MerklAdapter.sol",
                "debt-fund-vault-v2/src/adapters/ERC4626MerklAdapterFactory.sol",
                "debt-fund-vault-v2/test/integration/ERC4626MerklAdapterIntegrationTest.sol",
                "debt-fund-vault-v2/test/integration/ERC4626MerklAdapterIntegrationClaimTest.sol",
                "debt-fund-vault-v2/test/integration/ERC4626MerklAdapterIntegrationStataTest.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-691"
                ]
            },
            "title": "Dust accumulation due to time delay between swap data generation and execution",
            "description": "Due to the accrual of reward tokens every second on CompoundV3, a time gap between off-chain data generation and on-chain execution can result in small amounts of \"dust\" tokens accumulating in the adapter. The root cause is the delay in execution, during which additional rewards accrue that are not accounted for in the original swap data. These dust tokens remain locked unless manually handled, leading to inefficient capital use. The fix involved approving the swapper for the full token balance instead of just the claimed amount, allowing it to handle donated or leftover tokens. While this does not lead to direct loss, it affects operational efficiency and token management, hence classified as informational.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "debt-fund-vault-v2/src/adapters/CompoundV3Adapter.sol",
                "debt-fund-vault-v2/src/adapters/CompoundV3AdapterFactory.sol"
            ]
        }
    ]
}