{
    "path": "dataset-curated/reports/Cantina/cantina_coinbase_bridge_aug2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/base/bridge"
        ],
        "commit_id": [
            "c9b24df2"
        ],
        "address": [],
        "chain": "evm/base/solana",
        "compiler_version": "n/a",
        "audit_date": "2023-08-21",
        "project_path": {
            "bridge": "dataset-curated/contracts/cantina_coinbase_bridge_aug2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Unbounded message size could cause temporary fund lock due to Solana transaction limits",
            "description": "The Bridge contract allows users to send messages of arbitrary size from Base to Solana without enforcing size constraints that exist on the Solana side. This asymmetry allows users to send oversized messages that exceed Solana's 1232-byte transaction limit, making them unprocessable. The root cause is the lack of input validation on the Base side before locking funds or burning tokens. An attacker could exploit this by sending a message larger than 1232 bytes, which would fail on Solana, resulting in temporary fund lock. The impact is temporary loss of funds, which could be recovered via a program upgrade, hence classified as medium impact.\n",
            "severity": "Medium",
            "location": [
                "MessageStorageLib.sol#L157",
                "prove_message.rs#L55"
            ],
            "files": [
                "bridge/base/src/libraries/MessageStorageLib.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-362"
                ]
            },
            "title": "Bridge initialization can be frontrun",
            "description": "The bridge initialization function is susceptible to frontrunning attacks. The cause is that the initialization process does not include safeguards such as commit-reveal schemes or timelocks. An attacker can monitor the mempool and submit a competing transaction with a higher gas fee to take control of the initialization process. The impact is potential loss of control over bridge configuration, leading to malicious setup or denial of proper initialization.\n",
            "severity": "Low",
            "location": [
                "initialize.rs#L8-L69"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/lib.rs"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-362"
                ]
            },
            "title": "Frontrunning can block message batch submissions",
            "description": "Adversaries can frontrun legitimate message batch submission transactions. The cause is the absence of anti-frontrunning mechanisms in the batch submission logic. An attacker can observe pending batch submissions and submit their own transaction first, potentially blocking or delaying message processing. The impact is denial of service for message relaying, disrupting cross-chain communication.\n",
            "severity": "Low",
            "location": [
                "Bridge.sol#L335"
            ],
            "files": [
                "bridge/base/src/Bridge.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-369"
                ]
            },
            "title": "Lack of zero-value checks on denominators can lead to denial of service",
            "description": "Mathematical operations in the codebase do not validate denominators for zero values. The cause is missing input validation before division operations. An attacker can provide a zero value where a denominator is expected, causing the transaction to revert. The impact is denial of service by inducing transaction failures in critical functions.\n",
            "severity": "Low",
            "location": [
                "bridge.rs#L51-L53",
                "bridge.rs#L158-L159",
                "bridge.rs#L167-L171"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/lib.rs"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-424"
                ]
            },
            "title": "Pausing does not stop message registration on Base",
            "description": "When the bridge is paused, message registration on the Base chain is still permitted. The cause is incomplete implementation of the pause functionality, failing to cover all relevant functions. An attacker can continue registering messages during a pause state, potentially leading to inconsistent states. The impact is undermines the intended security of the pause mechanism, risking state inconsistency or unintended message processing.\n",
            "severity": "Low",
            "location": [
                "BridgeValidator.sol#L142-L159",
                "register_output_root.rs#L62-L65"
            ],
            "files": [
                "bridge/base/src/BridgeValidator.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-1329"
                ]
            },
            "title": "Stale output root cannot be overridden",
            "description": "Once an output root is submitted, even if it becomes stale, there is no mechanism to override it. The cause is lack of logic to allow updating or replacing outdated output roots. An attacker could exploit the immutability of stale roots to prevent progress or force reliance on outdated data. The impact is potential freeze in message finalization or withdrawal processing due to inability to update state roots.\n",
            "severity": "Low",
            "location": [
                "register_output_root.rs#L28-L35"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/instructions/register_output_root.rs"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1041"
                ]
            },
            "title": "Unnecessary twin contract deployment for simple transfers",
            "description": "The system deploys redundant contracts for simple token transfers, increasing gas costs. The cause is a design choice to use a generalized deployment pattern even for trivial operations. Not directly exploitable, but increases operational costs for users. The impact is higher gas consumption than necessary, reducing efficiency and increasing user fees.\n",
            "severity": "Informational",
            "location": [
                "Bridge.sol#L218-L226"
            ],
            "files": [
                "bridge/base/src/Bridge.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ],
                "3": [
                    "CWE-561"
                ]
            },
            "title": "Remove unused struct, constants and functions",
            "description": "Several structs, constants, and functions are defined but never used in the codebase. The cause is code remnants from development or refactoring. Not a direct security risk, but increases code complexity and maintenance burden. The impact is reduced code clarity and increased risk of confusion during future audits or updates.\n",
            "severity": "Informational",
            "location": [
                "SVMBridgeLib.sol#L8-L22",
                "SVMLib.sol#L76",
                "SVMLib.sol#L99",
                "mod.rs#L23-L29"
            ],
            "files": [
                "bridge/base/src/libraries/SVMBridgeLib.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ],
                "4": [
                    "CWE-1106"
                ]
            },
            "title": "Anchor discriminator magic constant",
            "description": "The use of raw magic constants for Anchor discriminators reduces code readability. The cause is hardcoded values instead of named constants. No direct exploit, but hampers code understanding and maintainability. The impact is increased risk of errors during future development due to unclear intent.\n",
            "severity": "Informational",
            "location": [
                "prove_message.rs#L35",
                "register_output_root.rs#L31",
                "initialize.rs#L27",
                "bridge_call.rs#L46",
                "bridge_sol.rs#L57",
                "bridge_spl.rs#L75",
                "bridge_wrapped_token.rs#L61",
                "bridge_call.rs#L62",
                "bridge_sol.rs#L71",
                "bridge_spl.rs#L87",
                "initialize_call_buffer.rs#L33",
                "wrap_token.rs#L75"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/instructions/prove_message.rs"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "executeCall() does not need to be payable",
            "description": "The executeCall function is marked as payable despite not requiring Ether. The cause is incorrect function modifier usage. Could mislead developers into thinking Ether can be sent, potentially leading to lost funds. The impact is confusion in interface expectations and possible user errors.\n",
            "severity": "Informational",
            "location": [
                "Twin.sol#L84"
            ],
            "files": [
                "bridge/base/src/Twin.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ],
                "3": [
                    "CWE-561"
                ]
            },
            "title": "Unused payer account in RelayMessage",
            "description": "The RelayMessage instruction includes a payer account that is not utilized. The cause is leftover from prior design iterations. No direct risk, but adds unnecessary complexity. The impact is increased account validation overhead and reduced code clarity.\n",
            "severity": "Informational",
            "location": [
                "relay_message.rs#L16-L18"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/instructions/relay_message.rs"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1093"
                ]
            },
            "title": "Unnecessary Pda struct increases code complexity",
            "description": "A dedicated Pda struct is used where simpler alternatives would suffice. The cause is over-engineering of account management logic. No security impact, but complicates code review. The impact is higher cognitive load for auditors and developers.\n",
            "severity": "Informational",
            "location": [
                "ix.rs#L30-L36"
            ],
            "files": []
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1041"
                ]
            },
            "title": "Unnecessary signature length check",
            "description": "The code performs a signature length check that is redundant due to Solana's runtime validation. The cause is duplicated validation logic. No benefit, only increases gas usage slightly. The impact is wasted computation and higher transaction costs.\n",
            "severity": "Informational",
            "location": [
                "signatures.rs#L49-L52"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/internal/signatures.rs"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Incorrect validation for signature recovery ID",
            "description": "The validation logic for the signature recovery ID is incorrect or incomplete. The cause is flawed implementation of ECDSA recovery checks. Could allow invalid signatures to pass verification under certain conditions. The impact is potential for signature forgery or authentication bypass if exploited.\n",
            "severity": "Informational",
            "location": [
                "signatures.rs#L56-L58"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/internal/signatures.rs"
            ]
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ],
                "4": [
                    "CWE-1099"
                ]
            },
            "title": "Misleading variable name for mint account",
            "description": "A variable related to a mint account is named in a way that misrepresents its purpose. The cause is poor naming convention during development. Could lead developers to misuse the account in downstream logic. The impact is risk of logical errors due to misunderstanding of the variable's role.\n",
            "severity": "Informational",
            "location": [
                "metadata.rs#L122-L125",
                "metadata.rs#L124-L127"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/common/internal/metadata.rs"
            ]
        },
        {
            "id": 15,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ],
                "3": [
                    "CWE-672"
                ]
            },
            "title": "Sol vault balance dropping below rent exemption can halt relaying message on Solana",
            "description": "If the Solana vault's balance falls below rent-exemption threshold, it may be reclaimed, halting message relaying. The cause is no mechanism to ensure minimum balance is maintained. An attacker could drain the vault to below rent-exemption level via repeated withdrawals or fee accumulation. The impact is complete halt of message relaying from Solana, causing cross-chain disruption.\n",
            "severity": "Informational",
            "location": [
                "finalize_sol_transfer.rs#L33"
            ],
            "files": []
        },
        {
            "id": 16,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-269"
                ],
                "3": [
                    "CWE-250"
                ]
            },
            "title": "Unnecessary mutable attribute for signer account",
            "description": "A signer account is marked as mutable when mutation is not required. The cause is over-permissioned account in instruction definition. No direct exploit, but violates principle of least privilege. The impact is increased risk of unintended state changes if logic evolves.\n",
            "severity": "Informational",
            "location": [
                "append_to_call_buffer.rs#L10-L13"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/solana_to_base/instructions/buffered/append_to_call_buffer.rs"
            ]
        },
        {
            "id": 17,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-665"
                ],
                "3": [
                    "CWE-1419"
                ],
                "4": [
                    "CWE-1052"
                ]
            },
            "title": "initialize_call_buffer() reverts for buffer sizes over 10KB",
            "description": "The initialize_call_buffer function reverts when attempting to create buffers larger than 10KB. The cause is hardcoded size limit without dynamic allocation support. Could be used to disrupt large message batching by forcing initialization failure. The impact is limits scalability and robustness of message relaying under high load.\n",
            "severity": "Informational",
            "location": [
                "initialize_call_buffer.rs#L30-L36"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/solana_to_base/instructions/buffered/initialize_call_buffer.rs"
            ]
        },
        {
            "id": 18,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Inaccurate error documentation in VerificationLib",
            "description": "Error codes or messages in VerificationLib are not accurately documented. The cause is documentation not updated after code changes. Misleads developers and integrators about expected failure modes. The impact is increased debugging time and potential misinterpretation of failures.\n",
            "severity": "Informational",
            "location": [
                "VerificationLib.sol#L59"
            ],
            "files": [
                "bridge/base/src/libraries/VerificationLib.sol"
            ]
        },
        {
            "id": 19,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Integer division truncation in TokenLib",
            "description": "Integer division operations in TokenLib truncate remainders, leading to precision loss. The cause is use of standard integer division without rounding or remainder handling. Could be exploited in fee calculation or token conversion logic to accumulate small losses. The impact is economic inefficiency and potential fund leakage over time.\n",
            "severity": "Informational",
            "location": [
                "TokenLib.sol#L169-L175"
            ],
            "files": [
                "bridge/base/src/libraries/TokenLib.sol"
            ]
        },
        {
            "id": 20,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Inconsistent threshold configuration for validators",
            "description": "Validator threshold settings differ across components, leading to potential quorum mismatches. The cause is lack of centralized configuration management. Could result in failed consensus or rejected valid messages. The impact is reduced reliability and fault tolerance of the validation process.\n",
            "severity": "Informational",
            "location": [
                "BridgeValidator.sol#L29-L31"
            ],
            "files": [
                "bridge/base/src/BridgeValidator.sol"
            ]
        },
        {
            "id": 21,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ],
                "4": [
                    "CWE-778"
                ]
            },
            "title": "Inconsistent event emission on the Solana program",
            "description": "Events are emitted inconsistently across different functions in the Solana program. The cause is ad-hoc event logging without a unified standard. No direct exploit, but hampers monitoring and indexing. The impact is reduced observability and difficulty in tracking message flow.\n",
            "severity": "Informational",
            "location": [
                "guardian.rs#L18-L21"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/lib.rs",
                "bridge/solana/programs/bridge/src/base_to_solana/instructions/relay_message.rs"
            ]
        },
        {
            "id": 22,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ]
            },
            "title": "Inconsistent validator limit between contracts",
            "description": "Different contracts enforce different maximum validator counts. The cause is decentralized configuration without synchronization. Could lead to state divergence or failed upgrades. The impact is operational friction during governance or key rotation.\n",
            "severity": "Informational",
            "location": [
                "VerificationLib.sol#L11-L15",
                "VerificationLib.sol#L91-L103",
                "VerificationLib.sol#L120-L132",
                "bridge.rs#L201-L202"
            ],
            "files": [
                "bridge/base/src/libraries/VerificationLib.sol"
            ]
        },
        {
            "id": 23,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ]
            },
            "title": "Unhelpful error message when trying to register a 0-length array",
            "description": "Attempting to register an empty array returns a generic or unclear error. The cause is lack of specific input validation with descriptive errors. No direct exploit, but degrades user experience. The impact is increased difficulty in debugging client-side issues.\n",
            "severity": "Informational",
            "location": [
                "BridgeValidator.sol#L142"
            ],
            "files": [
                "bridge/base/src/BridgeValidator.sol"
            ]
        },
        {
            "id": 24,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Message execution flag could be set before CPI calls for enhanced safety",
            "description": "The message execution flag is updated after CPI calls, which could leave the system in an inconsistent state if the call fails. The cause is suboptimal ordering of state updates relative to external calls. If a CPI fails after the flag is set, the message may be marked as executed without actual completion. The impact is state inconsistency and potential double-execution or skipped messages.\n",
            "severity": "Informational",
            "location": [
                "relay_message.rs#L84"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/instructions/relay_message.rs"
            ]
        },
        {
            "id": 25,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "In fix: overly permissive account encoding of Solana accounts",
            "description": "The current implementation allows overly permissive account encoding, which may allow unintended accounts to be accepted. The cause is insufficient validation of account data layout or ownership. An attacker could craft a malicious account that passes encoding checks but violates protocol rules. The impact is potential for unauthorized access or state corruption.\n",
            "severity": "Informational",
            "location": [
                "SVMLib.sol::validateIxs"
            ],
            "files": [
                "bridge/solana/programs/bridge/src/base_to_solana/instructions/register_output_root.rs"
            ]
        }
    ]
}