{
    "path": "dataset-curated/reports/Cantina/cantina_revert_sept2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/revert-finance/lend"
        ],
        "commit_id": [
            "f4190ae9"
        ],
        "address": [],
        "chain": "n/a",
        "compiler_version": "n/a",
        "audit_date": "2023-09-12",
        "project_path": {
            "lend": "dataset-curated/contracts/cantina_revert_sept2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Incorrect onERC721Received Logic Causes Staked Positions to be Undetectable, Breaking Liquidation & NFT Return Flows",
            "description": "The vulnerability lies in the `onERC721Received` function of the vault, which fails to distinguish between newly deposited NFTs and NFTs being returned from unstaking. The function assumes every incoming NFT is a new deposit by checking only if `oldTokenId == 0`, leading it to overwrite existing loan state and incorrectly assign ownership when an unstaked NFT is returned. This flaw arises due to the lack of validation of the NFT's prior ownership status. An attacker could exploit this by unstaking an NFT, causing the system to wipe the associated loan data, thereby making the position unliquidatable. The impact includes the permanent loss of user NFTs during unstaking and the breakdown of critical liquidation and return mechanisms, severely compromising the protocol's financial integrity.\n",
            "severity": "Critical",
            "location": [],
            "files": [
                "lend/src/V3Vault.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Gauge address is not properly verified",
            "description": "The `setGauge` function in the GaugeManager contract does not verify that the provided gauge address corresponds to the actual gauge associated with the given pool. This omission allows the owner to potentially set an incorrect or malicious gauge address. The root cause is the absence of a validation check against the pool's expected gauge (as defined in CLPool.sol). An attacker with ownership privileges could set a rogue gauge, leading to misrouted rewards or incorrect staking operations. This could result in financial loss or disruption of staking functionality, though the risk is mitigated by the fact that only the owner can call the function.\n",
            "severity": "Low",
            "location": [
                "GaugeManager.sol#L77"
            ],
            "files": [
                "lend/src/GaugeManager.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Missing validation of max aeroSplitBps",
            "description": "The `compoundRewards` and `executeV3UtilsWithOptionalCompound` functions do not validate that the `aeroSplitBps` parameter is within the valid range (≤10,000 basis points). This lack of input validation could allow a user to specify a value exceeding 100%, leading to arithmetic overflows or unintended token distributions. The cause is the missing `require` statement to cap the value. An attacker could exploit this by providing a large `aeroSplitBps` value, potentially draining protocol funds through miscalculated swaps. The impact includes potential loss of funds due to incorrect swap amounts, though the risk is considered low due to the narrow exploitation path.\n",
            "severity": "Low",
            "location": [
                "GaugeManager.sol#L212"
            ],
            "files": [
                "lend/src/GaugeManager.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "Missing input validation in the create function",
            "description": "The `create` function in the V3Vault contract lacks validation of the `recipient` parameter, allowing it to be set to the zero address. This could result in tokens being sent to an invalid or non-recoverable address. The root cause is the absence of a basic input check. An attacker could call the function with `address(0)` as the recipient, leading to permanent loss of the associated NFT. While the impact is limited to individual user errors, it represents a preventable risk that undermines user safety.\n",
            "severity": "Low",
            "location": [
                "V3Vault.sol#L355"
            ],
            "files": [
                "lend/src/V3Vault.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-684"
                ],
                "3": [
                    "CWE-440"
                ]
            },
            "title": "totalAssets does not follow the ERC-4626 standard specification",
            "description": "The `totalAssets` function in the vault contract only returns the idle balance of the underlying asset, excluding outstanding lent assets and accrued interest. This violates the ERC-4626 standard, which requires `totalAssets` to reflect all assets under management, including lent amounts. The cause is an incomplete implementation that fails to include debt with interest. External integrators relying on this function will receive inaccurate TVL data, leading to misleading analytics, incorrect pricing, and potential integration failures. Although internal accounting remains correct, the external interface misrepresents the vault's true asset value, posing a risk to ecosystem compatibility.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "lend/src/V3Vault.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unnecessary approval in migrateToVault",
            "description": "The `migrateToVault` function in GaugeManager unnecessarily approves the vault to transfer an NFT before using `safeTransferFrom`, which already includes the recipient in the data payload and does not require prior approval. This redundant approval increases gas costs without providing any security benefit. The cause is an inefficient use of the ERC721 interface. While the impact is limited to wasted gas, it represents a suboptimal implementation that could be exploited in gas-sensitive contexts. Removing the approval would improve efficiency and reduce transaction costs.\n",
            "severity": "Informational",
            "location": [
                "GaugeManager.sol#L563"
            ],
            "files": [
                "lend/src/GaugeManager.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-477"
                ]
            },
            "title": "Stale approval system",
            "description": "The GaugeManager and Swapper contracts use a legacy ERC20 approval pattern that first sets allowance to zero before increasing it, even when unnecessary. This pattern, while functional, is inefficient and outdated, especially for tokens that do not require zeroing. The cause is the use of `safeApprove(0)` followed by `safeIncreaseAllowance`, instead of using modern alternatives like `forceApprove`. This results in higher gas costs and unnecessary transactions. The impact is increased operational expenses and reduced efficiency, though there is no direct security risk. Migrating to `forceApprove` would streamline approvals and reduce gas usage.\n",
            "severity": "Informational",
            "location": [
                "GaugeManager.sol#L240",
                "GaugeManager.sol#L438",
                "GaugeManager.sol#L511-L518",
                "Swapper.sol#L105"
            ],
            "files": [
                "lend/src/GaugeManager.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1041"
                ]
            },
            "title": "_addTokenToOwner should emit the Add event",
            "description": "The `Add` event is emitted in two separate locations within the `onERC721Received` function, duplicating logic that could be centralized in the `_addTokenToOwner` function. This redundancy increases code complexity and the risk of inconsistent event emission. The cause is poor code organization. By moving the event emission into `_addTokenToOwner` and passing `oldTokenId` as a parameter, the code can be simplified and made more maintainable. The impact is primarily on code quality and readability, with no direct security implications, but it improves long-term maintainability.\n",
            "severity": "Informational",
            "location": [
                "V3Vault.sol#L389"
            ],
            "files": [
                "lend/src/V3Vault.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused code across the repository",
            "description": "The repository contains several instances of unused code, including unused error definitions in Constants.sol, redundant imports in AutoCompound.sol, GaugeManager.sol, and V3Vault.sol. These elements do not contribute to the contract functionality and increase code bloat. The cause is leftover development artifacts or incomplete cleanup. While there is no security risk, the presence of unused code reduces readability and maintainability, making audits and future development more difficult. Removing these lines would improve code clarity and reduce potential confusion.\n",
            "severity": "Informational",
            "location": [
                "Constants.sol#L4"
            ],
            "files": [
                "lend/src/utils/Constants.sol",
                "lend/src/GaugeManager.sol",
                "lend/src/V3Vault.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ],
                "3": [
                    "CWE-394"
                ]
            },
            "title": "Incorrect PUSH pattern used when collecting staking rewards",
            "description": "The protocol uses a PUSH pattern to send staking rewards directly to users during operations like liquidation. This approach is risky because if the reward token (e.g., aeroToken) has transfer restrictions or is ETH, a malicious recipient could block the transfer, causing a denial-of-service (DOS) for critical functions like liquidation. The cause is the use of direct transfers instead of a pull-based system. The recommended solution is to implement a pull mechanism where users claim rewards via a separate function. This would prevent DOS attacks and ensure the reliability of liquidation and other reward-distributing operations.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "lend/src/GaugeManager.sol"
            ]
        }
    ]
}