{
    "path": "dataset-curated/reports/Cantina/cantina_sky_solana_bridge_migration_nov2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/sky-ecosystem/sky-oapp-oft",
            "https://github.com/sky-ecosystem/lz-governance-relay",
            "https://github.com/sky-ecosystem/sky-ntt-migration",
            "https://github.com/keel-fi/crosschain-gov-solana-spell-payloads",
            "https://github.com/sky-ecosystem/wh-lz-migration"
        ],
        "commit_id": [
            "8d7309d60caa1194cd8be67e26f3b8a669cc096a",
            "d3e3df4",
            "832781e",
            "11baa180d4ad6c7579c69c8c0168e17cb73bb6ed",
            "1739787"
        ],
        "address": [
            "0xdc035d45d973e3ec169d2276ddab16f1e407384f",
            "0x2bebfe397d497b66cb14461cb6ee467b4c3b7d61",
            "0x27fc1dd771817b53be48dc28789533bea53c9cca",
            "0x1e1d42781fc170ef9da004fb735f56f0276d01b8",
            "0x37c618755832ef5ca44fa88bf1ccdce46f30b479",
            "0xd4dd90bac23e2a1470681e7cafdd381fe44c3430",
            "0x7d4958454a3f520bda8be764d06591b054b0bf33",
            "USDSwr9ApdHk5bvJKMjzff41FfuX8bSxdKcR81vTwcA",
            "8GVwe5nYwqkC9udmj1LsGMD5pYDq2ZtKH9YNrzWzV3Z2",
            "SKYGRikJcGSa3jC5HDyzDrVsmkCk3e5SqAurycny8PW",
            "SKYTAiJRkgexqQqFoqhXdCANyfziwrVrzjhBaCzdbKW",
            "STTUVCMPuNbk21y1J6nqEGXSQ8HKvFmFBKnCvKHTrWn"
        ],
        "chain": "solana/ethereum",
        "compiler_version": "n/a",
        "audit_date": "2025-11-05",
        "project_path": {
            "cantina_sky_solana_bridge_migration_nov2025.pdf-source": "dataset-curated/contracts/cantina_sky_solana_bridge_migration_nov2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "Incorrect newMintAuthority in the payload to migrate the USDS mint authority on Solana from NTT to OFT",
            "description": "The vulnerability involves an incorrect `newMintAuthority` being specified in the cross-chain governance payload intended to transfer the USDS mint authority from the Wormhole NTT program to the LayerZero OFT program on Solana. The root cause is a misconfiguration in the payload generation process, where the intended recipient authority (OFT Store PDA) may not have been correctly referenced during construction. An attacker could potentially exploit this by intercepting or substituting the payload if validation mechanisms are weak, leading to the mint authority being transferred to an unintended or insecure address. The impact of a successful exploit would be catastrophic, as it would allow unauthorized minting of USDS tokens, resulting in unlimited inflation and complete loss of trust in the stablecoin's peg and supply integrity.\n\n1. **Description:** The USDS token on Solana uses a mint authority controlled by an NTT program PDA. During migration to LayerZero OFT, the mint authority must be transferred to the OFT Store PDA (BEvTHkTyXooyaJzP8egDUC7WQK8cyRrq5WvERZNWhuah). However, the payload incorrectly specified AYPtjx4Hc8us1ikULUedkmZ3wtiD6tmL7gK3qe4V3oHt as the new mint authority, which is the SKY_LZ_GOVERNANCE_CPI_AUTHORITY.\n\n2. **Cause:** The error originated from an incorrect comment in a pull request, leading to the wrong PDA being used in the configuration script that generated the governance payload.\n\n3. **Exploitation:** If executed, the incorrect authority assignment would prevent the OFT system from minting new USDS tokens on Solana when users deposit on Ethereum, disrupting the token's cross-chain functionality.\n\n4. **Impact:** This would halt the ability to mint USDS on Solana via the OFT bridge, breaking the two-way peg mechanism. However, since the incorrect authority is still governed by Sky governance, a follow-up governance action could reassign the mint authority to the correct account, mitigating permanent damage.\n",
            "severity": "Medium",
            "location": [
                "ntt-transfer-mint-authority-mainnet",
                "USDSwr9ApdHk5bvJKMjzff41FfuX8bSxdKcR81vTwcA",
                "BEvTHkTyXooyaJzP8egDUC7WQK8cyRrq5WvERZNWhuah",
                "ntt-transfer-mint-authority-mainnet.txt"
            ],
            "files": [
                "11baa180d4ad6c7579c69c8c0168e17cb73bb6ed/crosschain-gov-solana-spell-payloads/src/constants.ts"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-345"
                ],
                "3": [
                    "CWE-348"
                ]
            },
            "title": "Migration test run on Solana devnet upgraded the NTTManager to an incorrect older version",
            "description": "During a migration test on Solana devnet, the NTTManager was incorrectly upgraded to an outdated version instead of the intended audited version. This misstep occurred due to human or procedural error in selecting the correct program buffer during the upgrade process. While the mainnet deployment used the correct audited version (626962a), the devnet test did not reflect the actual production state, which undermines the reliability of pre-deployment testing and increases the risk of undetected configuration drift. An attacker could exploit similar confusion in future upgrades if proper version control and verification procedures are not enforced, potentially leading to the deployment of vulnerable or malicious code. The impact is limited because the error was caught before mainnet deployment, but it highlights operational risks in the upgrade process that could lead to serious consequences if repeated in production.\n\n1. **Description:** During a test run of the USDS bridge migration on Solana devnet, the NTTManager was upgraded using an outdated version of the NTT program (commit 832781e), which included deprecated logic for owner checks during mint authority transfer.\n\n2. **Cause:** The test environment used an older version of the NTT program that contained an assert-based owner check (`assert!(ctx.accounts.config.owner == ctx.accounts.payer.key())`) instead of the updated logic intended for mainnet.\n\n3. **Exploitation:** If such a version mismatch were to occur on mainnet, an attacker could potentially exploit the deprecated logic to bypass ownership checks during critical operations like mint authority transfer, especially if the payer account is manipulated or impersonated.\n\n4. **Impact:** Although the incorrect version was only deployed on devnet, a similar mistake on mainnet could allow unauthorized changes to the NTTManager configuration, including transferring ownership or minting rights, leading to loss of control over the USDS token ecosystem.\n",
            "severity": "Low",
            "location": [
                "NTTManager",
                "626962a",
                "722c14f4b9cf6073367354bc78bd60fa49b871e6",
                "transfer_mint_authority.rs#L41"
            ],
            "files": [
                "832781e/sky-ntt-migration/solana/solana-devnet.yaml",
                "832781e/sky-ntt-migration/sdk/__tests__/utils.ts",
                "832781e/sky-ntt-migration/evm/README.md"
            ]
        }
    ]
}