{
    "path": "dataset-curated/reports/Cantina/cantina_sky_grove_alm_controller_july2025.pdf",
    "project_info": {
        "url": [
            "https://github.com/grove-labs/grove-alm-controller"
        ],
        "commit_id": [
            "1658e2034e0149ae1f5db0692370822008417903"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": null,
        "project_path": {
            "grove-alm-controller": "dataset-curated/contracts/cantina_sky_grove_alm_controller_july2025.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-437"
                ]
            },
            "title": "Relayer can choose remoteExtraGasLimit for transferSharesCentrifuge",
            "description": "1. **Description:** The transferSharesCentrifuge function allows the relayer to specify a remoteExtraGasLimit parameter of type uint128. However, this parameter is not used in the current implementation of Centrifuge V3, as both execution paths in MessageDispatcher.sendExecuteTransferShares ignore it.\n\n2. **Cause:** The function includes a parameter that has no effect on execution, likely due to an outdated or misaligned interface design with the target protocol (Centrifuge V3).\n\n3. **Exploitation:** While the parameter is currently ignored, a relayer could set arbitrary values, potentially leading to confusion or future vulnerabilities if the parameter is later used without proper validation. It may also mislead developers into assuming gas limits are enforced.\n\n4. **Impact:** The primary impact is code clarity and maintainability. If future versions of Centrifuge V3 start using this parameter, unvalidated inputs could lead to gas-related attacks or failed transactions. Additionally, it increases the risk of incorrect assumptions during integration or upgrades.\n",
            "severity": "Low",
            "location": [
                "ForeignController.sol::transferSharesCentrifuge"
            ],
            "files": [
                "grove-alm-controller/src/ForeignController.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-665"
                ],
                "3": [
                    "CWE-909"
                ],
                "4": [
                    "CWE-456"
                ]
            },
            "title": "Missing initialization of centrifugeRecipients in deployment scripts",
            "description": "1. **Description:** The initialization scripts set mintRecipients for CCTP and layerZeroRecipients for LayerZero bridges but fail to initialize centrifugeRecipients for similar functionality.\n\n2. **Cause:** The deployment scripts omit a call to setCentrifugeRecipient after setting other recipient types, creating an inconsistent state.\n\n3. **Exploitation:** If the system relies on centrifugeRecipients for message routing or access control, the uninitialized state could block legitimate operations or allow unauthorized behavior.\n\n4. **Impact:** This could lead to a denial of service for Centrifuge-related functionality or inconsistent behavior across bridge mechanisms. The impact depends on whether centrifugeRecipients are enforced in the logic.\n",
            "severity": "Medium",
            "location": [
                "ForeignControllerInit"
            ],
            "files": [
                "grove-alm-controller/deploy/ForeignControllerInit.sol"
            ]
        }
    ]
}