{
    "path": "dataset-curated/reports/ChainSecurity/ChainSecurity_Sky_RatesConverter_Audit.pdf",
    "project_info": {
        "url": [
            "https://github.com/dewiz-xyz/rates-conv"
        ],
        "commit_id": [
            "26921f3e5aa6bd346d279241c2d1b794ba90c1ae"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-07-23",
        "project_path": {
            "rates-conv": "dataset-curated/contracts/ChainSecurity_Sky_RatesConverter_Audit.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Incorrect Usage of Keccak Opcode",
            "description": "1. **Description:** In the btor() function, the storage slot for per-second rate data is incorrectly computed using the keccak256 assembly opcode. The code attempts to compute dataSlot using keccak256(RATES.slot, 0x20), but passes an incorrect memory pointer.\n2. **Cause:** The assembly code calls keccak256(RATES.slot, 0x20), which interprets RATES.slot as a memory pointer rather than a value to be hashed. This results in hashing 32 bytes starting from memory offset 0, which is uninitialized, instead of hashing the actual value of RATES.slot.\n3. **Exploitation:** Although the incorrect usage leads to undefined behavior, it coincidentally works because RATES.slot is 0, so the hash of memory at position 0 (which is also 0) produces the correct result. However, this would break if RATES.slot were non-zero, leading to incorrect storage access and potential data corruption or incorrect rate conversion.\n4. **Impact:** The vulnerability could result in incorrect storage slot computation, leading to reading or writing data from the wrong storage location, which may cause functional failures or incorrect rate conversions. However, due to the specific value of RATES.slot being 0, the impact was mitigated in practice, but the code remains fragile and incorrect.\n",
            "severity": "Low",
            "location": [
                "Conv.sol::btor#"
            ],
            "files": [
                "src/Conv.sol"
            ]
        }
    ]
}