{
    "path": "dataset-curated/reports/ChainSecurity/ChainSecurity_Gelato_GelatoSmartWallet_Audit.pdf",
    "project_info": {
        "url": [
            "https://github.com/gelatodigital/smartwallet-contracts"
        ],
        "commit_id": [
            "2e4018e9880ccfae7f49b26cba176aec32878158"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-06-13",
        "project_path": {
            "smartwallet-contracts": "dataset-curated/contracts/ChainSecurity_Gelato_GelatoSmartWallet_Audit.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ]
            },
            "title": "Transient Validator Variable Override",
            "description": "This vulnerability involves the use of a single transient state variable `transientValidator` in the Delegation contract, which is set during the `validateUserOp` call and later used in the `execute` phase. The root cause is the shared mutable state across multiple UserOperations from the same account within a single bundle processed by the EntryPoint. Since the EntryPoint loops through all UserOperations and calls `validateUserOp` before starting execution, if two operations from the same account are included, the second validation overwrites the validator set by the first. During execution, the first operation may then use the validator from the second operation, leading to incorrect post-execution checks. An attacker could exploit this by bundling malicious operations to bypass intended validator logic, potentially allowing unauthorized execution flows or circumventing critical post-execution validations. The impact includes a compromise in the integrity of the validation-execution sequence, undermining the security model of EIP-4337 compliant account abstraction.\n",
            "severity": "Medium",
            "location": [
                "Delegation.sol::validateUserOp",
                "Delegation.sol::execute"
            ],
            "files": [
                "smartwallet-contracts/src/Delegation.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "ERC-1155 Compliance",
            "description": "The contract initially failed to comply with the ERC-1155 standard, which requires smart contracts to implement the `supportsInterface` function and return true for the `IERC1155TokenReceiver` interface when queried. The absence of this function meant that the contract could not safely receive ERC-1155 token transfers, as compliant token contracts would revert transfers to receivers that do not declare support via ERC-165. The cause was a missing implementation of the `supportsInterface` function. This could be exploited by preventing legitimate token deposits into the wallet, leading to loss of functionality and user funds being stuck externally. The impact is limited to interoperability and correctness rather than direct fund loss, hence classified as Low severity. The issue was resolved by adding the required `supportsInterface` implementation.\n",
            "severity": "Low",
            "location": [
                "Delegation.sol::supportsInterface"
            ],
            "files": [
                "smartwallet-contracts/src/Delegation.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Event Indexing",
            "description": "The events `ValidatorAdded` and `ValidatorRemoved` were not indexed, making it inefficient or impossible for off-chain services (e.g., indexers, wallets, monitoring tools) to filter logs by the validator address. While the events are emitted correctly, the lack of indexing on the `validator` parameter reduces the usability and observability of the system. The root cause is the omission of the `indexed` keyword in the event definitions. This does not pose a direct security risk but hampers tooling integration and real-time tracking of critical administrative actions. An attacker cannot directly exploit this, but it indirectly affects security monitoring and response capabilities. The impact is minimal, limited to operational visibility, and thus classified as Informational. The issue was resolved by adding the `indexed` keyword to the validator parameter in both events.\n",
            "severity": "Informational",
            "location": [
                "Delegation.sol::ValidatorAdded",
                "Delegation.sol::ValidatorRemoved"
            ],
            "files": [
                "smartwallet-contracts/src/Delegation.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ],
                "3": [
                    "CWE-561"
                ]
            },
            "title": "Unused Error",
            "description": "The error `InvalidSignatureLength` was declared in the contract but never used anywhere in the codebase. This creates unnecessary code bloat and can mislead developers into thinking the error is handled or expected in certain flows. The root cause is a leftover artifact from prior development iterations. There is no direct exploit path, but such dead code increases maintenance burden and can obscure real issues during audits or reviews. The impact is negligible from a security standpoint, but it affects code clarity and quality. Therefore, it is classified as Informational. The error was removed during the audit to clean up the codebase.\n",
            "severity": "Informational",
            "location": [
                "Delegation.sol::InvalidSignatureLength"
            ],
            "files": [
                "smartwallet-contracts/src/Delegation.sol"
            ]
        }
    ]
}