{
    "path": "dataset-curated/reports/ChainSecurity/ChainSecurity_Polymarket_UMASportsOracle_Audit.pdf",
    "project_info": {
        "url": [
            "https://github.com/UMAprotocol/protocol"
        ],
        "commit_id": [
            "cfd11de0f83f247817420a9facd946022f6e1b24"
        ],
        "address": [
            "0xee3afe347d5c74317041e2618c49534daf887c24",
            "0xBEd4c1FC0FD95A2020EC351379b22d8582B904e3"
        ],
        "chain": "polygon",
        "compiler_version": "v0.8.9+commit.e5eed63a",
        "audit_date": "2025-03-11",
        "project_path": {
            "ChainSecurity_Polymarket_UMASportsOracle_Audit.pdf-source": "dataset-curated/contracts/ChainSecurity_Polymarket_UMASportsOracle_Audit.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-437"
                ]
            },
            "title": "UMA Oracle Allows Creating Undisputable Games",
            "description": "A vulnerability exists in the integration between UmaSportsOracle and UMA's OptimisticOracleV2, where oracle requests with more than 8066 bytes of ancillary data can be created but not disputed. The root cause lies in the fact that while OptimisticOracleV2 allows up to 8139 bytes of ancillary data, the dispute process fails due to size constraints in the cross-chain bridging mechanism (OracleChildTunnel), which appends metadata and causes the total size to exceed the 8192-byte limit enforced by OracleBaseTunnel. As a result, disputes revert, making such oracle requests effectively undisputable. An attacker could exploit this by creating a game with large ancillary data, proposing an incorrect result, and ensuring it is accepted without dispute due to the inability to challenge it. This leads to incorrect resolution of sports markets tied to the game, resulting in unfair payouts and loss of user funds.\n",
            "severity": "Medium",
            "location": [
                "UmaSportsOracle.sol",
                "OptimisticOracleV2.sol::disputePrice#",
                "OracleChildTunnel.sol::_requestPrice",
                "OracleBaseTunnel.sol::_requestPrice"
            ],
            "files": [
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/monitor-v2/src/monitor-polymarket/abi/umaSportsOracle.json",
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/core/contracts/polygon-cross-chain-oracle/OracleChildTunnel.sol",
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/core/contracts/polygon-cross-chain-oracle/OracleBaseTunnel.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Cancel Does Not Refund Game Creator",
            "description": "When a game is canceled (indicated by the oracle returning type(uint256).max), the contract fails to refund the game creator, unlike in the case of a normal settlement. This inconsistency stems from the _cancelGame function not including a refund mechanism, despite the economic expectation that canceled games should return funds similar to settled ones. An attacker could exploit this by creating games with large rewards and triggering cancellation outcomes, causing the reward to be permanently locked in the contract. The impact is a loss of funds for game creators in the event of cancellation, undermining trust and economic fairness in the system.\n",
            "severity": "Low",
            "location": [
                "UmaSportsOracle.sol::_cancelGame"
            ],
            "files": [
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/monitor-v2/src/monitor-polymarket/abi/umaSportsOracle.json"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ],
                "4": [
                    "CWE-778"
                ]
            },
            "title": "Missing Arguments In Events",
            "description": "The GameCreated and MarketCreated events lack critical parameters necessary for off-chain systems to correctly interpret the on-chain state. Specifically, GameCreated does not emit the ordering (home vs away), and MarketCreated does not include the underdog parameter for Spread markets. This omission is due to incomplete event logging in the respective functions. As a result, external systems such as UIs or indexing services cannot reliably reconstruct market conditions, leading to potential misrepresentation of market rules. While this does not directly enable exploitation, it increases the risk of user error and reduces transparency, especially in permissionless market creation.\n",
            "severity": "Low",
            "location": [
                "UmaSportsOracle.sol::createGame",
                "UmaSportsOracle.sol::_createMarket"
            ],
            "files": [
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/monitor-v2/src/monitor-polymarket/abi/umaSportsOracle.json"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "ready() Can Return True When Request Can Not Be Settled",
            "description": "The ready() view function incorrectly returns true in states where settlement should not proceed. It relies solely on the hasPrice() check from the Optimistic Oracle, which returns true for Expired, Resolved, and Settled states. However, the function does not account for cases where the result is TOO_EARLY_RESPONSE (requiring a new request), the game is paused, or the game is already in a final state (Settled, Canceled, EmergencySettled). This flaw arises from insufficient state validation. As a result, external systems relying on ready() may attempt settlement at invalid times, leading to failed transactions or incorrect assumptions about game resolution readiness, causing user confusion and potential front-end errors.\n",
            "severity": "Low",
            "location": [
                "UmaSportsOracle.sol::ready"
            ],
            "files": [
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/monitor-v2/src/monitor-polymarket/abi/umaSportsOracle.json"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Admin Can Irrecoverably Break Market",
            "description": "The emergencyResolveMarket function lacks proper validation of the payouts array, allowing the admin to pass arrays longer than two elements or with extremely large values (e.g., type(uint256).max). This can lead to the market being marked as EmergencyResolved while the actual payouts in the Conditional Token Framework (CTF) remain unset, or cause overflows during token redemption due to unchecked multiplication. The root cause is missing input validation in emergencyResolveMarket. An admin (or compromised admin key) could exploit this to render a market permanently unusable, preventing users from redeeming their tokens. This results in permanent loss of access to funds for token holders, despite the admin role being trusted.\n",
            "severity": "Informational",
            "location": [
                "UmaSportsOracle.sol::emergencyResolveMarket",
                "ConditionalTokens.sol::redeemPositions#line 242"
            ],
            "files": [
                "bcdad43734cf94a3a8c0a5020b10edc7df4f2450/protocol/packages/monitor-v2/src/monitor-polymarket/abi/umaSportsOracle.json"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ]
            },
            "title": "Ambiguous Naming of Internal Functions",
            "description": "The internal functions _isGameCreated and _isMarketCreated are misleadingly named, as they do not check whether a game or market is in the \"Created\" state, but rather whether they exist in the mapping. This misnaming can lead to confusion during code review or maintenance, increasing the risk of logic errors. For example, a developer might assume the function checks state, when it only checks existence. While this does not introduce a direct security vulnerability, it reduces code clarity and maintainability, potentially leading to bugs in future updates.\n",
            "severity": "Informational",
            "location": [
                "UmaSportsOracle.sol::_isGameCreated",
                "UmaSportsOracle.sol::_isMarketCreated"
            ],
            "files": []
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Inaccurate Comments",
            "description": "Several Natspec comments in the codebase are inaccurate or incomplete. For example, the reward parameter in createGame is described as being paid to both proposers and disputers, but in reality, it is only paid to proposers due to event-based request refunds on dispute. The priceSettled and priceDisputed function comments oversimplify behavior, omitting cases like result resets or no-ops on subsequent disputes. Additionally, the _createMarket comment incorrectly implies the underdog parameter is only unused for Winner markets, when it is also unused for Totals markets. These inaccuracies stem from outdated or imprecise documentation. While not directly exploitable, they mislead developers and auditors, increasing the risk of incorrect assumptions during development or integration.\n",
            "severity": "Informational",
            "location": [
                "UmaSportsOracle.sol::createGame",
                "UmaSportsOracle.sol::priceSettled",
                "UmaSportsOracle.sol::priceDisputed",
                "UmaSportsOracle.sol::_createMarket",
                "UmaSportsOracle.sol::_resetGame",
                "Structs.sol::GameData"
            ],
            "files": []
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ],
                "3": [
                    "CWE-636"
                ]
            },
            "title": "Blacklisted Users Block Refunds",
            "description": "1. **Description:** If a token used in the system has blacklist functionality and a recipient is blacklisted, any refund transaction to that user will revert. This affects functions such as `resetGame()`, `priceDisputed()`, and `priceSettled()` which involve refunding tokens.\n2. **Cause:** The vulnerability arises due to the use of tokens like USDC.e that support blacklisting. Although currently unused and ownership renounced, the token contract is upgradeable, and future activation of blacklisting could trigger this behavior.\n3. **Exploitation:** An attacker could potentially get blacklisted (or simulate conditions where a user is blacklisted) to block refund operations, leading to denial of service for refund functionality.\n4. **Impact:** Refunds may be permanently blocked for blacklisted users, disrupting normal protocol operation and potentially causing loss of access to funds for legitimate users if blacklisting is re-enabled in the future.\n",
            "severity": "Informational",
            "location": [],
            "files": []
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-459"
                ]
            },
            "title": "Refunds Are Lost Due to Admin Actions",
            "description": "1. **Description:** When the admin calls `emergencySettleGame()`, any pending refunds for that game are not processed and are effectively lost. Additionally, calling `resetGame()` before an oracle request is disputed results in the refund being ignored and lost. Furthermore, `reset-Game()` does not reset the requestor's address, which could lead to the original requestor receiving a refund intended for a subsequent request.\n2. **Cause:** The contract logic does not handle cleanup or forwarding of pending refunds during admin-triggered state changes. The failure to reset the requestor address creates confusion in refund routing.\n3. **Exploitation:** A malicious or mistaken admin could trigger `emergencySettleGame()` or `resetGame()` at inopportune times to cause loss of user funds. An attacker could also manipulate block timing to front-run `resetGame()` with an oracle dispute, causing the admin's action to revert or behave unexpectedly.\n4. **Impact:** Users may permanently lose their refund entitlements due to administrative actions. This undermines trust in the system's fairness and correctness, especially in edge cases involving dispute resolution.\n",
            "severity": "Informational",
            "location": [],
            "files": []
        }
    ]
}