{
    "path": "dataset-curated/reports/ChainSecurity/ChainSecurity_Plusplus_AG_Plusplus_Custody_audit_1.pdf",
    "project_info": {
        "url": [
            "https://github.com/plusplus-ag/plusplus-custody"
        ],
        "commit_id": [
            "ceea30074fcf60a6cde40673e77f98ff575c2c3f"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-09-12",
        "project_path": {
            "plusplus-custody": "dataset-curated/contracts/ChainSecurity_Plusplus_AG_Plusplus_Custody_audit_1.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Duplicate Inputs Can Overwrite Storage",
            "description": "This vulnerability exists in the ZCHFSavingsManager contract's createDeposits function, which failed to prevent duplicate identifiers within the same input array. Although the function checked that identifiers were not already in use, it did not validate uniqueness within the batch itself. As a result, if an operator provided the same identifier multiple times, the last occurrence would overwrite prior entries, leading to untracked deposits. The root cause is the lack of intra-batch duplicate checking during deposit creation. A malicious or erroneous operator could exploit this by submitting duplicate IDs, causing the contract state to lose track of intermediate deposits. This leads to inconsistent accounting, as multiple DepositCreated events would be emitted without corresponding DepositRedeemed events upon redemption. The impact includes potential misuse of untracked deposits via moveZCHF() and discrepancies between event logs and actual state, undermining auditability and trust in the system. This issue was resolved in Version 2 by adding a check that reverts if a deposit's createdAt is already non-zero during batch processing.\n",
            "severity": "Low",
            "location": [
                "ZCHFSavingsManager.sol::createDeposits"
            ],
            "files": [
                "plusplus-custody/src/ZCHFSavingsManager.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-437"
                ]
            },
            "title": "Tick-accrual Mismatch on New Deposit",
            "description": "The ZCHFSavingsManager contract experiences a temporary accounting mismatch due to the way the Frankencoin Savings module handles tick accrual after new deposits. When new funds are deposited, the module applies a weighted delay to the account's tick baseline, causing a pause in interest accrual until currentTicks() catches up. However, the manager's getDepositDetails function does not account for this pause and continues to report increasing interest based on currentTicks(), even though no actual interest is being accrued during the delay period. The root cause is the discrepancy between the module's account-based tick advancement and the manager's assumption of continuous accrual. An operator could exploit this by redeeming deposits during the delay window, potentially withdrawing more than what has actually accrued. The impact is a temporary overstatement of redeemable value, which could lead to a shortfall if all deposits were redeemed simultaneously during the delay. However, this risk is mitigated by maintaining a buffer of unwithdrawn fees that generate sufficient interest to cover any over-withdrawals. The issue is acknowledged by the team and considered acceptable under operational processes.\n",
            "severity": "Informational",
            "location": [
                "ZCHFSavingsManager.sol::getDepositDetails",
                "ZCHFSavingsManager.sol::createDeposits"
            ],
            "files": [
                "plusplus-custody/src/ZCHFSavingsManager.sol"
            ]
        }
    ]
}