{
    "path": "dataset-curated/reports/Zellic/Cloak V1 - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/scroll-tech/scroll-contracts"
        ],
        "commit_id": [
            "cbca22befd6bd0def75d74eea54453f08089d886"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-10-16",
        "project_path": {
            "scroll-contracts": "dataset-curated/contracts/Cloak V1 - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "The function finalizeWithdrawERC20 does not implement the logic for forwarding data",
            "description": "The function finalizeWithdrawERC20 in L1ERC20GatewayValidium.sol includes a parameter `_data` intended to be optional data forwarded to the recipient. However, despite the comment indicating this functionality, the function does not actually implement any logic to forward the `_data` to the recipient address. This omission is a coding mistake where expected behavior described in documentation is not reflected in the implementation. An attacker cannot directly exploit this to steal funds, but users relying on the `_data` parameter for callbacks or integrations will find the feature non-functional. As a result, any intended post-withdrawal logic on the recipient side will fail to execute, leading to a degraded user experience and potential integration issues with external contracts.\n",
            "severity": "Medium",
            "location": [
                "L1ERC20GatewayValidium.sol::finalizeWithdrawERC20"
            ],
            "files": [
                "scroll-contracts/src/validium/L1ERC20GatewayValidium.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "Front-running the encryption-key–registration transaction can deny service to function finalizeBundle",
            "description": "The function registerNewEncryptionKey in ScrollChainValidium.sol is called after contract deployment to register the first encryption key, which is associated with a specific message index. However, because the key registration occurs in a separate transaction after deployment, malicious actors can front-run this transaction by submitting cross-chain messages beforehand. This causes the nextCrossDomainMessageIndex to increment, so that when finalizeBundle is later called, it attempts to retrieve an encryption key for message index 0, but no such key exists because the first registered key applies to a higher index. This leads to the _getEncryptionKey function reverting with ErrorUnknownEncryptionKey, thereby preventing the finalization of the bundle. The root cause is the lack of atomicity between contract deployment and initial key registration. An attacker can exploit this by monitoring the mempool for the key registration transaction and submitting their own messages first. The impact is a denial-of-service condition on bundle finalization, which disrupts the system's ability to process messages securely and reliably.\n",
            "severity": "High",
            "location": [
                "ScrollChainValidium.sol::registerNewEncryptionKey",
                "ScrollChainValidium.sol::_finalizeBundle",
                "ScrollChainValidium.sol::_getEncryptionKey"
            ],
            "files": [
                "scroll-contracts/src/validium/ScrollChainValidium.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "The function commitBatch can be executed before the function importGenesisBatch",
            "description": "The function commitBatch in ScrollChainValidium.sol allows the sequencer to commit a new batch by verifying the parent batch hash matches the last committed batch. However, it does not enforce that the genesis batch has been imported via importGenesisBatch before allowing the first batch commit. As a result, if commitBatch is called before importGenesisBatch, the committedBatches[0] will be set to a non-zero value from the first batch, while the genesis state root remains uninitialized. This breaks the expected chain continuity, as the genesis state root should be the anchor of the entire batch sequence. The cause is the absence of a check ensuring that committedBatches[0] is non-zero (i.e., genesis imported) before allowing subsequent batch commits. An attacker with sequencer privileges could exploit this by skipping genesis import and directly committing a batch, leading to an inconsistent state where the initial state root is undefined. The impact is a potential state mismatch and incorrect batch hash calculations, undermining the integrity of the rollup's state progression.\n",
            "severity": "Low",
            "location": [
                "ScrollChainValidium.sol::commitBatch",
                "ScrollChainValidium.sol::importGenesisBatch"
            ],
            "files": [
                "scroll-contracts/src/validium/ScrollChainValidium.sol"
            ]
        }
    ]
}