{
    "path": "dataset-curated/reports/MixBytes/Enjoyoors EVM Vaults Security Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/eq-lab/enjoyoors-evm-contracts"
        ],
        "commit_id": [
            "efbc1b269e0f84c631437156a6fa878d51935822"
        ],
        "address": [
            "0x8A4E79D2e12D253f6cEFec473439b4b0e98B7c17",
            "0x59660cb83da31EC23F9d992C11f80Fc527046409"
        ],
        "chain": "evm",
        "compiler_version": "v0.8.26+commit.8a97fa7a",
        "audit_date": "2024-12-16",
        "project_path": {
            "Enjoyoors EVM Vaults Security Audit Report.pdf-source": "dataset-curated/contracts/Enjoyoors EVM Vaults Security Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-1265"
                ]
            },
            "title": "Reentrancy Vulnerability in _claimWithdrawal Function",
            "description": "A reentrancy vulnerability exists in the _claimWithdrawal function of the EnjoyoorsVaultWithdrawals contract. The root cause is the lack of a reentrancy guard, which allows malicious contracts—particularly ERC777 tokens with callback functionality—to re-enter the function before the state is updated. An attacker could exploit this by crafting a malicious token contract that recursively calls _claimWithdrawal during a withdrawal, draining the contract of all withdrawable funds. This leads to a direct loss of user funds, which is why the issue is classified as Critical.\n",
            "severity": "Critical",
            "location": [
                "EnjoyoorsVaultWithdrawals.sol::_claimWithdrawal"
            ],
            "files": [
                "EnjoyoorsVault/contracts/vault/actions/EnjoyoorsVaultWithdrawals.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ]
            },
            "title": "Stuck Rebase Rewards Due to Internal Balance Tracking",
            "description": "The contract uses internal balance tracking via userSupply[token][msg.sender] += amount in the _deposit function of EnjoyoorsVaultDeposits, which only records the initial deposit amount. This design fails to account for rebasing tokens (e.g., stETH, aTokens) that automatically increase balances over time through protocol rewards. Because withdrawals are limited to the originally tracked amount, any additional tokens generated by rebasing are permanently locked in the contract. An attacker cannot directly exploit this, but all users depositing rebasing tokens will permanently lose accrued rewards. The impact is systemic and irreversible, leading to a Critical severity classification due to guaranteed loss of user funds over time.\n",
            "severity": "Critical",
            "location": [
                "EnjoyoorsVaultDeposits.sol::_deposit"
            ],
            "files": [
                "EnjoyoorsVault/contracts/vault/actions/EnjoyoorsVaultDeposits.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Absence of Fee-on-transfer Protection in _deposit Function",
            "description": "The _deposit function in EnjoyoorsVaultDeposits does not verify the actual amount of tokens received after a transfer, making it vulnerable to fee-on-transfer tokens. These tokens deduct a fee during transfer, so the contract receives less than the amount reported by the user. The contract, however, credits the full user-reported amount, leading to an imbalance where users are credited more than the contract holds. Over time, this discrepancy accumulates, eventually preventing the last depositor from withdrawing their funds due to insufficient contract balance. This breaks the intended economic model and could lead to denial of service for late users, warranting a Medium severity rating.\n",
            "severity": "Medium",
            "location": [
                "EnjoyoorsVaultDeposits.sol::_deposit"
            ],
            "files": [
                "EnjoyoorsVault/contracts/vault/actions/EnjoyoorsVaultDeposits.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Need for ERC165 Check in the EnjoyoorsWithdrawalApprover",
            "description": "The _changeWithdrawalApprover function in the Setup contract allows updating the withdrawal approver address but does not validate that the new address implements the required interface via ERC165. The absence of this check could allow setting a contract that does not support necessary functions, leading to a broken or non-functional withdrawal approval system. While this is not directly exploitable for financial gain, it could result in a denial of service if an invalid contract is set. The impact is limited and preventable through operational care, hence the Low severity classification.\n",
            "severity": "Low",
            "location": [
                "Setup.sol::_changeWithdrawalApprover"
            ],
            "files": [
                "EnjoyoorsVault/contracts/vault/access/Setup.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Lack of Return Value Verification in _claimWithdrawal",
            "description": "The _claimWithdrawal function in EnjoyoorsVaultWithdrawals does not check the return value of canClaimWithdrawal (later renamed to verifyWithdrawal). Although the function is expected to validate withdrawal eligibility, the lack of explicit boolean verification means the control flow could proceed incorrectly if the function's logic were to change or if it were bypassed. In the current implementation, this does not lead to exploitable conditions due to other safeguards, but it represents a code quality and defensive programming issue. The potential for future bugs without immediate exploitability results in a Low severity rating.\n",
            "severity": "Low",
            "location": [
                "EnjoyoorsVaultWithdrawals.sol::_claimWithdrawal"
            ],
            "files": [
                "EnjoyoorsVault/contracts/vault/actions/EnjoyoorsVaultWithdrawals.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ]
            },
            "title": "Misleading Variable Name in Withdrawal Approver Contract",
            "description": "The state variable withdrawalPeriodSeconds in the EnjoyoorsWithdrawalApprover contract is inaccurately named, as it represents a mandatory waiting time (unlocking delay) before a withdrawal can be claimed, not a recurring period. This misnaming could confuse developers during maintenance or audits, potentially leading to logic errors. However, since the variable's purpose is documented in comments and the code functions correctly, there is no direct security or functional impact. This is purely a code clarity issue, justifying a Low severity classification.\n",
            "severity": "Low",
            "location": [
                "EnjoyoorsWithdrawalApprover.sol::withdrawalPeriodSeconds"
            ],
            "files": [
                "EnjoyoorsWithdrawalApprover/contracts/vault/EnjoypoorsWithdrawalApprover.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "vaultWithdrawalClaimable() Does Not Check",
            "description": "The vaultWithdrawalClaimable function in the EnjoyoorsWithdrawalApprover contract returns true even if the withdrawal has already been claimed (i.e., the claimed flag in WithdrawalRequest is true). This incorrect behavior could mislead external systems or frontends into believing a withdrawal is still available when it is not. While this does not allow double claims or fund loss due to on-chain safeguards, it may cause user confusion or incorrect UI states. The issue was addressed by renaming the function to isWithdrawalApproved, but the original logic flaw remains a minor consistency issue, hence the Low severity.\n",
            "severity": "Low",
            "location": [
                "EnjoyoorsWithdrawalApprover.sol::vaultWithdrawalClaimable"
            ],
            "files": [
                "EnjoyoorsWithdrawalApprover/contracts/vault/EnjoypoorsWithdrawalApprover.sol"
            ]
        }
    ]
}