{
    "path": "dataset-curated/reports/OpenZeppelin/EVM Universal Adapter Audit.md",
    "project_info": {
        "url": [
            "https://github.com/across-protocol/contracts",
            "https://github.com/across-protocol/sp1-helios"
        ],
        "commit_id": [
            "9b58d8edd4451cc189f4d01be4db72efd97ddd61",
            "8be3aae7622b07ba30d4eee0e9f60823616cb5b3"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-03-31",
        "project_path": {
            "contracts": "dataset-curated/contracts/EVM Universal Adapter Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Double Relay of a rootBundle Is Possible",
            "description": "The HubPool contract allows both its owner and any user to relay a rootBundle execution to a SpokePool via the Universal_Adapter. When the owner triggers a message, it uses a UUID-based nonce in HubPoolStore, while user-triggered relays use the challenge period end timestamp as the nonce. This difference in nonce generation allows the same rootBundle data to be stored twice in different storage slots within HubPoolStore if first triggered by a user and then by the owner (or vice versa). As a result, the rootBundle's actions can be executed twice on the same SpokePool, potentially leading to duplicate processing of relayer refunds or pool rebalancing operations. The root cause is the use of different nonce schemes for owner and non-owner message relays, which fails to prevent duplicate storage of identical rootBundle data. An attacker with ownership privileges could intentionally trigger a second relay of an already-executed rootBundle, exploiting this behavior. The impact includes potential economic imbalance due to duplicated state updates, although the actual risk is mitigated by the fact that only the HubPool owner can perform the second relay. This is considered a low-severity issue because it relies on privileged access and is acknowledged as by-design behavior.\n",
            "severity": "Low",
            "location": [
                "HubPool.sol::relaySpokePoolAdminFunction#249-252",
                "HubPool.sol::executeRootBundle#620",
                "Universal_Adapter.sol::relayMessage#44",
                "HubPoolStore.sol::uuid#60",
                "HubPoolStore.sol::challengePeriodEndTimestamp#72"
            ],
            "files": [
                "contracts/contracts/HubPool.sol",
                "contracts/contracts/chain-adapters/utilities/HubPoolStore.sol",
                "contracts/contracts/chain-adapters/Universal_Adapter.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-345"
                ],
                "3": [
                    "CWE-346"
                ]
            },
            "title": "Unverified SOURCE_CHAIN_ID in Universal_SpokePool Constructor",
            "description": "The Universal_SpokePool contract integrates with the SP1Helios contract to verify Ethereum beacon chain state updates using zero-knowledge proofs. The SP1Helios contract has an immutable SOURCE_CHAIN_ID, typically set to 1 (Ethereum), but the Universal_SpokePool constructor does not validate that the connected SP1Helios instance has the correct SOURCE_CHAIN_ID. This omission creates a misconfiguration risk where a Universal_SpokePool could be initialized with a SP1Helios contract pointing to an unintended source chain, potentially allowing invalid or malicious state updates to be accepted. The root cause is the lack of a validation check during initialization, relying instead on administrative diligence. An attacker could exploit this by deploying or configuring a Universal_SpokePool with a malicious or incorrect SP1Helios instance, leading to acceptance of fraudulent cross-chain messages. The impact includes compromise of data integrity and potential loss of funds if incorrect state roots are accepted. While the team acknowledges this and places responsibility on the HubPool admin to verify configuration, the absence of an on-chain check increases operational risk. This is classified as low severity due to the assumption of trusted deployment processes.\n",
            "severity": "Low",
            "location": [
                "Universal_SpokePool.sol#constructor",
                "SP1Helios.sol::SOURCE_CHAIN_ID#30"
            ],
            "files": [
                "contracts/contracts/Universal_SpokePool.sol",
                "sp1-helios/contracts/src/SP1Helios.sol"
            ]
        }
    ]
}