{
    "path": "dataset-curated/reports/Zellic/Filecoin Services Payments - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/FilOzone/filecoin-pay"
        ],
        "commit_id": [
            "e4e7dcbc135ba97833ad8f2a574329dbb9c3e721"
        ],
        "address": [],
        "chain": "EVM-compatible",
        "compiler_version": "n/a",
        "audit_date": "2025-08-04",
        "project_path": {
            "filecoin-pay": "dataset-curated/contracts/Filecoin Services Payments - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-834"
                ]
            },
            "title": "Infinite array could lead to out-of-gas issues",
            "description": "The `payerRails` and `payeeRails` mappings in the Payments contract store arrays of rail IDs that grow indefinitely as new rails are created, with no mechanism to remove or prune entries. This design causes the `getRailsForPayerAndToken` and similar functions to iterate over the entire array, skipping non-existent rails, which consumes gas proportional to the array length. The root cause is the lack of array cleanup or pagination, leading to unbounded growth. An attacker could exploit this by creating and terminating many rails to bloat the array, making the view function increasingly expensive to call. While the function is external and view-only, calling it within a transaction could lead to out-of-gas failures, rendering the function unusable for clients or interfaces that depend on it, especially as the array grows over time.\n",
            "severity": "Low",
            "location": [
                "Payments.sol::getRailsForPayerAndToken",
                "Payments.sol::_getRailsForAddressAndToken"
            ],
            "files": [
                "filecoin-pay/src/Payments.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused mapping hasCollectedFees in Payments",
            "description": "The `hasCollectedFees` mapping in the Payments contract is declared but never read from or written to anywhere in the codebase, making it dead state. The root cause is likely leftover code from a previous design that was not fully removed during refactoring. While this does not introduce any direct security risk or functional flaw, it reduces code clarity and increases contract size unnecessarily. An attacker cannot exploit this directly, but the presence of unused code can mislead auditors and developers, potentially leading to incorrect assumptions about the contract's behavior. The impact is limited to maintainability and code quality.\n",
            "severity": "Informational",
            "location": [
                "Payments.sol::hasCollectedFees"
            ],
            "files": [
                "filecoin-pay/src/Payments.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Documentation inconsistencies",
            "description": "The JSDoc comment for the `settleTerminatedRailWithoutValidation` function incorrectly states that it can only be called by the payee, when in fact it is intended as an emergency function for the client or payer to unblock payments in a stuck rail. The root cause is a mismatch between the implementation and its documentation, likely due to a copy-paste error or oversight during development. This could mislead developers or front-end engineers into implementing incorrect access control assumptions, potentially exposing the function in a UI where it should not be available. While the function itself is correctly implemented and secure, the incorrect documentation could lead to operational errors or misuse in integrations, reducing the overall reliability of the system.\n",
            "severity": "Informational",
            "location": [
                "Payments.sol::settleTerminatedRailWithoutValidation"
            ],
            "files": [
                "filecoin-pay/src/Payments.sol"
            ]
        }
    ]
}