{
    "path": "dataset-curated/reports/Zellic/Flare FAsset Review - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/flare-foundation/fassets"
        ],
        "commit_id": [
            "a70e821193c686f8721c46121d37991d7521d478"
        ],
        "address": null,
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-10-16",
        "project_path": {
            "fassets": "dataset-curated/contracts/Flare FAsset Review - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1285"
                ]
            },
            "title": "Payments before the first redemption block can be challenged",
            "description": "1. **Description:** Previously, an agent could submit a redemption request before the underlying payment was proven illegal, allowing them to exploit timing by anticipating the required payment reference and making transfers on the underlying chain early. This could prevent the system from correctly identifying and rejecting illegal payments.\n\n2. **Cause:** The vulnerability stemmed from the lack of a validation check ensuring that the payment on the underlying chain occurred on or after the firstUnderlyingBlock of the redemption request. Without this check, payments made too early could not be flagged as illegal.\n\n3. **Exploitation:** An attacker could submit a redemption request before the actual payment was made on the underlying chain, thereby bypassing the system's ability to prove the payment as illegal, potentially leading to unauthorized redemptions.\n\n4. **Impact:** This could result in incorrect redemption processing, undermining the integrity of the redemption mechanism and potentially allowing agents to extract value without fulfilling proper payment conditions.\n",
            "severity": "High",
            "location": [
                "ChallengesFacet.sol::redemptionActive#(unknown line)"
            ],
            "files": [
                "fassets/contracts/assetManager/facets/ChallengesFacet.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-863"
                ]
            },
            "title": "The upgradeWNatContract function must now be called by governance or executor",
            "description": "1. **Description:** The upgradeWNatContract function in AgentCollateralFacet.sol previously allowed any agent vault owner to update the WNAT contract address, creating a risk of inconsistent state updates between the asset manager and collateral pool if the agent failed to act promptly.\n\n2. **Cause:** The access control was too permissive, relying only on onlyAgentVaultOwner, which allowed individual agents to trigger the upgrade. This could lead to accounting discrepancies if the collateral pool was not updated in sync.\n\n3. **Exploitation:** A malicious or negligent agent could delay or manipulate the update of the WNAT address in the collateral pool, leading to incorrect collateral accounting and potential financial loss.\n\n4. **Impact:** The inconsistency between contract states could result in incorrect collateral tracking, potentially leading to under- or over-collateralization and financial risk to the system.\n",
            "severity": "High",
            "location": [
                "AgentCollateralFacet.sol::upgradeWNatContract#(unknown line)"
            ],
            "files": [
                "fassets/contracts/assetManager/facets/AgentCollateralFacet.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Outdated comments",
            "description": "1. **Description:** The inline comments for the upgradeWNatContract function in both AgentCollateralFacet.sol and IIAssetManager.sol still state that the function can only be called by the agent vault owner, which is no longer accurate after the fix.\n\n2. **Cause:** The code was updated to restrict access to onlyImmediateGovernanceOrExecutor, but the associated documentation comments were not updated to reflect this change.\n\n3. **Exploitation:** While not directly exploitable, misleading comments can cause confusion for developers and auditors, potentially leading to incorrect assumptions about access control and introducing bugs during future maintenance.\n\n4. **Impact:** Reduced code clarity and maintainability, increasing the risk of human error during future development or audits.\n",
            "severity": "Informational",
            "location": [
                "AgentCollateralFacet.sol::upgradeWNatContract#(unknown line)",
                "IIAssetManager.sol::upgradeWNatContract#(unknown line)"
            ],
            "files": [
                "fassets/contracts/assetManager/facets/AgentCollateralFacet.sol",
                "fassets/contracts/assetManager/interfaces/IIAssetManager.sol"
            ]
        }
    ]
}