{
    "path": "dataset-curated/reports/Zenith/Forte - Zenith Audit Report (October).pdf",
    "project_info": {
        "url": [
            "https://github.com/Forte-Service-Company-Ltd/liquidity-base",
            "https://github.com/Forte-Service-Company-Ltd/liquidity-altbc"
        ],
        "commit_id": [
            "e65ee2644f50649a95b74b02032025d3bf5ef54e",
            "4c365ab40df0bbb740df950531c857693308dc91"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-10-24",
        "project_path": {
            "Forte - Zenith Audit Report (October).pdf-source": "dataset-curated/contracts/Forte - Zenith Audit Report (October).pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ],
                "3": [
                    "CWE-252"
                ]
            },
            "title": "Unsafe transferFrom() may make the deployer not have to provide the initial liquidity",
            "description": "The vulnerability arises in the createPool function of ALTBCFactory.sol, where the contract uses an unsafe IERC20.transferFrom() call to transfer the initial liquidity token (xToken) from the deployer to the newly created pool. \nThe root cause is the lack of proper validation of the boolean return value of transferFrom(), which some tokens may return false without reverting upon failure. \nAn attacker could exploit this by using a token that does not revert on failure but returns false, causing the protocol to incorrectly assume the transfer succeeded and proceed with initializing the pool with claimed but non-existent liquidity. \nThis could allow a malicious deployer to create a pool without actually providing initial liquidity, potentially leading to a broken or exploitable pool state, though the likelihood is low due to specific conditions required.\n",
            "severity": "Medium",
            "location": [
                "ALTBCFactory.sol::createPool#72-73"
            ],
            "files": [
                "4c365ab40df0bbb740df950531c857693308dc91/liquidity-altbc/src/factory/ALTBCFactory.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ],
                "3": [
                    "CWE-826"
                ]
            },
            "title": "LPToken needs to disable renounceOwnership()",
            "description": "The LPToken contract inherits from Ownable2Step, which allows the owner to renounce ownership. If ownership is renounced, critical administrative functions could become permanently disabled, potentially leading to loss of control over essential contract operations. \nThe root cause is the lack of explicit prevention of ownership renouncement in the LPToken contract, unlike other components such as FactoryBase which already disable this functionality. \nAn attacker could potentially social-engineer or manipulate the owner into renouncing ownership, or the owner might do so accidentally, leading to irreversible loss of control. \nThe impact is limited to operational disruption rather than direct fund loss, hence the low severity.\n",
            "severity": "Low",
            "location": [
                "LPToken.sol::#19-20"
            ],
            "files": [
                "e65ee2644f50649a95b74b02032025d3bf5ef54e/liquidity-base/src/common/LPToken.sol"
            ]
        }
    ]
}