{
    "path": "dataset-curated/reports/Zellic/Frax0 Mesh - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/FraxFinance/fraxnet-dev",
            "https://github.com/FraxFinance/dev-staked-frax-erc4626",
            "https://github.com/FraxFinance/dev-fraxchain-contracts",
            "https://github.com/FraxFinance/frax-oft-upgradeable"
        ],
        "commit_id": [
            "4e10ffdb588d5832eca87255964c5921c5650bfa",
            "afb47e071b9c8aaaf6e1696bc0694a05e94bec9d",
            "2c2cc85f4bfd17540bc07a9a78f80347a2c921e2",
            "b8d76da3a2bb5ff1fc557c194f8fe6496873959d"
        ],
        "address": [
            null
        ],
        "chain": "EVM",
        "compiler_version": "n/a",
        "audit_date": "2025-09-09",
        "project_path": {
            "frax-oft-upgradeable": "dataset-curated/contracts/Frax0 Mesh - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Incorrect condition for determining dust removal",
            "description": "The RemoteCustodian contract fails to remove dust from share amounts when the custodian token's decimals are less than or equal to six, due to a conditional check based on custodianTknDecimals() rather than the frxUSD token's decimals. This causes inconsistencies in cross-chain transfers where dust is not properly handled, leading to discrepancies between deposited assets and received shares. An attacker could exploit this by crafting deposits with dust that get rounded up during conversion but not properly accounted for during transfer, resulting in the contract holding more assets than the corresponding shares justify. This leads to a loss of user funds and incorrect accounting in cross-chain operations.\n",
            "severity": "Medium",
            "location": [
                "RemoteCustodian.sol::_removeDustFrxUsdFloor",
                "RemoteCustodian.sol::_removeDustFrxUsdCeil",
                "RemoteCustodian.sol::_convertToAssets",
                "RemoteCustodian.sol::previewMint",
                "RemoteCustodian.sol::mint",
                "RemoteCustodian.sol::_convertToShares",
                "RemoteCustodian.sol::previewDeposit"
            ],
            "files": [
                "b8d76da3a2bb5ff1fc557c194f8fe6496873959d/frax-oft-upgradeable/contracts/frxUsd/SFrxUSDOFTUpgradeable.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-670"
                ]
            },
            "title": "Inconsistent native fee refund recipient in _remoteMint",
            "description": "In the _remoteMint function of the RemoteCustodian contract, excess native fees are refunded to the _receiver address when the destination is local, but to msg.sender when it is cross-chain. This inconsistency arises from improper handling of refund logic based on the execution path. An attacker could manipulate the refund destination by choosing a local EID, causing fees paid by msg.sender to be sent to a different address (_receiver), effectively stealing the payer's funds. This leads to misdirected refunds and a poor user experience, undermining trust in the system's fairness and correctness.\n",
            "severity": "Low",
            "location": [
                "RemoteCustodian.sol::_remoteMint"
            ],
            "files": [
                "b8d76da3a2bb5ff1fc557c194f8fe6496873959d/frax-oft-upgradeable/contracts/FraxOFTAdapterUpgradeable.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-573"
                ]
            },
            "title": "Incorrect Transfer event parameters",
            "description": "The StakedFrxUSD3 contract emits the Transfer event with from = msg.sender instead of the actual token owner in internal transfer logic, violating ERC-20 event semantics. This occurs because the event is incorrectly parameterized in the __transfer function. Off-chain services that rely on Transfer events for balance tracking or transaction monitoring will misattribute the source of the transfer, leading to incorrect accounting, flawed analytics, and potential front-end display errors. While this does not directly enable fund theft, it compromises the reliability of event-based systems and can lead to operational issues in wallets and explorers.\n",
            "severity": "Informational",
            "location": [
                "StakedFrxUSD3.sol::__transfer"
            ],
            "files": [
                "b8d76da3a2bb5ff1fc557c194f8fe6496873959d/frax-oft-upgradeable/contracts/frxUsd/SFrxUSDOFTUpgradeable.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Incorrect EIP-712 domain separator in upgradable proxy",
            "description": "The StakedFrxUSD3 contract uses Solmate’s DOMAIN_SEPARATOR() in a proxy context, which caches the domain separator based on the implementation address rather than the proxy address. This violates EIP-712, which requires the verifying contract to be the proxy itself. As a result, signatures (e.g., for permit) may be invalid or bound to the wrong contract address, breaking compatibility with wallets and third-party services that rely on EIP-712 signatures. This undermines the security and usability of off-chain signing mechanisms and can prevent legitimate users from authorizing transactions.\n",
            "severity": "Informational",
            "location": [
                "StakedFrxUSD3.sol::__domainSeparatorV4"
            ],
            "files": [
                "b8d76da3a2bb5ff1fc557c194f8fe6496873959d/frax-oft-upgradeable/contracts/frxUsd/SFrxUSDOFTUpgradeable.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-430"
                ]
            },
            "title": "Incorrect proxy contract addresses",
            "description": "The UpgradeAdapterEthereum.s.sol script uses Fraxtal-specific proxy addresses (e.g., fraxtalFrxUsdLockbox) when upgrading contracts on Ethereum, where those addresses do not have deployed contracts. This error occurs in the upgradeExistingLockboxes function, which passes incorrect addresses to the upgrade function. When executed, the script will fail because the proxy admin cannot interact with a non-existent contract, halting the upgrade process. This prevents successful deployment of new implementations and could delay critical updates or security fixes.\n",
            "severity": "Informational",
            "location": [
                "UpgradeAdapterEthereum.s.sol::upgradeExistingLockboxes",
                "UpgradeAdapterEthereum.s.sol::upgradeExistingLockbox"
            ],
            "files": [
                "b8d76da3a2bb5ff1fc557c194f8fe6496873959d/frax-oft-upgradeable/scripts/ops/V110/ethereum/UpgradeAdapterEthereum.s.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-437"
                ]
            },
            "title": "Incorrect caller in script",
            "description": "The addMinterRoles function in UpgradeAdapterEthereum.s.sol attempts to grant minter roles using a single privileged address for both frxUsd and sfrxUsd tokens, but these tokens have different authorities (owner vs. timelockAddress). The prankAndWriteTxs modifier forces both calls to use the same caller, which will fail for one of the tokens due to access control checks. This causes the script to revert during execution, preventing the proper configuration of minting permissions and breaking the deployment flow.\n",
            "severity": "Informational",
            "location": [
                "UpgradeAdapterEthereum.s.sol::addMinterRoles",
                "UpgradeAdapterEthereum.s.sol::addMinterRole",
                "UpgradeAdapterEthereum.s.sol::generateComptrollerTxs"
            ],
            "files": [
                "scripts/ops/V110/ethereum/UpgradeAdapterEthereum.s.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Redundant call to the function approve",
            "description": "The burnFrxUSD function in FraxtalMinter.sol calls approve on the frxUSD token to grant itself an allowance before burning tokens it already owns. Since burning tokens from the contract's own balance does not require an allowance, this approve call is unnecessary. This results in wasted gas for every burn operation, increasing transaction costs without providing any functional benefit. While not a security vulnerability, it represents inefficient code that can be optimized to reduce user fees.\n",
            "severity": "Informational",
            "location": [
                "FraxtalMinter.sol::burnFrxUSD"
            ],
            "files": []
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-269"
                ],
                "3": [
                    "CWE-267"
                ]
            },
            "title": "Centralization risk",
            "description": "The CustodianBase contract grants DEFAULT_ADMIN_ROLE holders unrestricted access to critical functions such as setMintRedeemFee, recoverERC20, and recoverETH. These functions allow the admin to arbitrarily change fee rates and withdraw any ERC-20 or native tokens from the contract. This creates a single point of failure and centralization risk, as a malicious or compromised admin could drain the contract or impose unfair fees. Users must trust the admin not to abuse these powers, which contradicts decentralized principles and increases systemic risk.\n",
            "severity": "Informational",
            "location": [
                "CustodianBase.sol::setMintRedeemFee",
                "CustodianBase.sol::recoverERC20",
                "CustodianBase.sol::recoverETH"
            ],
            "files": []
        }
    ]
}