{
    "path": "dataset-curated/reports/OpenZeppelin/Linea Burn Mechanism Audit.md",
    "project_info": {
        "url": [
            "https://github.com/Consensys/linea-monorepo"
        ],
        "commit_id": [
            "8285efababe0689aec5f0a21a28212d9d22df22e"
        ],
        "address": [
            "0x84a5ba2c12a15071660b0682b59e665dc2faaedb",
            "0x30a20a3a9991c939290f4329cb52daac8e97f353",
            "0x5Ad9369254F29b724d98F6ce98Cb7bAD729969F3",
            "0xfd5fb23e06e46347d8724486cdb681507592e237"
        ],
        "chain": "evm/linea",
        "compiler_version": "n/a",
        "audit_date": "2025-10-13",
        "project_path": {
            "linea-monorepo": "dataset-curated/contracts/Linea Burn Mechanism Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ]
            },
            "title": "Partial Swaps Can Lead to Permanently Locked Funds",
            "description": "The V3DexSwap contract is designed to swap ETH for LINEA tokens using a Uniswap V3-style DEX. It accepts a _sqrtPriceLimitX96 parameter that can cause a partial swap if the price limit is reached during execution. The root cause of the vulnerability is the contract's failure to handle leftover WETH after a partial swap. After converting received ETH to WETH and performing the swap, any unswapped WETH remains in the contract's balance. Since there are no functions to withdraw or transfer these leftover tokens, they become permanently locked and irrecoverable. An attacker could exploit this by triggering a swap under market conditions that cause the price limit to be hit, ensuring a partial execution. The impact is the permanent loss of funds, reducing the protocol's revenue and undermining trust in the system's financial integrity.\n",
            "severity": "Medium",
            "location": [
                "V3DexSwap.sol::swap#L70-L71"
            ],
            "files": [
                "linea-monorepo/contracts/src/operational/V3DexSwap.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-862"
                ]
            },
            "title": "Unprotected Reinitializer Function",
            "description": "The RollupRevenueVault contract is an upgradeable contract using the OpenZeppelin Initializable pattern. It includes a reinitializer function (initializeRolesAndStorageVariables) intended for use during version 2 upgrades. The vulnerability arises because this function lacks access control. While the reinitializer(2) modifier prevents re-entry after version 2 initialization, it does not restrict who can call the function before that point. The root cause is the absence of role-based or ownership checks on a critical initialization function. A malicious actor could exploit this by calling the function before a legitimate upgrade, thereby setting all critical roles (e.g., DEFAULT_ADMIN_ROLE, BURNER_ROLE) to attacker-controlled addresses. This would result in a complete hostile takeover of the contract, allowing the attacker to drain funds or disrupt operations. The impact is severe for new deployments, potentially leading to total loss of funds and control.\n",
            "severity": "Medium",
            "location": [
                "RollupRevenueVault.sol::initializeRolesAndStorageVariables#L98-L123"
            ],
            "files": [
                "linea-monorepo/contracts/src/operational/RollupRevenueVault.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "Generic DEX Interaction in RollupRevenueVault",
            "description": "The RollupRevenueVault contract performs ETH-to-LINEA swaps via a generic low-level call to a configurable DEX address using opaque _swapData. Instead of using the safer, high-level interface of the purpose-built V3DexSwap contract, it relies on externally provided calldata. The root cause is the design choice to use a generic .call() instead of enforcing a specific interface with validated parameters. This places full trust in the BURNER_ROLE to generate secure calldata, including correct slippage protection (e.g., _minLineaOut). An attacker with access to the BURNER_ROLE or a compromised off-chain service could craft malicious _swapData that results in excessive slippage or a failed swap, leading to loss of funds or denial of service. The impact is reduced economic efficiency and potential fund loss due to poor trade execution, though the core protocol functionality remains intact.\n",
            "severity": "Low",
            "location": [
                "RollupRevenueVault.sol::burnAndBridge#L211"
            ],
            "files": [
                "linea-monorepo/contracts/src/operational/RollupRevenueVault.sol"
            ]
        }
    ]
}