{
    "path": "dataset-curated/reports/OpenZeppelin/OIF Contracts Diff Audit.md",
    "project_info": {
        "url": [
            "https://github.com/openintentsframework/oif-contracts"
        ],
        "commit_id": [
            "715329189e1cebb3d3264da309021006e1af005c"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-09-22",
        "project_path": {
            "oif-contracts": "dataset-curated/contracts/OIF Contracts Diff Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Multi-Output Orders Can Be Manipulated",
            "description": "The vulnerability arises in the handling of multi-output orders, where the first filler of an output is designated as the order owner, granting them significant control over the order's execution. This design choice creates two potential risks: a Denial of Service (DoS) attack, where the first filler intentionally delays or fails to complete subsequent outputs, thereby locking user funds until cancellation; and manipulation of Dutch auction orders, where the first filler can wait for the auction price to decrease before fulfilling later outputs, securing a more favorable rate. The root cause is the lack of a mechanism to bind all outputs to a consistent pricing or timing model, such as using the timestamp of the first fill for all subsequent outputs. An attacker could exploit this by strategically claiming the first output and delaying fulfillment of others, especially in time-sensitive or price-varying contexts. The impact includes potential financial loss for users due to unfavorable execution prices and reduced reliability of the order settlement system, undermining trust in multi-output orders.\n",
            "severity": "Medium",
            "location": [
                "OutputSettlerBase.sol::L195",
                "OutputSettlerSimple.sol::L105-L112"
            ],
            "files": [
                "oif-contracts/src/output/BaseOutputSettler.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-439"
                ]
            },
            "title": "Compact Format Signatures (64 bytes) Are No Longer Supported",
            "description": "The system migrated signature verification from Solady's `SignatureCheckerLib` to OpenZeppelin's `SignatureChecker`, which only supports 65-byte ECDSA signatures and rejects 64-byte compact signatures. This change breaks backward compatibility with existing integrations or users relying on the compact format. The root cause is the stricter enforcement in OpenZeppelin's implementation, which does not include logic to handle the 64-byte format that Solady previously supported. An attacker could potentially exploit this by submitting a valid 64-byte signature that gets rejected, leading to a denial of service for legitimate users who are unaware of the format change. The impact is functional disruption rather than direct fund loss, but it may prevent certain users or systems from interacting with the contract if they continue to use compact signatures. While the team deemed this change intentional, it represents a compatibility risk for integrators.\n",
            "severity": "Low",
            "location": [
                "InputSettlerBase.sol::L179",
                "InputSettlerPurchase.sol::L150"
            ],
            "files": [
                "oif-contracts/src/input/InputSettlerBase.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-693"
                ]
            },
            "title": "2-Step Ownership Transfer Is No Longer Supported",
            "description": "The `ChainMap` contract previously used Solady's `Ownable` mixin, which supported a two-step ownership transfer process to prevent accidental or irreversible loss of ownership. After migrating to OpenZeppelin's `Ownable`, only a single-step transfer is supported, meaning a mistaken `transferOwnership` call can result in permanent loss of administrative control if the new owner address is invalid or inaccessible. The root cause is the replacement of Solady's more cautious ownership model with OpenZeppelin's simpler, immediate-transfer model. An attacker could exploit user error by social engineering or phishing to trick the owner into transferring ownership to a malicious or invalid address. The impact is high in terms of administrative risk—loss of ownership means no future configuration or upgrades can be performed on the contract. Although the team stated this change was intentional, it increases operational risk for contract owners.\n",
            "severity": "Low",
            "location": [
                "ChainMap.sol::setChainMap#39-56"
            ],
            "files": [
                "oif-contracts/src/integrations/ChainMap.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Relationship Between `fillDeadline` and `expiryDeadline` Is Not Enforced",
            "description": "In the `InputSettlerEscrow` contract, the `open` function checks that the current timestamp is before both `fillDeadline` and `expiryDeadline`, but it does not enforce that `fillDeadline` must be earlier than `expiryDeadline`. This allows for logically inconsistent orders where the fill deadline occurs after the order has already expired. The root cause is the absence of a validation check comparing the two deadlines during order creation. A user could accidentally create such an order, leading to a situation where the order is technically valid but cannot be filled, resulting in a soft denial of service. While not directly exploitable by an attacker for financial gain, it introduces user experience and reliability issues, potentially leading to locked funds and failed transactions. The impact is limited to usability and correctness, but it undermines the predictability of the system.\n",
            "severity": "Low",
            "location": [
                "InputSettlerEscrow.sol::open#136-137"
            ],
            "files": [
                "oif-contracts/src/input/escrow/InputSettlerEscrow.sol"
            ]
        }
    ]
}