{
    "path": "dataset-curated/reports/Zellic/OP Succinct - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/succinctlabs/op-succinct"
        ],
        "commit_id": [
            "530df8630562292a9629303528d51307df954aec"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-07-16",
        "project_path": {
            "op-succinct": "dataset-curated/contracts/OP Succinct - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-862"
                ]
            },
            "title": "Anyone could submit a malicious output via the optimistic function proposeL2Output",
            "description": "1. **Description:** When optimistic mode is enabled, the `proposeL2Output` function allows anyone to propose an L2 output root if the fallback timeout has elapsed since the last proposal. This creates a permissionless proposal window even without proper verification.\n2. **Cause:** The vulnerability arises from the logic in `proposeL2Output`, which permits any address to propose an output root when `block.timestamp - lastProposalTimestamp() > fallbackTimeout`, regardless of whether the proposer is approved or the output is valid.\n3. **Exploitation:** A malicious actor could exploit this by waiting for the fallback timeout to expire and then submitting an invalid output root through `proposeL2Output`, taking advantage of the permissionless fallback mechanism.\n4. **Impact:** If the invalid output root is not challenged and deleted within the limited challenge period, it may become finalized, leading to incorrect state assumptions and potential consensus divergence or financial loss.\n",
            "severity": "Medium",
            "location": [
                "OPSuccinctL2OutputOracle.sol::proposeL2Output"
            ],
            "files": [
                "op-succinct/contracts/src/validity/OPSuccinctL2OutputOracle.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-362"
                ]
            },
            "title": "Creation of contract OPSuccinctDisputeGame could be blocked by front-running the output proposal",
            "description": "1. **Description:** The `OPSuccinctDisputeGame` contract's initialization process involves calling `proposeL2Output` on `OPSuccinctL2OutputOracle`. However, due to a race condition, an external malicious proposer can front-run this call.\n2. **Cause:** After one proposal, there is a required interval before another can occur. Since `proposeL2Output` can be called directly by anyone (if conditions like fallback timeout are met), a malicious user can submit a proposal just before the dispute game attempts to initialize.\n3. **Exploitation:** An attacker can monitor the mempool for the deployment transaction of `OPSuccinctDisputeGame` and front-run it by directly calling `proposeL2Output`, thereby blocking the dispute game’s own proposal due to the rate-limiting mechanism.\n4. **Impact:** This could prevent the creation or proper initialization of a dispute game, undermining the dispute resolution mechanism and potentially allowing invalid state transitions to go unchallenged.\n",
            "severity": "Medium",
            "location": [
                "OPSuccinctDisputeGame.sol::initialize",
                "OPSuccinctL2OutputOracle.sol::proposeL2Output"
            ],
            "files": [
                "op-succinct/contracts/src/validity/OPSuccinctDisputeGame.sol"
            ]
        }
    ]
}