{
    "path": "dataset-curated/reports/MixBytes/Ozean Finance Security Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/LayerLabs-app/Ozean-Contracts"
        ],
        "commit_id": [
            "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8"
        ],
        "address": [
            "0xdD4297...df610db9"
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2024-12-10",
        "project_path": {
            "Ozean-Contracts": "dataset-curated/contracts/Ozean Finance Security Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Potential Inflation Attack Risk",
            "description": "The vulnerability exists in the initialize function of the OzUSD contract, where the _sharesAmount variable can be set to zero during initialization. This creates a risk of artificial inflation of the share price, which could severely distort the token's value and break economic assumptions. The root cause is the lack of input validation for _sharesAmount, allowing a malicious or erroneous initialization. An attacker could exploit this by initializing the contract with zero shares and then sending a small amount of USDX, causing the share price to inflate by many orders of magnitude. The impact includes broken front-end displays, loss of effective precision in calculations, and potential user fund mismanagement due to incorrect balance representations.\n",
            "severity": "Medium",
            "location": [
                "OzUSD.sol::initialize"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "USDC Depeg Risk in USDX Bridge",
            "description": "The bridge function in the USDXBridge contract does not have a pause mechanism, exposing it to instant arbitrage risks if USDC or other bridged assets lose their peg. The cause is the absence of emergency controls to halt operations during market instability. An attacker could exploit price discrepancies during a depeg event to drain value from the system or destabilize USDX's market price. The impact is potential loss of user confidence, market depreciation of USDX, and financial losses for liquidity providers or users relying on stable 1:1 conversions.\n",
            "severity": "Medium",
            "location": [
                "USDXBridge.sol::bridge"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/USDXBridge.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-224"
                ]
            },
            "title": "Incorrect Burn Event Emission in redeemOzUSD Function",
            "description": "In the redeemOzUSD function of the OzUSD contract, the _emitTransferEvents function incorrectly attributes the burn event to msg.sender instead of the actual account (_from) from which shares are burned. This discrepancy stems from a logic error in event emission, where the source of the burn is misrepresented. While this does not affect the actual token balances or security, it misleads off-chain systems and monitoring tools that rely on accurate event logs. The impact is reduced reliability of event-based tracking, potential confusion in analytics, and incorrect attribution in user interfaces or indexing services.\n",
            "severity": "Medium",
            "location": [
                "OzUSD.sol::redeemOzUSD#198"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-693"
                ]
            },
            "title": "Absence of Pause Functionality During Minting Process",
            "description": "The mintOzUSD function in the ozUSD contract lacks a pause mechanism, meaning there is no way to halt minting in an emergency. The root cause is the omission of a pausable modifier or access-controlled pause function. An attacker or compromised owner could exploit this by forcing continuous minting during a critical vulnerability window, potentially leading to uncontrolled supply inflation. The impact is limited operational flexibility and increased risk during security incidents, though no direct fund loss occurs from the absence alone.\n",
            "severity": "Low",
            "location": [
                "ozUSD.sol::mintOzUSD"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Zero Shares Transfer",
            "description": "The _transferShares function in the ozUSD contract allows the transfer of zero shares, which still emits non-zero token transfer events. This is caused by missing validation against zero-value transfers. An attacker could exploit this to generate unnecessary blockchain events, potentially disrupting indexers or front-ends that process transfer logs. The impact is minimal, limited to gas inefficiency and potential confusion in event processing systems, but does not lead to fund loss.\n",
            "severity": "Low",
            "location": [
                "ozUSD.sol::_transferShares"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Potential Balance Theft due to Zero Share Burning",
            "description": "The _burnShares function in the ozUSD contract allows burning zero shares, which can result in a small amount of USDX being stolen from the contract. The cause is the lack of a zero-check before processing burns. An attacker could call the function with zero shares and still trigger a call to transfer funds, potentially extracting a negligible amount of USDX due to rounding or balance miscalculations. The impact is minimal, involving only a tiny loss of funds, but represents a logic flaw in share accounting.\n",
            "severity": "Low",
            "location": [
                "ozUSD.sol::_burnShares"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-664"
                ]
            },
            "title": "Absence of a USDX to Stablecoin Exchange Mechanism",
            "description": "The USDXBridge contract does not provide a direct mechanism for users to exchange USDX back to deposited stablecoins. This is due to the design choice of relying on off-chain KYC processes for redemptions. Users who do not wish to complete KYC are unable to redeem their tokens, limiting usability. The impact is reduced user autonomy and potential liquidity issues if USDX lacks market trading pairs. While not a security risk, it affects user experience and accessibility.\n",
            "severity": "Low",
            "location": [
                "USDXBridge.sol"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/USDXBridge.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Lack of Fee-on-Transfer Tokens Check",
            "description": "The bridge function in USDXBridge.sol does not account for fee-on-transfer tokens like USDT, which may deduct fees upon transfer. The cause is the assumption of exact token amounts received without post-transfer balance checks. If a fee-on-transfer token activates its fee mechanism, the bridge would mint USDX at a 1:1 ratio based on the pre-fee amount, leading to over-minting. The impact is potential imbalance in backing reserves and inflationary pressure on USDX supply, though currently low risk as major tokens have fees disabled.\n",
            "severity": "Low",
            "location": [
                "USDXBridge.sol::bridge#109-134"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/USDXBridge.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Inefficient Implementation of the stETH Integration",
            "description": "The depositETH() function in LGEStaking.sol stakes ETH to stETH and then wraps it to wstETH, which is inefficient. The root cause is using two steps when the wstETH contract supports direct ETH deposits. While functional, this approach increases complexity and gas usage unnecessarily. There is no direct exploit, but it represents a suboptimal design. The impact is higher gas costs and reduced efficiency, though security is unaffected.\n",
            "severity": "Low",
            "location": [
                "LGEStaking.sol::depositETH"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEStaking.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1287"
                ]
            },
            "title": "_l2Destination in the migrate Function",
            "description": "The migrate function in LGEStaking contract does not validate the _l2Destination parameter, allowing potentially dangerous addresses like ozUSD or wozUSD on L2 to be set as recipients. Although not currently exploitable, this could lead to fund loss if tokens are sent to non-recoverable contract addresses in the future. The cause is missing input validation for destination addresses. The impact is a future risk to system integrity and asset safety if the destination is a contract that cannot return tokens.\n",
            "severity": "Low",
            "location": [
                "LGEStaking.sol::migrate",
                "LGEMigrationV1.sol#80"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEStaking.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused Import",
            "description": "The ISemver interface is imported in LGEStaking.sol but never used. This is a code hygiene issue caused by leftover imports from development. It has no security impact but reduces code clarity and increases bytecode size slightly. The impact is purely maintenance-related, making the codebase harder to audit and understand.\n",
            "severity": "Low",
            "location": [
                "LGEStaking.sol#9"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEStaking.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ],
                "4": [
                    "CWE-1116"
                ]
            },
            "title": "Typographical Errors in Comments",
            "description": "There are typographical errors in comments, such as \"deposted\" instead of \"deposited\" in LGEStaking.sol and \"Statked\" instead of \"Staked\" in LGEMigrationV1.sol. These are documentation issues that do not affect code execution but reduce readability and professionalism. The impact is minimal, limited to confusion during code review or onboarding of new developers.\n",
            "severity": "Low",
            "location": [
                "LGEStaking.sol#37",
                "LGEMigrationV1.sol#31"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEStaking.sol",
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEMigrationV1.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "Missing Zero Address Checks in Constructor",
            "description": "The constructor of LGEMigrationV1.sol does not validate that critical parameters (_owner, _l1StandardBridge, etc.) are non-zero addresses. This could lead to misconfiguration and contract lockups if deployed with invalid inputs. The cause is missing require checks in the constructor. The impact is operational risk and potential redeployment costs, though mitigated by deploy script validations.\n",
            "severity": "Low",
            "location": [
                "LGEMigrationV1.sol::constructor"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEMigrationV1.sol"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-697"
                ]
            },
            "title": "Inefficient Inequality Operator in Deposit Check",
            "description": "The deposit check in LGEStaking.sol uses a strict < comparison instead of <= when enforcing deposit caps. This prevents users from depositing up to the exact cap amount. The cause is incorrect operator usage in require statements. The impact is minor, limiting full utilization of allowed deposits, but does not break core functionality.\n",
            "severity": "Low",
            "location": [
                "LGEStaking.sol#106",
                "LGEStaking.sol#128",
                "USDXBridge.sol#115"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEStaking.sol",
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/USDXBridge.sol"
            ]
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Missing Zero Address and Duplicate Checks in LGEStaking Constructor",
            "description": "The constructor of LGEStaking.sol lacks validation for _owner and _wstETH being non-zero, and does not check for duplicate tokens in the _tokens array. This could lead to misconfiguration or logical errors if duplicates are present. The cause is insufficient input validation. The impact is low, as deployment scripts include checks, but introduces risk if bypassed.\n",
            "severity": "Low",
            "location": [
                "LGEStaking.sol#72-93"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L1/LGEStaking.sol"
            ]
        },
        {
            "id": 15,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-573"
                ],
                "3": [
                    "CWE-695"
                ]
            },
            "title": "Use of assert Instead of require in redeemOzUSD",
            "description": "The redeemOzUSD function uses assert to check the success of a low-level call, which consumes all remaining gas if it fails. The correct practice is to use require for runtime conditions, as it provides better error handling and gas efficiency. The cause is misuse of assertion primitives. The impact is poor debuggability and unnecessary gas costs during failures, but no security breach.\n",
            "severity": "Low",
            "location": [
                "OzUSD.sol#196"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        },
        {
            "id": 16,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Incorrect Recipient in redeemOzUSD Function",
            "description": "The redeemOzUSD function sends tokens to _from instead of msg.sender, which may not align with user expectations. The cause is a design choice that deviates from standard patterns where the caller receives funds. This could confuse users or integrators expecting msg.sender to be the recipient. The impact is usability and clarity issues, potentially leading to incorrect integration assumptions.\n",
            "severity": "Low",
            "location": [
                "OzUSD.sol#195"
            ],
            "files": [
                "dacd9ed9c895c9b6be422531eea15fecc3c2b1d8/Ozean-Contracts/src/L2/OzUSD.sol"
            ]
        }
    ]
}