{
    "path": "dataset-curated/reports/Zellic/Proof of Data Possession - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/FilOzone/pdp"
        ],
        "commit_id": [
            "830396cafd45e696348edcbce5c114725d6d9b32"
        ],
        "address": [],
        "chain": "EVM-compatible",
        "compiler_version": "n/a",
        "audit_date": "2025-03-03",
        "project_path": {
            "pdp": "dataset-curated/contracts/Proof of Data Possession - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ]
            },
            "title": "Proof-set owner can reset proofSetLastProvenEpoch to avoid accumulated fees",
            "description": "The `nextProvingPeriod` function in the PDPVerifier contract removes scheduled roots and, if all roots are deleted, resets `proofSetLastProvenEpoch` and `nextChallengeEpoch` to zero. This behavior allows the proof-set owner to manipulate the fee calculation mechanism, as `proofSetLastProvenEpoch` is used to determine how many blocks have passed since the last proof was submitted, which directly affects the fee amount. By removing all roots and re-adding them, the owner can reset the epoch counter and avoid paying fees that would have accumulated over time. This constitutes a business logic flaw where a legitimate function is exploited to bypass intended economic incentives.\n",
            "severity": "Medium",
            "location": [
                "PDPVerifier.sol::nextProvingPeriod"
            ],
            "files": [
                "pdp/src/PDPVerifier.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-755"
                ],
                "3": [
                    "CWE-248"
                ]
            },
            "title": "Fee refund can revert due to the gas limit or smart wallets",
            "description": "The `calculateAndBurnProofFee` and `createProofSet` functions in the PDPVerifier contract use the `.transfer()` method to refund excess Ether to the caller. This method forwards only 2,300 gas, which is insufficient for contracts with non-trivial fallback or receive functions (e.g., smart wallets, DAOs). As a result, the refund call may revert, causing the entire transaction to fail. This issue affects user experience and accessibility, particularly for smart contract wallets, and stems from the use of an outdated and discouraged pattern in Solidity. The root cause is the reliance on `transfer` instead of a pull-over-push payment model or a low-reverting external call with proper gas forwarding.\n",
            "severity": "Low",
            "location": [
                "PDPVerifier.sol::calculateAndBurnProofFee",
                "PDPVerifier.sol::createProofSet"
            ],
            "files": [
                "pdp/src/PDPVerifier.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-1265"
                ]
            },
            "title": "Reentrancy risk in provePossession during fee refund",
            "description": "The `provePossession` function in the PDPVerifier contract performs a refund via `transfer` before updating the `proofSetLastProvenEpoch` and notifying the listener via an external call. Although `transfer` limits gas to 2,300, making reentrancy currently non-exploitable, this is an unsafe design pattern because future changes in gas costs could render the contract vulnerable. Furthermore, while the current listener (SimplePDPService) includes protections, other compliant listeners might not, potentially allowing reentrant calls to manipulate state before critical updates occur. The root cause is the incorrect ordering of external calls and state changes, violating the checks-effects-interactions pattern.\n",
            "severity": "Informational",
            "location": [
                "PDPVerifier.sol::provePossession",
                "PDPVerifier.sol::calculateAndBurnProofFee"
            ],
            "files": [
                "pdp/src/PDPVerifier.sol"
            ]
        }
    ]
}