{
    "path": "dataset-curated/reports/Zellic/SP1 Helios - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/succinctlabs/sp1-helios"
        ],
        "commit_id": [
            "51b1e4aaee2e3e614dd589b1fa83594aa7b528b6"
        ],
        "address": null,
        "chain": "EVM-compatible",
        "compiler_version": "n/a",
        "audit_date": "2025-07-18",
        "project_path": {
            "sp1-helios": "dataset-curated/contracts/SP1 Helios - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-693"
                ]
            },
            "title": "No test suite is in place",
            "description": "The project lacks a test suite for both the SP1Helios.sol verifier contract and the SP1 Helios programs used to generate ZK proofs. This includes both unit and integration tests that would validate core functionality and interactions with external systems like the Beacon chain. The absence of tests increases the risk of undetected bugs and design flaws, especially as the codebase evolves. Without tests, it is difficult to verify that functions behave as intended under both normal and edge-case conditions. This lack of testing also reduces code maturity, hinders developer confidence during refactoring, and makes it harder for auditors and new developers to understand the system. The impact is critical because untested code in a security-critical system like a ZK light client can lead to undetected vulnerabilities that may result in loss of trust, incorrect state verification, or system failure.\n",
            "severity": "Critical",
            "location": [
                "contracts/src/SP1Helios.sol",
                "program/src/light_client.rs",
                "program/src/storage.rs"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-665"
                ],
                "3": [
                    "CWE-1419"
                ]
            },
            "title": "Incorrect state-variable initialization in the constructor",
            "description": "The constructor of the SP1Helios contract incorrectly initializes the executionStateRoots mapping by using params.head as the key instead of params.executionBlockNumber. Additionally, the executionBlockNumber state variable is not initialized at all. This is a coding mistake in the contract's initialization logic. As a result, the executionStateRoots mapping does not correctly associate the execution state root with the correct block number, which is required by the updateStorageSlot function. This causes any call to updateStorageSlot before the first update to fail, as it cannot retrieve the correct state root. Furthermore, the latestExecutionStateRoot and latestExecutionBlockNumber functions will return incorrect or uninitialized data. The impact is medium because while the issue breaks expected functionality and could disrupt user operations, it does not directly lead to fund loss or complete system compromise, and can be resolved after the first update.\n",
            "severity": "Medium",
            "location": [
                "SP1Helios.sol::constructor"
            ],
            "files": [
                "sp1-helios/contracts/src/SP1Helios.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Rust bindings of SP1Helios contract are out of sync",
            "description": "The Rust bindings defined in primitives/src/types.rs using the sol! macro include a getCurrentSlot() function that does not exist in the actual SP1Helios contract. Instead, the contract has a getStorageSlot function. This mismatch is due to outdated bindings that were not updated to reflect the current contract interface. Although the getCurrentSlot function is not currently used in the project, its presence in the bindings could lead to runtime errors if future code attempts to call it. Additionally, the absence of the getStorageSlot function in the bindings prevents its use in Rust-level code. The impact is informational because no active functionality is currently broken, but it affects code maintainability and developer experience.\n",
            "severity": "Informational",
            "location": [
                "primitives/src/types.rs"
            ],
            "files": [
                "sp1-helios/primitives/src/types.rs"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-571"
                ]
            },
            "title": "Redundant check on prevSyncCommitteeHash",
            "description": "In the update function of SP1Helios.sol, there is a redundant check that verifies currentSyncCommitteeHash against po.prevSyncCommitteeHash. Both values are derived from the same source: syncCommittees[getSyncCommitteePeriod(head)]. Therefore, this comparison is guaranteed to pass under correct execution and adds no security value. The cause is unnecessary defensive coding that does not account for the deterministic derivation of both values. This redundant check increases gas consumption and adds code complexity without benefit. The impact is informational because it does not introduce a security vulnerability, but it represents a minor inefficiency and a code quality issue that could confuse developers.\n",
            "severity": "Informational",
            "location": [
                "SP1Helios.sol::update#"
            ],
            "files": [
                "sp1-helios/contracts/src/SP1Helios.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused errors in the SP1Helios contract",
            "description": "The SP1Helios contract defines several error types—PrevHeadMismatch, PrevHeaderMismatch, HeaderRootAlreadySet, SyncCommitteeAlreadySet, and StateRootAlreadySet—that are declared but never used in the codebase. This is a code hygiene issue resulting from incomplete cleanup after development or refactoring. While these errors do not affect runtime behavior, their presence can mislead developers into thinking they are handled in certain code paths, reducing code readability and maintainability. Future developers may waste time searching for where these errors are thrown, or may incorrectly assume certain checks are in place. The impact is informational as there is no direct security risk, but it reflects poorly on code quality and long-term maintainability.\n",
            "severity": "Informational",
            "location": [
                "SP1Helios.sol"
            ],
            "files": [
                "sp1-helios/contracts/src/SP1Helios.sol"
            ]
        }
    ]
}