{
    "path": "dataset-curated/reports/Zenith/Spectral (PR-29) - Zenith Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Spectral-Finance/autonomous-agent-contracts"
        ],
        "commit_id": [
            "a62aa05d2f327b226d8031cbcf28b51e6f1d387f"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-05-28",
        "project_path": {
            "autonomous-agent-contracts": "dataset-curated/contracts/Spectral (PR-29) - Zenith Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "[H-1] The withdrawn amount should be tracked separately for each token",
            "description": "1. **Description:** The vulnerability arises because the `userPointsWithdrawn` state variable tracks the total withdrawn points per user across all tokens, rather than tracking withdrawals separately per token. This causes incorrect reversion when a user attempts to withdraw points for one token after having already withdrawn points for another.\n\n2. **Cause:** The root cause is the use of a single-level mapping `mapping(address => uint256)` to store withdrawn amounts, which does not differentiate between different token types. As a result, the withdrawal limit check aggregates withdrawals across tokens, leading to incorrect validation.\n\n3. **Exploitation:** An attacker cannot directly steal funds, but legitimate users are prevented from withdrawing their entitled tokens if they have already withdrawn points for another token. This could be exploited in a denial-of-service manner against specific users by forcing early withdrawals.\n\n4. **Impact:** Users may be unable to claim their full allocated rewards for certain tokens, leading to loss of access to entitled funds and reduced user trust in the system.\n",
            "severity": "High",
            "location": [
                "OctoDistributor.sol::withdrawPoints#524-531"
            ],
            "files": [
                "autonomous-agent-contracts/contracts/octoDistributor/OctoDistributor.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "[L-1] The rewards could be withdrawn for both tokens if the same Merkle Root is updated",
            "description": "1. **Description:** If the same Merkle root is accidentally set for two different tokens, users can claim their allocated rewards for both tokens using the same proof, because the leaf node does not include the token address.\n\n2. **Cause:** The leaf in the Merkle tree is constructed only from the user address and total amount (`keccak256(abi.encodePacked(msg.sender, totalAmount))`), omitting the `_token` parameter. This allows the same proof to validate claims across multiple tokens if the root is duplicated.\n\n3. **Exploitation:** An attacker could monitor root updates and, upon detecting identical roots for different tokens, submit duplicate claims using the same Merkle proof for multiple tokens.\n\n4. **Impact:** This could lead to an over-distribution of rewards, where users receive more tokens than allocated, potentially depleting the reward pool and causing financial loss to the protocol.\n",
            "severity": "Low",
            "location": [
                "OctoDistributor.sol#L517"
            ],
            "files": [
                "autonomous-agent-contracts/contracts/octoDistributor/OctoDistributor.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ],
                "4": [
                    "CWE-778"
                ]
            },
            "title": "[I-1] MerkleRootUpdated event omits the token address",
            "description": "1. **Description:** The `MerkleRootUpdated` event does not include the token address, making it impossible for off-chain services to determine which token's Merkle root was updated.\n\n2. **Cause:** The event is defined as `event MerkleRootUpdated(bytes32 oldRoot, bytes32 newRoot);`, lacking the `_token` parameter that would identify the affected token.\n\n3. **Exploitation:** While not directly exploitable by an attacker, this omission hampers monitoring tools and indexing services, increasing the risk of delayed detection of malicious or erroneous root changes.\n\n4. **Impact:** Reduced observability and auditability of the system, potentially delaying incident response and reducing transparency for users and administrators.\n",
            "severity": "Informational",
            "location": [
                "OctoDistributor.sol#L96",
                "OctoDistributor.sol#L501"
            ],
            "files": [
                "autonomous-agent-contracts/contracts/octoDistributor/OctoDistributor.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-691"
                ]
            },
            "title": "[I-2] withdrawPoints doesn't implement nonReentrant modifier",
            "description": "1. **Description:** The `withdrawPoints` function lacks the `nonReentrant` modifier, while other similar functions in the contract do include it, creating an inconsistency in reentrancy protection.\n\n2. **Cause:** The omission of the `nonReentrant` modifier exposes the function to potential reentrancy attacks if combined with external calls that can be manipulated by malicious contracts.\n\n3. **Exploitation:** An attacker could potentially re-enter the `withdrawPoints` function during execution (e.g., via a malicious token's `transfer` callback) to withdraw rewards multiple times before the state is updated.\n\n4. **Impact:** Although the risk is low due to the use of `safeTransfer` and the structure of the function, the absence of the modifier increases the attack surface and contradicts the project's own security practices.\n",
            "severity": "Informational",
            "location": [
                "OctoDistributor.sol#L510"
            ],
            "files": [
                "autonomous-agent-contracts/contracts/octoDistributor/OctoDistributor.sol"
            ]
        }
    ]
}