{
    "path": "dataset-curated/reports/OpenZeppelin/UMA Oracle Bridging Contracts Upgrade Audit.md",
    "project_info": {
        "url": [
            "https://github.com/UMAprotocol/protocol"
        ],
        "commit_id": [
            "a005938dc43b0496608b5d1212abd4026f7490d8"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-03",
        "project_path": {
            "protocol": "dataset-curated/contracts/UMA Oracle Bridging Contracts Upgrade Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-439"
                ]
            },
            "title": "Oracle Upgrades Can Make Prices Inaccessible",
            "description": "The vulnerability arises because new request IDs in the Oracle system are calculated using the `requester` address, and functions like `hasPrice` and `getPrice` rely on `msg.sender` as the `requester` to retrieve price data. If the `OptimisticOracleV2` contract is upgraded to a new implementation, the new instance will not recognize or be able to access prices submitted through the previous version, as the requester-based request ID derivation would not persist across contract instances. This could result in previously submitted prices becoming inaccessible after an upgrade. The root cause is the dependency on `msg.sender` for request ID generation, which ties price resolution to the specific contract instance. While the team acknowledged the issue, they resolved it by removing the `requester` from the child request ID derivation, simplifying future upgrades and ensuring backward compatibility in request resolution.\n",
            "severity": "Low",
            "location": [
                "OracleSpoke.sol::_encodePriceRequest",
                "OracleChildTunnel.sol::_encodePriceRequest"
            ],
            "files": [
                "protocol/packages/core/contracts/cross-chain-oracle/OracleSpoke.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Misleading or Incorrect Docstrings",
            "description": "Several docstrings and comments in the codebase are inaccurate or unclear, potentially leading to misunderstandings during maintenance or integration. Specifically, the use of \"its\" instead of \"it is\", references to \"ancillary data\" instead of \"compressed ancillary data\", and incorrect statements about conditional compression when in fact compression is always applied, all contribute to misleading documentation. The cause is outdated or imprecise commenting that does not reflect the current implementation. While this does not introduce direct security risks, it can lead to incorrect assumptions by developers or off-chain systems interacting with the contracts. The impact is reduced code clarity and potential integration errors. These issues were resolved by updating the relevant comments in the codebase.\n",
            "severity": "Informational",
            "location": [
                "AncillaryDataCompression.sol#L17",
                "AncillaryDataCompression.sol#L19",
                "OracleSpoke.sol#L107-L108",
                "OracleSpoke.sol#L252",
                "OracleChildTunnel.sol#L196"
            ],
            "files": [
                "protocol/packages/core/contracts/cross-chain-oracle/AncillaryDataCompression.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-799"
                ],
                "3": [
                    "CWE-837"
                ]
            },
            "title": "Repeated Event Emissions",
            "description": "The `resolveLegacyRequest` function in the `OracleSpoke` contract allows setting a price for any `childRequester` once a legacy request has been resolved, which can result in the `ResolvedLegacyRequest` event being emitted multiple times for the same request. The cause is the lack of restrictions on who can call this function and how often, combined with the fact that the previous `OracleSpoke` did not include the requester in stamped ancillary data. An attacker or misbehaving actor could emit redundant events, potentially confusing off-chain indexing services that rely on these events for state tracking. While the team acknowledged this behavior, they determined it does not impact core functionality since off-chain components can filter events using recalculated `priceRequestId` hashes. The impact is limited to potential inefficiencies in event processing.\n",
            "severity": "Informational",
            "location": [
                "OracleSpoke.sol::resolveLegacyRequest#157"
            ],
            "files": [
                "protocol/packages/core/contracts/cross-chain-oracle/OracleSpoke.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Verification Script is Missing One Check",
            "description": "The verification script for the upgrade process fails to check whether the `CONTRACT_CREATOR` role has been properly revoked after the upgrade. The root cause is an incomplete validation suite in the script, which omits a critical post-upgrade security check. If such roles are retained unnecessarily, they could be exploited if compromised in the future, leading to unauthorized contract modifications. The potential exploitation path involves an attacker leveraging a retained privileged role to perform unauthorized actions. The impact is an increased attack surface due to lingering permissions. This issue was resolved by adding the missing validation step in a subsequent commit.\n",
            "severity": "Informational",
            "location": [
                "packages/scripts/src/admin-proposals/upgrade-oo-request-bridging/4_Verify.ts",
                "packages/scripts/src/admin-proposals/upgrade-oo-request-bridging/2_Propose.ts#L102-L113"
            ],
            "files": [
                "protocol/packages/scripts/src/admin-proposals/upgrade-oo-request-bridging/4_Verify.ts"
            ]
        }
    ]
}