{
    "path": "dataset-curated/reports/OpenZeppelin/USDT0 Polygon Integration Audit.md",
    "project_info": {
        "url": [
            "https://github.com/across-protocol/contracts"
        ],
        "commit_id": [
            "d9826e30b51bbb3067df07c9532f4a5f6fe56f1c"
        ],
        "address": null,
        "chain": "polygon",
        "compiler_version": "n/a",
        "audit_date": "2025-08-25",
        "project_path": {
            "contracts": "dataset-curated/contracts/USDT0 Polygon Integration Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ]
            },
            "title": "Excess Gas Remains in `SpokePool`",
            "description": "The `executeRelayerRefundLeaf` function in `Polygon_SpokePool` calls `_transferViaOFT`, which relies on `_messenger.quoteSend` to determine the required fee for a cross-chain transfer. Users must call `quoteSend` beforehand to determine how much native gas to forward with the transaction. However, if the quoted fee decreases between the time of quoting and execution, the amount of gas sent may exceed what is actually needed. The root cause is the lack of a mechanism to refund excess native tokens sent with the transaction. An attacker or user could exploit this by intentionally overestimating the fee, leading to leftover funds being trapped in the contract. The impact is a loss of gas funds for users, reducing efficiency and potentially leading to user error or economic loss.\n",
            "severity": "Medium",
            "location": [
                "SpokePool.sol::executeRelayerRefundLeaf#1208-1212",
                "OFTTransportAdapter.sol::_transferViaOFT#69",
                "OFTTransportAdapter.sol::_messenger.send#102"
            ],
            "files": [
                "contracts/contracts/SpokePool.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-437"
                ]
            },
            "title": "Fee Cap May Be Too Low",
            "description": "The `Polygon_SpokePool` contract is deployed with a fee cap of `1e18` POL, which may be insufficient to cover the actual cost of executing a transaction on the destination chain (Ethereum mainnet). The fee is calculated in destination chain terms but paid in source chain tokens (POL), which have a much lower value compared to ETH. The root cause is the static and potentially underestimated fee cap that does not account for the exchange rate between POL and ETH or actual L1 execution costs. An attacker cannot directly exploit this, but legitimate users may find their cross-chain transfers failing if the required fee exceeds the cap. The impact is a denial of service for USDT0 transfers from Polygon to Ethereum mainnet when network fees are high, undermining the reliability of the bridge functionality.\n",
            "severity": "Medium",
            "location": [
                "Polygon_SpokePool.sol#(constructor)",
                "deploy/011_deploy_polygon_spokepool.ts#24"
            ],
            "files": [
                "contracts/contracts/Polygon_SpokePool.sol"
            ]
        }
    ]
}