{
    "path": "dataset-curated/reports/OpenZeppelin/USDT0 Child Token Audit.md",
    "project_info": {
        "url": [
            "https://github.com/Everdawn-Labs/pos-portal/"
        ],
        "commit_id": [
            "6a81fd7529dcb5a70116d0c0326fdc5ae23da5e1"
        ],
        "address": [
            "0xc2132D05D31c914a87C6611C10748AEb04B58e8F"
        ],
        "chain": "polygon",
        "compiler_version": "v0.6.6+commit.6c089d02",
        "audit_date": "2025-05-05",
        "project_path": {
            "UChildERC20Proxy": "dataset-curated/contracts/USDT0 Child Token Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-430"
                ]
            },
            "title": "PoS USDT Is Upgraded to the Wrong Implementation",
            "description": "The deployment script for upgrading the USDT token on Polygon specifies an incorrect implementation address, pointing to an old standard ERC-20 contract instead of the intended `UChildUSDT0` implementation. This misconfiguration is caused by an erroneous address in the script's input file. If executed, an attacker could exploit this to deploy a malicious or non-functional contract as the new USDT implementation, leading to a complete loss of functionality, frozen funds, or potential theft. The impact would be severe, disrupting the entire migration process and potentially compromising user assets.\n",
            "severity": "High",
            "location": [
                "UChildUSDT0Update.s.sol",
                "input.json#L3",
                "https://polygonscan.com/address/0x4350806Aa2508A44aaB4cB87A0EeCE362D882f11"
            ],
            "files": []
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-362"
                ]
            },
            "title": "UChildUSDT0Update Script Upgrades Without Initialization",
            "description": "The `UChildUSDT0Update` script allows upgrading the proxy to the new implementation without simultaneously calling the initializer function. This is a critical design flaw because the new `UChildUSDT0` contract requires initialization to set up roles and parameters, and the initializer is publicly callable. An attacker could monitor the blockchain and, upon observing an upgrade without initialization, race to call the initializer themselves, thereby gaining full administrative control over the contract. This would allow them to mint tokens, blacklist users, or drain funds. The root cause is the lack of atomicity between upgrade and initialization in the migration script.\n",
            "severity": "High",
            "location": [
                "UChildUSDT0Update.s.sol",
                "UpdateImplementationMultisig.s.sol#L40",
                "input.json#L4"
            ],
            "files": []
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-269"
                ],
                "3": [
                    "CWE-250"
                ]
            },
            "title": "Arbitrary Call Is Overly Permissive When Migrating Token",
            "description": "The `migrateTokens` function in the `ERC20Predicate` contract grants the `MANAGER_ROLE` the ability to make arbitrary calls from the contract, which is excessive for the intended purpose of simply transferring USDT to a designated receiver. This over-permissioned functionality could be exploited by a malicious or compromised manager to drain funds or execute unauthorized operations on other contracts. The root cause is the lack of function-specific restrictions, allowing any call to be made instead of limiting it strictly to the `transfer` function of the USDT contract. This increases the attack surface and undermines the principle of least privilege.\n",
            "severity": "Medium",
            "location": [
                "ERC20Predicate.sol#L118"
            ],
            "files": []
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Unsettled Zero Input Amount for Bridge Fund Migration",
            "description": "The `MigrateBridgeFunds` script requires a manually specified token amount in its input file, which is currently set to zero as an unsettled placeholder. This creates a risk of incorrect or incomplete migration of USDT funds from the `ERC20Predicate` contract to the new LayerZero adapter. The correct amount should reflect the total supply of USDT on Polygon after the upgrade. If not properly set, this could result in either insufficient funds being migrated (disrupting withdrawals) or excess funds being transferred (potentially locking value). The cause is a missing automated calculation or verification step in the migration process.\n",
            "severity": "Medium",
            "location": [
                "MigrateBridgeFunds.s.sol",
                "input.json#L6"
            ],
            "files": []
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-358"
                ]
            },
            "title": "Missing Support for Contract Signatures",
            "description": "The `permit` function in the `UChildUSDT0` contract only supports ECDSA signatures from externally owned accounts (EOAs) and does not support signatures from smart contract wallets via EIP-1271. This limitation excludes users of modern smart account systems and reduces the contract's compatibility with emerging wallet standards like EIP-7702. The root cause is the direct use of `ecrecover` without a generalized signature verification mechanism. While not immediately exploitable, this could lead to user frustration and reduced adoption as the ecosystem shifts toward smart contract wallets.\n",
            "severity": "Low",
            "location": [
                "UChildUSDT0.sol#L35-L67"
            ],
            "files": []
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "Missing Support for EIP-3009",
            "description": "The developer documentation claims support for EIP-3009 (gasless transfers), but the `UChildUSDT0` contract does not implement the required `transferWithAuthorization` and `receiveWithAuthorization` functions. This discrepancy misleads developers and users who expect gasless transfer functionality, potentially leading to integration errors or failed transactions. The cause is an omission in the contract implementation despite documentation claims. This undermines trust in the project's documentation and limits the utility of the token.\n",
            "severity": "Low",
            "location": [
                "UChildUSDT0.sol#L9-L197",
                "developer documentation"
            ],
            "files": [
                "UChildERC20Proxy/UChildERC20Proxy.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-799"
                ],
                "3": [
                    "CWE-837"
                ]
            },
            "title": "Redundant Event Emission",
            "description": "The `addToBlockedList` and `removeFromBlockedList` functions in `WithBlockedList.sol` emit events without first checking if the blocklist state has actually changed. This can result in redundant events being emitted when an address is added or removed multiple times, leading to unnecessary gas costs and potentially misleading off-chain monitoring systems. The root cause is the absence of a state-diff check before event emission. While the impact is minor, it affects efficiency and data reliability.\n",
            "severity": "Low",
            "location": [
                "WithBlockedList.sol#L37",
                "WithBlockedList.sol#L42"
            ],
            "files": [
                "UChildERC20Proxy/UChildERC20Proxy.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Missing ERC-165 Support",
            "description": "The `UChildUSDT0` contract implements EIP-7802 but does not support ERC-165, meaning it lacks the `supportsInterface` function to advertise its interface compliance. This makes it harder for external contracts to reliably detect whether the contract supports specific standards, reducing interoperability. The cause is the omission of the `IERC165` interface and implementation. Although the functionality exists, the lack of standard discovery mechanism is a compatibility issue.\n",
            "severity": "Low",
            "location": [
                "UChildUSDT0.sol#L9-L197"
            ],
            "files": [
                "UChildERC20Proxy/UChildERC20Proxy.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ]
            },
            "title": "Missing Zero-Address Check",
            "description": "The `upgradeToUSDT0` function in `UChildUSDT0.sol` does not validate that the `newAdmin` parameter is not the zero address. If accidentally set to zero, the contract could become unmanageable, as administrative functions would be inaccessible. This is a common configuration risk in upgradeable contracts. The root cause is the lack of input validation for critical address parameters. This could lead to permanent loss of control if triggered.\n",
            "severity": "Low",
            "location": [
                "UChildUSDT0.sol#L16"
            ],
            "files": [
                "UChildERC20Proxy/UChildERC20Proxy.sol"
            ]
        }
    ]
}