{
    "path": "dataset-curated/reports/Zenith/Virtuals Protocol Genesis - Zenith Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/Virtual-Protocol/vp-genesis-contract",
            "https://github.com/Virtual-Protocol/protocol-contracts"
        ],
        "commit_id": [
            "14b458cd8ffbb4a1f866cbc289f603afc0161365",
            "2f51fc99606d83d7d8ca00d14f52d43e08c873dc"
        ],
        "address": [
            null
        ],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2025-04-04",
        "project_path": {
            "protocol-contracts": "dataset-curated/contracts/Virtuals Protocol Genesis - Zenith Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-282"
                ],
                "3": [
                    "CWE-708"
                ]
            },
            "title": "Wrong creator address is set during Agent token launch",
            "description": "The vulnerability occurs when the Bonding.launch() function sets msg.sender (the Genesis contract) as the creator of a new Agent token, instead of the actual user who initiated the Genesis creation. This happens because the function does not accept an explicit creator address parameter, defaulting to msg.sender. As a result, the Genesis contract becomes the recorded creator, which is problematic because it cannot interact with the Agent Factory or voting systems. This leads to a situation where the creator—supposed to have proposer privileges such as withdrawing an application or becoming an LP staker via veToken—is an inoperable contract. An attacker could potentially exploit this by launching a token and then preventing proper governance actions due to the invalid creator, undermining the intended permission model and decentralization goals.\n",
            "severity": "High",
            "location": [
                "Bonding.sol#L250",
                "AgentFactoryV3.sol#L555"
            ],
            "files": [
                "2f51fc99606d83d7d8ca00d14f52d43e08c873dc/protocol-contracts/contracts/fun/Bonding.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-400"
                ],
                "3": [
                    "CWE-405"
                ],
                "4": [
                    "CWE-1050"
                ]
            },
            "title": "Potential OOG error in onGenesisFailed",
            "description": "The Genesis contract maintains a dynamic array of participants who have pledged tokens. In the event of a failed genesis, the onGenesisFailed function iterates over this entire array to refund participants. The vulnerability lies in the unbounded loop over the participants array, which could grow arbitrarily large. A malicious actor could exploit this by creating numerous small participations, bloating the array and causing the onGenesisFailed function to consume more gas than the block limit allows, resulting in a denial of service where refunds cannot be processed. This out-of-gas (OOG) condition would prevent legitimate users from reclaiming their funds, especially those later in the array, leading to potential loss of access to their tokens.\n",
            "severity": "Medium",
            "location": [
                "Genesis.sol#L435-L447"
            ],
            "files": [
                "2f51fc99606d83d7d8ca00d14f52d43e08c873dc/protocol-contracts/contracts/genesis/Genesis.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Token refund inequity risk in Genesis contract's failure state transition",
            "description": "The vulnerability arises when onGenesisFailed() is called after the agent token has already been launched. During launch, a portion of the virtual tokens (reserveAmount) is sent to the virtualsFactoryAddress, reducing the contract's balance. However, onGenesisFailed() attempts to refund all participants their full original amounts without accounting for this spent reserve. This can lead to an insufficient token balance in the contract, causing transfers to fail or the entire transaction to revert. As a result, participants earlier in the array may receive full refunds while those later may receive nothing, creating an unfair and inequitable distribution. This undermines trust in the protocol's fairness and could lead to user disputes or loss of funds for late-positioned participants.\n",
            "severity": "Low",
            "location": [
                "Genesis.sol"
            ],
            "files": [
                "2f51fc99606d83d7d8ca00d14f52d43e08c873dc/protocol-contracts/contracts/genesis/Genesis.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "Genesis failure after token launch may cause issues",
            "description": "This issue occurs when onGenesisFailed() is invoked after the agent token has been launched, meaning that some virtual tokens have already been used for the initial purchase via the factory. The function attempts to refund all participants their full pledged amounts, but the contract may no longer hold sufficient tokens due to prior spending. This could result in partial or failed refunds, depending on the remaining balance and the order of iteration. The root cause is the lack of a guard clause preventing onGenesisFailed() from being called post-launch. While the impact is limited to refund integrity, it introduces operational risk and potential user fund loss if admins误trigger the failure state after a successful launch.\n",
            "severity": "Low",
            "location": [
                "Genesis.sol#L284-L300"
            ],
            "files": [
                "2f51fc99606d83d7d8ca00d14f52d43e08c873dc/protocol-contracts/contracts/genesis/Genesis.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Additional checks needed when creating a Genesis",
            "description": "The vulnerability stems from missing validation of critical parameters during Genesis creation, specifically cores.length and reserveAmount. The Bonding.launch() function requires cores.length > 0 and reserveAmount > fee, but these conditions are not enforced in FGenesis.createGenesis or FGenesis.reserveAmount. If invalid parameters are passed, the subsequent launch will revert, causing the Genesis event to fail and requiring manual refunds. This increases operational overhead and user friction. An attacker could potentially exploit this by initiating a Genesis with invalid parameters, forcing a failure and disrupting the process. The lack of upfront validation reduces system robustness and user experience.\n",
            "severity": "Low",
            "location": [
                "FGenesis.sol#L151",
                "FGenesis.sol#L78",
                "Bonding.sol#L197-L202"
            ],
            "files": [
                "2f51fc99606d83d7d8ca00d14f52d43e08c873dc/protocol-contracts/contracts/genesis/FGenesis.sol"
            ]
        }
    ]
}