{
    "path": "dataset-curated/reports/Zellic/Wrapped Staked TAO - Zellic Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/latent-to/wsttao"
        ],
        "commit_id": [
            "ac3b5034c010d0a04c6fd654713cd4a87a803547"
        ],
        "address": [],
        "chain": "EVM",
        "compiler_version": "n/a",
        "audit_date": "2025-06-04",
        "project_path": {
            "wsttao": "dataset-curated/contracts/Wrapped Staked TAO - Zellic Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Lack of test suite",
            "description": "1. **Description:** The project lacks a comprehensive functional test suite, relying only on scripts for interaction rather than proper testing. The existing nonfunctional tests only verify intended code branches without covering edge cases or failure conditions.\n2. **Cause:** The absence of a structured testing framework or suite that includes both positive and negative test scenarios, including invariant checks and mathematical property validations.\n3. **Exploitation:** While not directly exploitable, the lack of testing increases the risk of undetected bugs or logic flaws being deployed, especially during future upgrades or refactors.\n4. **Impact:** This significantly weakens the security posture of the contract, as untested code may contain hidden vulnerabilities. It also reduces developer confidence, hinders long-term maintenance, and undermines trust from users and auditors.\n",
            "severity": "Medium",
            "location": [],
            "files": []
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "Lack of minimum for staking",
            "description": "1. **Description:** The stake function does not enforce a minimum staking amount when the pool is empty, despite Bittensor requiring a 500,000 RAO minimum and charging 50,000 RAO fees for staking and unstaking. As a result, the first staker must effectively stake 600,000 RAO to cover both the staking fee and reserve for the unstaking fee.\n2. **Cause:** Missing a conditional requirement in the stake function to enforce a higher minimum (600,000 RAO) when the current stake is zero.\n3. **Exploitation:** A user who stakes only the minimum 500,000 RAO would be unable to unstake until another user stakes, as the contract would lack sufficient balance to pay the 50,000 RAO unstaking fee.\n4. **Impact:** This could lead to user funds being temporarily locked, creating a poor user experience and potential loss of trust in the protocol.\n",
            "severity": "Medium",
            "location": [
                "wstTAO.sol::stake#"
            ],
            "files": [
                "wsttao/contracts/wstTAO.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-665"
                ],
                "3": [
                    "CWE-909"
                ]
            },
            "title": "Inconsistent staking fee",
            "description": "1. **Description:** The first staking transaction incurs a higher fee (50,500 RAO) due to the need to cover the existential deposit (500 RAO) for the contract's coldkey on Bittensor, while subsequent stakes only require 50,000 RAO.\n2. **Cause:** The contract's coldkey does not have the minimum balance pre-deposited, so the first staker must pay the additional 500 RAO to activate the wallet.\n3. **Exploitation:** The first staker bears an unfair cost compared to later users, creating an inequitable fee structure.\n4. **Impact:** This leads to unfair treatment of early users and could discourage initial participation in the staking pool.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "wsttao/contracts/wstTAO.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Redundant console.log statements from codebase",
            "description": "1. **Description:** The contract contains multiple console.log statements that are useful during development but serve no purpose in production.\n2. **Cause:** Developers left debugging logs in the code without removing them before deployment.\n3. **Exploitation:** These statements cannot be exploited but increase gas costs slightly and clutter the code.\n4. **Impact:** While not a security risk, this reduces code readability and maintainability, and may lead to higher transaction costs.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "wsttao/contracts/wstTAO.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-665"
                ],
                "3": [
                    "CWE-1419"
                ]
            },
            "title": "Uninitialized staking state",
            "description": "1. **Description:** In the upgradable contract WrappedStakedTAO, the staking state is set in the constructor instead of the initialize function, which is unsafe for upgradeable contracts.\n2. **Cause:** Improper initialization pattern for upgradeable contracts using OpenZeppelin's UUPS proxy pattern, where state variables should be initialized in the initialize function, not the constructor.\n3. **Exploitation:** Since the staking variable is only used to get function selectors (not for state-dependent logic), this does not pose a direct security risk.\n4. **Impact:** This is an informational issue that affects code correctness and maintainability, potentially confusing developers and increasing the risk of errors in future upgrades.\n",
            "severity": "Informational",
            "location": [
                "WrappedStakedTAO.sol::constructor",
                "WrappedStakedTAO.sol::initialize"
            ],
            "files": [
                "wsttao/contracts/wstTAO.sol"
            ]
        }
    ]
}