{
    "path": "dataset-curated/reports/Zenith/Zenith - SSI Protocol Audit Report.pdf",
    "project_info": {
        "url": [
            "https://github.com/SoSoValueLabs/ssi-protocol"
        ],
        "commit_id": [
            "584f29cda02369b1483f7c5eefb2eb5634abb565"
        ],
        "address": [],
        "chain": "evm",
        "compiler_version": "n/a",
        "audit_date": "2024-12-04",
        "project_path": {
            "ssi-protocol": "dataset-curated/contracts/Zenith - SSI Protocol Audit Report.pdf-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-693"
                ]
            },
            "title": "Missing pause function in `USSI`",
            "description": "1. **Description:** The USSI contract lacks a pause function, which could prevent administrators from halting operations during emergencies or critical bugs.\n2. **Cause:** The absence of a pausable mechanism in the contract design.\n3. **Exploitation:** An attacker could continue to exploit ongoing operations if a vulnerability is discovered while the system remains active.\n4. **Impact:** Lack of operational control may lead to prolonged exposure to risks, potentially resulting in financial loss or system instability.\n",
            "severity": "Medium",
            "location": [],
            "files": [
                "ssi-protocol/src/USSI.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ],
                "3": [
                    "CWE-672"
                ]
            },
            "title": "cancelSwapRequest() old orderInfo using new swap causing failure to cancel",
            "description": "1. **Description:** The cancelSwapRequest function uses outdated orderInfo after a new swap has been processed, leading to a mismatch and failure in cancellation.\n2. **Cause:** The function does not validate the state or version of the orderInfo against the current swap data.\n3. **Exploitation:** A user attempting to cancel a swap may be unable to do so if the orderInfo is outdated, allowing the swap to proceed undesired.\n4. **Impact:** Users may suffer unintended transactions, leading to potential loss of funds or incorrect asset transfers.\n",
            "severity": "Medium",
            "location": [],
            "files": [
                "ssi-protocol/src/Swap.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-221"
                ],
                "3": [
                    "CWE-223"
                ]
            },
            "title": "setIssuer() Missing change issuers[assetID] to newest",
            "description": "1. **Description:** The setIssuer function does not update the issuers mapping to the newest issuer for a given assetID.\n2. **Cause:** The function logic fails to assign the new issuer value to the storage variable.\n3. **Exploitation:** An old or unauthorized issuer may retain control over asset issuance.\n4. **Impact:** This could allow unauthorized minting or management of assets, compromising the integrity of the system.\n",
            "severity": "Medium",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetFactory.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "Fee will be temporarily uncollectable when all assetTokens are burnt",
            "description": "1. **Description:** If all assetTokens are burnt, the fee collection mechanism becomes inoperable until new tokens are minted.\n2. **Cause:** The fee logic depends on the existence of assetTokens to calculate or collect fees.\n3. **Exploitation:** An attacker could force a state where fees cannot be collected by burning all tokens.\n4. **Impact:** Revenue loss for the protocol due to inability to collect fees during the zero-token state.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetToken.sol"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1284"
                ]
            },
            "title": "Lack of zero value check for `issueFee` could DoS minting/redeeming",
            "description": "1. **Description:** The issueFee parameter is not checked for zero value, which could lead to denial of service in minting or redeeming functions.\n2. **Cause:** Missing input validation for issueFee.\n3. **Exploitation:** Setting issueFee to zero could disable minting or redeeming by breaking expected logic flows.\n4. **Impact:** Users may be unable to mint or redeem tokens, resulting in a denial of service.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetIssuer.sol"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-707"
                ],
                "2": [
                    "CWE-20"
                ],
                "3": [
                    "CWE-1288"
                ]
            },
            "title": "Lack of duplicate check in rebalance will cause baskets to be filled with duplicate tokens",
            "description": "1. **Description:** The rebalance function does not check for duplicate tokens, allowing the same token to be added multiple times to a basket.\n2. **Cause:** Absence of deduplication logic in the rebalance process.\n3. **Exploitation:** An attacker could manipulate basket composition by inserting duplicate tokens.\n4. **Impact:** Distorted basket valuation and potential financial loss due to incorrect asset representation.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetToken.sol",
                "ssi-protocol/src/AssetRebalancer.sol"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-862"
                ]
            },
            "title": "Lack of requester check for `orderHash` allows DoS of swap request",
            "description": "1. **Description:** The system does not verify that the requester of a swap is the rightful owner of the orderHash, enabling third parties to disrupt requests.\n2. **Cause:** Missing authorization check on orderHash usage.\n3. **Exploitation:** An attacker can submit conflicting or invalid requests using known orderHashes.\n4. **Impact:** Legitimate swap requests may be blocked or fail, leading to denial of service.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetRebalancer.sol",
                "ssi-protocol/src/Swap.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-693"
                ],
                "2": [
                    "CWE-345"
                ],
                "3": [
                    "CWE-347"
                ]
            },
            "title": "Missing check for `chainId` in signature for `Order` and `HedgeOrder`",
            "description": "1. **Description:** The signature validation for Order and HedgeOrder does not include chainId, making signatures replayable across chains.\n2. **Cause:** Chain ID is not included in the signed message hash.\n3. **Exploitation:** A valid signature on one chain can be reused on another chain to execute unauthorized actions.\n4. **Impact:** Cross-chain replay attacks could lead to unauthorized swaps or asset transfers.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/Swap.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-372"
                ]
            },
            "title": "setFeeManager() does not restrict burningFee() == false, which may cause the fee manager to not work properly",
            "description": "1. **Description:** The setFeeManager function allows setting a fee manager even when burningFee is false, potentially breaking fee collection logic.\n2. **Cause:** Inconsistent state management between fee manager and burningFee flag.\n3. **Exploitation:** A misconfigured fee manager could be set, leading to failed fee operations.\n4. **Impact:** Fee collection may fail, affecting protocol revenue and functionality.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetFactory.sol",
                "ssi-protocol/src/AssetToken.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "addMintRequest() user may pay fees more than expected",
            "description": "1. **Description:** The addMintRequest function may cause users to pay higher fees than intended due to miscalculation or lack of fee capping.\n2. **Cause:** Insufficient fee validation or calculation logic.\n3. **Exploitation:** Users could be overcharged during minting requests.\n4. **Impact:** Financial loss for users and potential trust issues with the protocol.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetIssuer.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-269"
                ],
                "3": [
                    "CWE-250"
                ]
            },
            "title": "addMintRequest() gives swap maximum allowance, may be a security risk",
            "description": "1. **Description:** The addMintRequest function grants maximum ERC20 allowance to the swap contract, posing a security risk if the contract is compromised.\n2. **Cause:** Use of approve with max uint256 instead of precise amount.\n3. **Exploitation:** If the swap contract is exploited, an attacker could drain all of the user's tokens.\n4. **Impact:** Full loss of user funds associated with the approved token.\n",
            "severity": "Low",
            "location": [
                "AssetIssuer.sol::confirmMintRequest"
            ],
            "files": [
                "ssi-protocol/src/AssetIssuer.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "when status is CANCEL reject redeem request, May result in failure to close the request",
            "description": "1. **Description:** When a request is in CANCEL status, redeem requests are not properly rejected, potentially leaving requests open.\n2. **Cause:** Incomplete state handling for CANCEL status in redeem logic.\n3. **Exploitation:** Users may attempt to redeem on canceled requests, causing system errors or inconsistent state.\n4. **Impact:** State inconsistency and potential failure to finalize requests properly.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetIssuer.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-1329"
                ]
            },
            "title": "Restrictions on outByContract can't rollback, which may result in the request not being closed properly",
            "description": "1. **Description:** The outByContract restriction cannot be rolled back, which may prevent proper closure of requests.\n2. **Cause:** Immutable enforcement of outByContract without a revert or update mechanism.\n3. **Exploitation:** A misconfigured restriction could permanently block request closure.\n4. **Impact:** Requests may remain open indefinitely, affecting system state and user experience.\n",
            "severity": "Low",
            "location": [],
            "files": [
                "ssi-protocol/src/Swap.sol"
            ]
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Redundant storage gap in `HedgeOrder`",
            "description": "1. **Description:** The HedgeOrder contract contains a storage gap that is not utilized, wasting storage space.\n2. **Cause:** Presence of an unused gap variable without future upgrade planning.\n3. **Exploitation:** Not directly exploitable, but increases deployment cost.\n4. **Impact:** Increased gas costs for deployment and storage, though no direct security risk.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "ssi-protocol/src/USSI.sol"
            ]
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-435"
                ],
                "2": [
                    "CWE-436"
                ],
                "3": [
                    "CWE-115"
                ]
            },
            "title": "lock() It is recommended to use safeTransferFrom",
            "description": "1. **Description:** The lock() function uses raw transfer calls instead of safeTransferFrom, which may lead to issues with non-compliant ERC20 tokens.\n2. **Cause:** Direct use of transfer without safety checks for token compliance.\n3. **Exploitation:** Interaction with non-standard tokens could revert or behave unexpectedly.\n4. **Impact:** Potential transaction failures when handling certain ERC20 tokens.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "ssi-protocol/src/AssetLocking.sol"
            ]
        }
    ]
}