{
    "path": "dataset-curated/reports/OpenZeppelin/ZEROBASE Token Audit.md",
    "project_info": {
        "url": [
            "https://github.com/ZeroBase-Pro/Economics"
        ],
        "commit_id": [
            "3c55c3f9545b7be5b0574ddd96e60eba5f664bd1"
        ],
        "address": [
            "0xb733e5ff6361770771dcfe58491713661ac11bb3",
            "0x9c8749892de34dce62c06eb2e0fb1d62b8601a49"
        ],
        "chain": "evm/sepolia, evm/bsc-testnet",
        "compiler_version": "n/a",
        "audit_date": "2025-08-06",
        "project_path": {
            "Economics": "dataset-curated/contracts/ZEROBASE Token Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Hardcoded Etherscan API Keys",
            "description": "The ZeroBase.s.sol deployment script contains commented-out Forge CLI commands that include hardcoded Etherscan API keys. The root cause is the inclusion of sensitive credentials directly in source code, even when inactive. Although these commands are not executed, the presence of API keys in public repositories poses a security risk, as they can be scraped and abused, leading to quota exhaustion or unauthorized access to Etherscan's API services. This also reflects poor maintainability and operational security practices. The impact includes potential disruption of development workflows due to revoked or rate-limited API access if keys are compromised.\n",
            "severity": "Low",
            "location": [
                "ZeroBase.s.sol#L24-L25"
            ],
            "files": [
                "Economics/script/ZeroBase.s.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Missing Test Suite",
            "description": "The repository lacks a formal test suite to validate the correctness of the deployed contracts. This absence increases the risk of undetected bugs, regressions, or incorrect behavior in core functionalities such as deployment, ownership assignment, and token operations. The root cause is the omission of Foundry-style test files in the `test/` directory. Without automated tests, manual verification becomes error-prone and insufficient for ensuring reliability, especially in a cross-chain context. The impact is reduced confidence in contract correctness and increased risk during future development or upgrades.\n",
            "severity": "Low",
            "location": [],
            "files": []
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Limited Testing in CrossChainTransferScript",
            "description": "The CrossChainTransfer.s.sol script only tests transfers from Ethereum Sepolia to BSC testnet, omitting the reverse direction. This creates an incomplete validation of bidirectional cross-chain functionality, which is essential for a fully operational omnichain token. Additionally, the script uses a hardcoded recipient address that corresponds to the contract owner, which may bypass certain checks and fail to represent real-world usage. The root cause is incomplete test coverage and reliance on privileged addresses. The impact is potential undetected failures in reverse transfers and inaccurate simulation of user interactions.\n",
            "severity": "Low",
            "location": [
                "CrossChainTransfer.s.sol"
            ],
            "files": [
                "Economics/script/CrossChainTransfer.s.sol"
            ]
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ]
            },
            "title": "README.md Lacks ZEROBASE Token Documentation, Setup Instructions, and Contribution Guidelines",
            "description": "The project's README.md file is minimal and lacks essential documentation such as token overview, setup instructions, testing procedures, and contribution guidelines. This omission hinders onboarding for developers, auditors, and contributors. The root cause is insufficient project documentation practices. The impact includes reduced transparency, difficulty in reproducing or verifying the system, and barriers to community engagement and secure collaboration.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "Economics/README.md"
            ]
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ]
            },
            "title": "Improper Development Environment Configuration",
            "description": "The foundry.toml file indicates the use of Git submodules, but the required .gitmodules file is missing, breaking dependency management. Additionally, a node_modules folder exists without a corresponding package.json, making Node.js dependencies unclear. This misconfiguration undermines reproducibility and complicates collaboration. The root cause is incomplete setup of the development environment. The impact includes potential build failures, inconsistent setups across developers, and CI/CD pipeline issues.\n",
            "severity": "Informational",
            "location": [
                "foundry.toml"
            ],
            "files": [
                "Economics/foundry.toml",
                "Economics/node_modules"
            ]
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "Unnecessary Files and Folders Committed to Repository",
            "description": "The repository includes non-essential files such as broadcast/, cache/, lib/forge-std/, node_modules/, out/, and .DS_Store, which are build artifacts or system-generated files. These should be excluded from version control. The root cause is the absence of proper .gitignore rules. The impact includes increased repository size, noise in version history, merge conflicts, and potential platform-specific issues.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "Economics/broadcast",
                "Economics/cache",
                "Economics/node_modules",
                "Economics/out",
                "Economics/lib/forge-std"
            ]
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Unused Import",
            "description": "The script CrossChainTransfer.s.sol imports OFTReceipt from IOFT.sol but does not use it anywhere in the code. Unused imports reduce code clarity and increase compilation overhead. The root cause is failure to clean up unused dependencies after development. The impact is minor but contributes to technical debt and reduces maintainability.\n",
            "severity": "Informational",
            "location": [
                "CrossChainTransfer.s.sol#L7"
            ],
            "files": [
                "Economics/script/CrossChainTransfer.s.sol"
            ]
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ],
                "4": [
                    "CWE-1106"
                ]
            },
            "title": "Literal Number With Many Digits",
            "description": "The initial supply of the ZEROBASE token is defined using the raw literal 1000000000, which is difficult to read and prone to errors. The root cause is the lack of formatting for large numeric literals. This can lead to misinterpretation or typos, especially when verifying supply correctness. The impact is reduced code readability and potential for human error during audits or maintenance. Using scientific notation or underscores (e.g., 1e9 or 1_000_000_000) would improve clarity.\n",
            "severity": "Informational",
            "location": [
                "ZEROBASE.sol#L8"
            ],
            "files": [
                "Economics/src/ZEROBASE.sol"
            ]
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ]
            },
            "title": "Missing Security Contact",
            "description": "The ZEROBASE contract does not include a security contact via NatSpec comment (e.g., @custom:security-contact). This makes it difficult for security researchers to responsibly disclose vulnerabilities. The root cause is omission of standard security metadata. The impact is delayed or failed vulnerability reporting, increasing the window of exposure if a critical issue is discovered post-deployment.\n",
            "severity": "Informational",
            "location": [
                "ZEROBASE.sol"
            ],
            "files": [
                "Economics/src/ZEROBASE.sol"
            ]
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ]
            },
            "title": "Missing Docstrings",
            "description": "The ZEROBASE contract lacks NatSpec documentation for the contract itself, its constants, and constructor. This reduces code readability and tooling support (e.g., documentation generators, IDE hints). The root cause is insufficient inline documentation practices. The impact includes difficulty in understanding contract behavior, increased audit effort, and potential integration errors by third parties.\n",
            "severity": "Informational",
            "location": [
                "ZEROBASE.sol#L7-L16"
            ],
            "files": [
                "Economics/src/ZEROBASE.sol"
            ]
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "Incomplete Automation in SetTrustedRemoteScript for Peer Configuration",
            "description": "The SetTrustedRemote.s.sol script only configures the peer relationship in one direction (Sepolia → BSC), while the reverse configuration is commented out. Although both peers are correctly configured on-chain, the script requires manual intervention to complete setup. The root cause is incomplete automation logic. The impact is operational inefficiency, increased risk of human error during deployment, and reduced reliability of deployment scripts.\n",
            "severity": "Informational",
            "location": [
                "SetTrustedRemote.s.sol#L26-L28"
            ],
            "files": [
                "Economics/script/SetTrustedRemote.s.sol"
            ]
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1164"
                ]
            },
            "title": "Commented-out code can negatively impact code clarity and readability",
            "description": "The ZeroBase.s.sol script contains redundant commented-out code (e.g., line 10), which degrades code clarity and maintainability. Although one instance was removed, a new commented line was introduced in the fix. The root cause is inconsistent cleanup of development artifacts. The impact is reduced readability and potential confusion for auditors or developers interpreting the code.\n",
            "severity": "Informational",
            "location": [
                "ZeroBase.s.sol#L10"
            ],
            "files": [
                "Economics/script/ZeroBase.s.sol"
            ]
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-710"
                ]
            },
            "title": "SPDX License Set to Unlicensed",
            "description": "All source files use the SPDX license identifier \"UNLICENSED\", which may lead to legal ambiguity regarding code usage and distribution. The root cause is missing or intentionally omitted licensing. The impact includes uncertainty for contributors and integrators about permitted uses, potentially deterring adoption or collaboration. Adopting a clear open-source license (e.g., MIT, GPL) is considered a best practice.\n",
            "severity": "Informational",
            "location": [],
            "files": [
                "Economics/script/SetTrustedRemote.s.sol",
                "Economics/script/ZeroBase.s.sol",
                "Economics/script/CrossChainTransfer.s.sol",
                "Economics/src/ZEROBASE.sol"
            ]
        }
    ]
}