{
    "path": "dataset-curated/reports/OpenZeppelin/ZKsync Paymaster Audit.md",
    "project_info": {
        "url": [
            "https://github.com/zksync-association/zk-governance"
        ],
        "commit_id": [
            "70011bb4092a774ff96d4e68cb80313ee1b33e74"
        ],
        "address": null,
        "chain": "zksync",
        "compiler_version": "n/a",
        "audit_date": "2024-04-14",
        "project_path": {
            "zk-governance": "dataset-curated/contracts/ZKsync Paymaster Audit.md-source"
        }
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-362"
                ]
            },
            "title": "Race Condition During Cancelation",
            "description": "The `cancelNonce` function in the `SignatureBasedPaymaster` contract is vulnerable to a race condition. The issue arises because the function cancels the next nonce instead of a specific targeted nonce. If the owner or signer calls `cancelNonce` but a transaction using the current nonce is confirmed first, the cancellation will incorrectly apply to the subsequent nonce, potentially blocking legitimate future transactions. This behavior stems from the function's inability to validate the current state of the nonce before cancellation. An attacker (or even a legitimate sender experiencing latency) could exploit this by rushing a transaction just before the cancellation, causing the wrong nonce to be invalidated. The impact includes potential disruption of valid sender operations and reduced reliability of the paymaster system.\n",
            "severity": "Low",
            "location": [
                "SignatureBasedPaymaster.sol::cancelNonce#175"
            ],
            "files": [
                "zk-governance/contracts/SignatureBasedPaymaster.sol"
            ]
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1076"
                ],
                "3": [
                    "CWE-1078"
                ],
                "4": [
                    "CWE-1099"
                ]
            },
            "title": "Naming Suggestion",
            "description": "The second parameter of the `NonceCanceled` event in `ISignatureBasedPaymaster.sol` is named `newNonce`, which is misleading because it actually refers to the nonce that is being canceled, not a new one. This incorrect naming can lead to confusion for developers and external tools interpreting event logs, increasing the risk of misinterpretation during debugging or monitoring. The root cause is poor naming convention, which fails to accurately reflect the parameter's purpose. While this does not lead to direct exploitation or functional bugs, it reduces code clarity and maintainability. The impact is limited to developer experience and potential errors in off-chain systems that consume this event.\n",
            "severity": "Low",
            "location": [
                "ISignatureBasedPaymaster.sol::NonceCanceled#8"
            ],
            "files": [
                "zk-governance/contracts/interfaces/ISignatureBasedPaymaster.sol"
            ]
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1059"
                ],
                "3": [
                    "CWE-1111"
                ]
            },
            "title": "Incomplete Docstrings",
            "description": "Multiple functions and parameters across the codebase lack complete NatSpec documentation. For example, the `postTransaction` function in `IPaymaster.sol` does not document the `_txHash` and `_suggestedSignedHash` parameters, and the `domainSeparator` function in `SignatureBasedPaymaster.sol` does not describe its return value. This omission reduces code readability and increases the risk of misuse by external developers or auditors who rely on documentation to understand expected behavior. The root cause is incomplete documentation practices. While this does not introduce a direct security vulnerability, it can lead to integration errors or misunderstandings about security guarantees. The impact is a reduction in code maintainability and increased potential for human error during development or review.\n",
            "severity": "Low",
            "location": [
                "IPaymaster.sol::postTransaction#90-97",
                "SignatureBasedPaymaster.sol::domainSeparator#190-192"
            ],
            "files": [
                "zk-governance/contracts/interfaces/IPaymaster.sol",
                "zk-governance/contracts/SignatureBasedPaymaster.sol"
            ]
        }
    ]
}